In [3]:
import pandas as pd
import tensorflow_hub as hub
import openai 
import numpy as np
import altair as alt
from openai import OpenAI
from sql_metadata import Parser
import os
from IPython.display import display, Markdown
import ast
import cx_Oracle
import re

from pathlib import Path
import sys
import json
import requests

# Read csv-files

In [4]:
prefix = Path.cwd().parent.parent
pd.set_option('display.max_columns', None)
pd.set_option('display.max_colwidth', None)
prefix

PosixPath('/home/skikk/Dokumente/uni/WS2324/MIT/llm-enterprise')

In [14]:
with open('../../config.json') as f:
  config = json.load(f)

In [4]:
df_q = pd.read_json((str(prefix) + '/data/50_queries.json'))

In [5]:
df_q

,question,sql
0,How many organisation units in human resources are relabeled?,SELECT COUNT(*) FROM (SELECT hr_org_unit_key FROM hr_org_unit_new INTERSECT SELECT hr_org_unit_key FROM hr_org_unit);
1,How many organisation units in human resources are new and not relabeled?,SELECT COUNT(*) FROM (SELECT hr_org_unit_key FROM hr_org_unit_new MINUS SELECT hr_org_unit_key FROM hr_org_unit);
2,COUNT the number of courses offered by each department.,"SELECT OFFER_DEPT_CODE, COUNT(*) AS course_COUNT FROM SUBJECT_ENROLLABLE GROUP BY OFFER_DEPT_CODE;"
3,"What are the past, upcoming, and current courses?","SELECT DISTINCT subject_title, academic_terms.term_code, CASE WHEN term_start_date > SYSDATE THEN 'Upcoming' WHEN term_start_date <= SYSDATE AND term_end_date > SYSDATE THEN 'Current' ELSE 'Past' END AS term_status FROM SUBJECT_SUMMARY, academic_terms WHERE SUBJECT_SUMMARY.term_code = academic_terms.term_code;"
4,Which faculty has had the most location changes?,SELECT MAX(cnt) FROM (SELECT COUNT(*) AS cnt FROM WAREUSER.FCLT_BUILDING_ADDRESS_HIST GROUP BY fclt_building_key);
5,What is the average number of courses a student can enroll in?,"SELECT AVG(cnt) FROM (SELECT COUNT(*) AS cnt FROM mit_student_directory, SUBJECT_SUMMARY WHERE DEPARTMENT_CODE = department GROUP BY full_name);"
6,Which students are employed by mit?,"SELECT DISTINCT empl.full_name FROM mit_student_directory mit, employee_directory empl WHERE empl.full_name = mit.full_name;"
7,What is the shortest course available this semester?,"SELECT DISTINCT subject_title, term_end_date - term_start_date FROM (SELECT MIN(term_end_date - term_start_date) AS min_duration FROM academic_terms), academic_terms, SUBJECT_SUMMARY WHERE SUBJECT_SUMMARY.term_code = ACADEMIC_TERMS.TERM_CODE AND term_end_date - term_start_date = min_duration;"
8,Show buildings and their address.,"SELECT fb.building_name, fba.* FROM wareuser.fac_building fb INNER JOIN wareuser.fac_building_address fba ON fb.FAC_BUILDING_KEY = fba.building_key;"
9,How many students do we have?,SELECT COUNT(*) FROM mit_student_directory;
10,Show all statuses for materials?,SELECT DISTINCT library_material_status FROM library_material_status UNION SELECT DISTINCT tip_material_status FROM tip_material_status;
11,What are the different cities WHERE people live?,SELECT DISTINCT city_name FROM zip_usa UNION SELECT DISTINCT city_name FROM zip_canada;
12,Give the average number of courses in one department with more than 100 courses.,"SELECT AVG(offered_subject_nr) FROM (SELECT DISTINCT DEPARTMENT_NAME, COUNT(*) OVER (PARTITION BY DEPARTMENT_NAME) AS offered_subject_nr FROM SUBJECT_SUMMARY) WHERE offered_subject_nr >= 100;"
13,Count the number of rooms in a building.,"SELECT DISTINCT BUILDING_NAME_LONG, COUNT(*) OVER (PARTITION BY BUILDING_NAME_LONG) FROM fclt_rooms, fclt_building WHERE fclt_rooms.fclt_building_key = fclt_building.fclt_building_key;"
14,Count the number of space-units per building.,"SELECT DISTINCT BUILDING_NAME_LONG, num_spaces FROM (SELECT BUILDING_KEY, COUNT(*) OVER (PARTITION BY BUILDING_KEY) as num_spaces FROM SPACE_DETAIL) sd, FAC_BUILDING WHERE FAC_BUILDING.FAC_BUILDING_KEY = sd.BUILDING_KEY;"
15,"For courses that have descriptions of Regular and Initial, what are their start dates?","SELECT SUBJECT_TITLE, TERM_START_DATE FROM (SELECT * FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE SUBJECT_DESCRIPTION LIKE '%regular%' OR SUBJECT_DESCRIPTION LIKE '%initial%') COURSE_CATALOG_SUBJECT_OFFERED, ACADEMIC_TERMS_ALL WHERE COURSE_CATALOG_SUBJECT_OFFERED.EFFECTIVE_TERM_CODE = ACADEMIC_TERMS_ALL.TERM_CODE;"
16,What are the names of the 3 departments which offer the most courses per semester?,"SELECT * FROM (SELECT DISTINCT DEPARTMENT_NAME, COUNT(*) OVER (PARTITION BY DEPARTMENT_NAME) AS numcourses FROM SUBJECT_SUMMARY ORDER BY numcourses DESC) WHERE rownum <= 3;"
17,WHERE is Prof. Michael Stonebraker's office?,"SELECT Room, floor, fac_building_address.* FROM (SELECT office_location FROM employee_directory WHERE full_name = 'Stonebraker, Michael'), fac_rooms, fac_building_address WHERE office_location = fac_room_key AND fac_rooms.building_key = fac_building_address.BUILDING_KEY;"
18,Which employees at MIT have a namesake?,"SELECT DISTINCT MIT_ID, employee.* FROM (SELECT full_name, COUNT(*) OVER (PARTITION BY full_name) AS cnt FROM employee_directory) employee, employee_directory WHERE employee.full_name = employee_directory.full_name AND cnt >= 2 ORDER BY employee.full_name;"
19,Show the name for subjects which are enrollable for Computer Science Students.,SELECT DISTINCT subject_title FROM SUBJECT_SUMMARY WHERE department_name = 'Electrical Eng & Computer Sci';
20,How many students does each department have?,"SELECT department_name, COUNT(*) OVER (PARTITION BY department_name) FROM mit_student_directory;"
21,What categories are there for independent activities periods?,SELECT DISTINCT IAP_CATEGORY_NAME FROM IAP_SUBJECT_CATEGORY;
22,Find the city with the post code 501.,"SELECT COUNT(*) FROM ((SELECT zip_code, city_name FROM zip_usa) UNION (SELECT postal_code, city_name FROM zip_canada)) WHERE zip_code = '00501';"
23,How many employees are there all in all?,SELECT COUNT(DISTINCT MIT_ID) FROM employee_directory;
24,How many departments does each school have?,"SELECT DISTINCT school_name, COUNT(department_name) OVER (PARTITION BY school_name) FROM student_department;"
25,"Show the name, kerberos credentials, and email for the employee with the name 'Michael'.","SELECT full_name, krb_name, email_address FROM employee_directory WHERE first_name = 'Michael';"
26,Show the school with the largest number of departments.,"SELECT * FROM (SELECT * FROM (SELECT DISTINCT school_name, COUNT(department_name) OVER (PARTITION BY school_name) AS cnt FROM student_department) ORDER BY cnt DESC) WHERE rownum <= 1;"
27,What are the courses with the maximum number of units?,"SELECT * FROM SUBJECT_SUMMARY, (SELECT MAX(total_units) AS maxi FROM SUBJECT_SUMMARY) WHERE total_units = maxi;"
28,What is the TDL for Brazil?,SELECT * FROM top_level_domain WHERE top_level_domain_description = 'Brazil';
29,What are all the different start dates of courses of computer science that lasted less than 100 days?,"SELECT DISTINCT * FROM (SELECT subject_title, department_name, term_start_date, term_end_date - term_start_date AS duration FROM SUBJECT_SUMMARY a, ACADEMIC_TERMS b WHERE a.term_code = b.term_code AND department_name = 'Electrical Eng & Computer Sci') WHERE duration <= 100;"
30,List the courses and format for all courses that have a number of attendees greater than 800.,"SELECT DISTINCT subject_title, form_type, num_enrolled_students FROM subject_offered WHERE num_enrolled_students > 800;"
31,Which textbook-material is used the most often?,"SELECT * FROM (SELECT * FROM (SELECT c.title, c.isbn, COUNT(*) OVER (PARTITION BY c.title, c.isbn) AS cnt FROM tip_detail a, tip_subject_offered b, tip_material c WHERE is_no_course_material LIKE 'N' AND a.tip_subject_offered_key = b.tip_subject_offered_key AND a.tip_material_key = c.tip_material_key) ORDER BY cnt DESC) WHERE ROWNUM <= 1;"
32,"Show activity title, location, and supervisor for all independent activities ordered by start-date.","SELECT DISTINCT activity_title, session_location, term_start_date, person_name AS Leader FROM iap_subject_detail a, iap_subject_person b, academic_terms_all c, iap_subject_session d WHERE a.iap_subject_person_key = b.iap_subject_person_key AND a.iap_subject_session_key = d.iap_subject_session_key AND c.term_code = a.term_code AND b.person_role = 'Activity leader';"
33,"What are the titles and isbn numbers for all materials, sorted in ascending order of their price?","SELECT DISTINCT title, isbn, new_shelf_price FROM tip_material ORDER BY new_shelf_price ASC;"
34,Which were the first registered subjects?,"SELECT subject_title FROM COURSE_CATALOG_SUBJECT_OFFERED c, ACADEMIC_TERMS d, (SELECT MIN(academic_year) AS mini FROM COURSE_CATALOG_SUBJECT_OFFERED) WHERE c.effective_term_code = d.term_code AND d.academic_year = mini;"
35,How many departments have less than 300 students?,"SELECT COUNT(*) FROM (SELECT DISTINCT department_name, COUNT(*) OVER (PARTITION BY department_name) AS cnt FROM mit_student_directory) WHERE cnt <= 300;"
36,Which department has the most kinds of payroll ranks?,"SELECT * FROM (SELECT DISTINCT department_name, COUNT(DISTINCT payroll_rank) OVER (PARTITION BY department_name) AS cnt FROM wareuser.se_person a, employee_directory b WHERE a.mit_id = b.mit_id) a, (SELECT MAX(cnt) AS m FROM ((SELECT DISTINCT department_name, COUNT(DISTINCT payroll_rank) OVER (PARTITION BY department_name) AS cnt FROM wareuser.se_person a, employee_directory b WHERE a.mit_id = b.mit_id)) ) b WHERE a.cnt = b.m;"
37,List email adress and names of student and employee whose first name is Carole.,"SELECT DISTINCT full_name, email_address FROM (SELECT DISTINCT first_name, full_name, email_address FROM mit_student_directory union SELECT DISTINCT first_name, full_name, email_address FROM employee_directory) WHERE first_name = 'Carole';"
38,what are the different payment roll ranks?,SELECT DISTINCT payroll_rank FROM wareuser.se_person;
39,List buildings which were build before 1950 and have more than 100 employees.,"SELECT * FROM (SELECT DISTINCT BUILDING_NAME_LONG, year_built, COUNT(*) OVER (PARTITION BY BUILDING_NAME_LONG, year_built) as num_employees FROM ( SELECT * FROM (SELECT DISTINCT FCLT_BUILDING_KEY, BUILDING_NAME_LONG, extract(year FROM TO_DATE(date_built, 'MM/DD/YYYY')) as year_built FROM wareuser.fclt_building_hist) WHERE year_built <= 1950) a, fclt_rooms, employee_directory WHERE OFFICE_LOCATION = BUILDING_ROOM and fclt_rooms.FCLT_BUILDING_KEY = a.FCLT_BUILDING_KEY) WHERE num_employees >100;"
40,How many courses are there in the centre for international studies?,SELECT COUNT(DISTINCT subject_id) FROM cis_course_catalog;
41,What is the number of offered courses WHERE more than 100 students are enrolled?,SELECT COUNT(DISTINCT subject_id) FROM subject_offered WHERE num_enrolled_students > 100;
42,Who is sharing his office with at least one other person?,"SELECT DISTINCT mit_id, full_name, a.office_location, num_employees FROM DRUPAL_EMPLOYEE_DIRECTORY a, (SELECT office_location, COUNT(mit_id) OVER(PARTITION BY office_location) as num_employees FROM (SELECT mit_id, office_location FROM DRUPAL_EMPLOYEE_DIRECTORY union SELECT full_name, office_location FROM mit_student_directory)) b WHERE b.num_employees>= 2 and b.office_location = a.office_location;"
43,List the subject-groups and their number of courses which start in March?,"SELECT DISTINCT CLUSTER_LIST, COUNT(subject_id) OVER (PARTITION BY CLUSTER_LIST) FROM SUBJECT_SUMMARY, academic_terms_all WHERE extract(month FROM term_start_date) = 3;"
44,"List course instructors, their courses and the amount of material for them.","SELECT DISTINCT instructor_name, subject_title, COUNT(catalog_isbn) OVER (PARTITION BY instructor_name, subject_title) FROM LIBRARY_COURSE_INSTRUCTOR, LIBRARY_RESERVE_MATRL_DETAIL, LIBRARY_SUBJECT_OFFERED, LIBRARY_RESERVE_CATALOG WHERE LIBRARY_COURSE_INSTRUCTOR.LIBRARY_COURSE_INSTRUCTOR_KEY = LIBRARY_RESERVE_MATRL_DETAIL.LIBRARY_COURSE_INSTRUCTOR_KEY and LIBRARY_RESERVE_CATALOG.LIBRARY_RESERVE_CATALOG_KEY = LIBRARY_RESERVE_MATRL_DETAIL.LIBRARY_RESERVE_CATALOG_KEY and LIBRARY_SUBJECT_OFFERED.LIBRARY_SUBJECT_OFFERED_KEY = LIBRARY_RESERVE_MATRL_DETAIL.LIBRARY_SUBJECT_OFFERED_KEY;"
45,Which building accomodates the most students?,"SELECT * FROM( SELECT * FROM( SELECT DISTINCT building_name, num_students FROM (SELECT fclt_building_key, COUNT(full_name) OVER (PARTITION BY fclt_building_key) as num_students FROM fclt_rooms, mit_student_directory WHERE office_location=BUILDING_ROOM) a, fclt_building WHERE a.fclt_building_key = fclt_building.fclt_building_key) ORDER BY num_students DESC)WHERE ROWNUM <= 1;"
46,Which building has on average the most rooms per floor?,"SELECT * FROM(SELECT DISTINCT building_name, num_rooms/num_floors FROM( SELECT fclt_building_key, COUNT(DISTINCT fclt_floor_key) OVER (PARTITION BY fclt_building_key) as num_floors, COUNT(DISTINCT fclt_room_key) OVER (PARTITION BY fclt_building_key) as num_rooms FROM fclt_rooms) a, fclt_building WHERE a.fclt_building_key = fclt_building.fclt_building_key ORDER BY num_rooms/num_floors DESC) WHERE ROWNUM <= 1;"
47,What is the most common usage for all rooms.,"SELECT * FROM(SELECT DISTINCT major_use, num_rooms FROM (SELECT fclt_major_use_key, COUNT(fclt_room_key) OVER (PARTITION BY fclt_major_use_key) as num_rooms FROM fclt_rooms) a, fclt_major_use WHERE a.fclt_major_use_key = fclt_major_use.fclt_major_use_key ORDER BY num_rooms DESC) WHERE rownum <= 1;"
48,Which IAP instructor has held the most sessions of the same course?,"SELECT * FROM (SELECT DISTINCT person_name, activity_title, COUNT(IAP_subject_session_key) OVER (PARTITION BY person_name,activity_title) as num_session FROM iap_subject_detail, iap_subject_person WHERE IAP_SUBJECT_PERSON.IAP_SUBJECT_PERSON_KEY = IAP_SUBJECT_DETAIL.IAP_SUBJECT_PERSON_KEY) ORDER BY num_session DESC;"
49,What is the largest building?,"SELECT * FROM(SELECT DISTINCT building_key, sum(room_square_footage) OVER (PARTITION BY building_key) as total_square_footage FROM space_detail) ORDER BY total_square_footage DESC;"

In [40]:
tables = []
for q in df_q['sql']:
    tables.append(Parser(q.upper().replace('WAREUSER.', '')).tables)
tables

[['HR_ORG_UNIT_NEW', 'HR_ORG_UNIT'],
 ['HR_ORG_UNIT_NEW', 'HR_ORG_UNIT'],
 ['SUBJECT_ENROLLABLE'],
 ['SUBJECT_SUMMARY', 'ACADEMIC_TERMS'],
 ['FCLT_BUILDING_ADDRESS_HIST'],
 ['MIT_STUDENT_DIRECTORY', 'SUBJECT_SUMMARY'],
 ['MIT_STUDENT_DIRECTORY', 'EMPLOYEE_DIRECTORY'],
 ['ACADEMIC_TERMS', 'SUBJECT_SUMMARY'],
 ['FAC_BUILDING', 'FAC_BUILDING_ADDRESS'],
 ['MIT_STUDENT_DIRECTORY'],
 ['LIBRARY_MATERIAL_STATUS', 'TIP_MATERIAL_STATUS'],
 ['ZIP_USA', 'ZIP_CANADA'],
 ['SUBJECT_SUMMARY'],
 ['FCLT_ROOMS', 'FCLT_BUILDING'],
 ['SPACE_DETAIL', 'FAC_BUILDING'],
 ['COURSE_CATALOG_SUBJECT_OFFERED', 'ACADEMIC_TERMS_ALL'],
 ['SUBJECT_SUMMARY'],
 ['EMPLOYEE_DIRECTORY', 'FAC_ROOMS', 'FAC_BUILDING_ADDRESS'],
 ['EMPLOYEE_DIRECTORY'],
 ['SUBJECT_SUMMARY'],
 ['MIT_STUDENT_DIRECTORY'],
 ['IAP_SUBJECT_CATEGORY'],
 ['ZIP_USA', 'ZIP_CANADA'],
 ['EMPLOYEE_DIRECTORY'],
 ['STUDENT_DEPARTMENT'],
 ['EMPLOYEE_DIRECTORY'],
 ['STUDENT_DEPARTMENT'],
 ['SUBJECT_SUMMARY'],
 ['TOP_LEVEL_DOMAIN'],
 ['SUBJECT_SUMMARY', 'ACADEMIC_TERMS'],
 ['SUBJECT_OFFERED'],
 ['TIP_DETAIL', 'TIP_SUBJECT_OFFERED', 'TIP_MATERIAL'],
 ['IAP_SUBJECT_DETAIL',
  'IAP_SUBJECT_PERSON',
  'ACADEMIC_TERMS_ALL',
  'IAP_SUBJECT_SESSION'],
 ['TIP_MATERIAL'],
 ['COURSE_CATALOG_SUBJECT_OFFERED', 'ACADEMIC_TERMS'],
 ['MIT_STUDENT_DIRECTORY'],
 ['SE_PERSON', 'EMPLOYEE_DIRECTORY'],
 ['MIT_STUDENT_DIRECTORY', 'EMPLOYEE_DIRECTORY'],
 ['SE_PERSON'],
 ['FCLT_BUILDING_HIST', 'FCLT_ROOMS', 'EMPLOYEE_DIRECTORY'],
 ['CIS_COURSE_CATALOG'],
 ['SUBJECT_OFFERED'],
 ['DRUPAL_EMPLOYEE_DIRECTORY', 'MIT_STUDENT_DIRECTORY'],
 ['SUBJECT_SUMMARY', 'ACADEMIC_TERMS_ALL'],
 ['LIBRARY_COURSE_INSTRUCTOR',
  'LIBRARY_RESERVE_MATRL_DETAIL',
  'LIBRARY_SUBJECT_OFFERED',
  'LIBRARY_RESERVE_CATALOG'],
 ['FCLT_ROOMS', 'MIT_STUDENT_DIRECTORY', 'FCLT_BUILDING'],
 ['FCLT_ROOMS', 'FCLT_BUILDING'],
 ['FCLT_ROOMS', 'FCLT_MAJOR_USE'],
 ['IAP_SUBJECT_DETAIL', 'IAP_SUBJECT_PERSON'],
 ['SPACE_DETAIL']]

In [10]:
from typing import *
def table(test:List[Tuple[str, str]]):
    print(test[0][1])

In [ ]:
"You are a OracleSQL expert. Given an input question, create a syntactically correct OracleSQL query to run and return ONLY the generated Query and nothing else.\
Pay close attention on which column is in which table. if context contains more than one tables then create a query by performing JOIN operation only using the column unitid for the tables.\
Follow these Instructions for creating syntactically correct SQL query:\
- Be sure not to query for columns that do not exist in the tables and use alias only where required.\
- Likewise, when asked about the average (AVG function) or ratio, ensure the appropriate aggregation function is used.\
- Pay close attention to the filtering criteria mentioned in the question and incorporate them using the WHERE clause in your SQL query.\
- If the question involves multiple conditions, use logical operators such as AND, OR to combine them effectively.\
- When dealing with date or timestamp columns, use appropriate date functions (e.g., DATE_PART, EXTRACT) for extracting specific parts of the date or performing date arithmetic.\
- If the question involves grouping of data (e.g., finding totals or averages for different categories), use the GROUP BY clause along with appropriate aggregate functions.\
- Consider using aliases for tables and columns to improve readability of the query, especially in case of complex joins or subqueries.\
- If necessary, use subqueries or common table expressions (CTEs) to break down the problem into smaller, more manageable parts."

## Identify the unique tables referred by the corpus

In [3]:
test = {'A':'2345', 'B': '3454634546'}
for key in test:
    print(test[key])

2345
3454634546

In [41]:
unique_tables = set()
for  l in tables: 
    for t in l:
        unique_tables.add(t.upper())

In [46]:
unique_tables = sorted(list(unique_tables))
unique_tables

['ACADEMIC_TERMS',
 'ACADEMIC_TERMS_ALL',
 'CIS_COURSE_CATALOG',
 'COURSE_CATALOG_SUBJECT_OFFERED',
 'DRUPAL_EMPLOYEE_DIRECTORY',
 'EMPLOYEE_DIRECTORY',
 'FAC_BUILDING',
 'FAC_BUILDING_ADDRESS',
 'FAC_ROOMS',
 'FCLT_BUILDING',
 'FCLT_BUILDING_ADDRESS_HIST',
 'FCLT_BUILDING_HIST',
 'FCLT_MAJOR_USE',
 'FCLT_ROOMS',
 'HR_ORG_UNIT',
 'HR_ORG_UNIT_NEW',
 'IAP_SUBJECT_CATEGORY',
 'IAP_SUBJECT_DETAIL',
 'IAP_SUBJECT_PERSON',
 'IAP_SUBJECT_SESSION',
 'LIBRARY_COURSE_INSTRUCTOR',
 'LIBRARY_MATERIAL_STATUS',
 'LIBRARY_RESERVE_CATALOG',
 'LIBRARY_RESERVE_MATRL_DETAIL',
 'LIBRARY_SUBJECT_OFFERED',
 'MIT_STUDENT_DIRECTORY',
 'SE_PERSON',
 'SPACE_DETAIL',
 'STUDENT_DEPARTMENT',
 'SUBJECT_ENROLLABLE',
 'SUBJECT_OFFERED',
 'SUBJECT_SUMMARY',
 'TIP_DETAIL',
 'TIP_MATERIAL',
 'TIP_MATERIAL_STATUS',
 'TIP_SUBJECT_OFFERED',
 'TOP_LEVEL_DOMAIN',
 'ZIP_CANADA',
 'ZIP_USA']

In [47]:
len(unique_tables)

39

In [11]:
df_q

,question,sql,tables
0,How many organisation units in human resources are relabeled?,SELECT COUNT(*) FROM (SELECT hr_org_unit_key FROM hr_org_unit_new INTERSECT SELECT hr_org_unit_key FROM hr_org_unit);,"[HR_ORG_UNIT_NEW, HR_ORG_UNIT]"
1,How many organisation units in human resources are new and not relabeled?,SELECT COUNT(*) FROM (SELECT hr_org_unit_key FROM hr_org_unit_new MINUS SELECT hr_org_unit_key FROM hr_org_unit);,"[HR_ORG_UNIT_NEW, HR_ORG_UNIT]"
2,COUNT the number of courses offered by each department.,"SELECT OFFER_DEPT_CODE, COUNT(*) AS course_COUNT FROM SUBJECT_ENROLLABLE GROUP BY OFFER_DEPT_CODE;",[SUBJECT_ENROLLABLE]
3,"What are the past, upcoming, and current courses?","SELECT DISTINCT subject_title, academic_terms.term_code, CASE WHEN term_start_date > SYSDATE THEN 'Upcoming' WHEN term_start_date <= SYSDATE AND term_end_date > SYSDATE THEN 'Current' ELSE 'Past' END AS term_status FROM SUBJECT_SUMMARY, academic_terms WHERE SUBJECT_SUMMARY.term_code = academic_terms.term_code;","[SUBJECT_SUMMARY, ACADEMIC_TERMS]"
4,Which faculty has had the most location changes?,SELECT MAX(cnt) FROM (SELECT COUNT(*) AS cnt FROM WAREUSER.FCLT_BUILDING_ADDRESS_HIST GROUP BY fclt_building_key);,[FCLT_BUILDING_ADDRESS_HIST]
5,What is the average number of courses a student can enroll in?,"SELECT AVG(cnt) FROM (SELECT COUNT(*) AS cnt FROM mit_student_directory, SUBJECT_SUMMARY WHERE DEPARTMENT_CODE = department GROUP BY full_name);","[MIT_STUDENT_DIRECTORY, SUBJECT_SUMMARY]"
6,Which students are employed by mit?,"SELECT DISTINCT empl.full_name FROM mit_student_directory mit, employee_directory empl WHERE empl.full_name = mit.full_name;","[MIT_STUDENT_DIRECTORY, EMPLOYEE_DIRECTORY]"
7,What is the shortest course available this semester?,"SELECT DISTINCT subject_title, term_end_date - term_start_date FROM (SELECT MIN(term_end_date - term_start_date) AS min_duration FROM academic_terms), academic_terms, SUBJECT_SUMMARY WHERE SUBJECT_SUMMARY.term_code = ACADEMIC_TERMS.TERM_CODE AND term_end_date - term_start_date = min_duration;","[ACADEMIC_TERMS, SUBJECT_SUMMARY]"
8,Show buildings and their address.,"SELECT fb.building_name, fba.* FROM wareuser.fac_building fb INNER JOIN wareuser.fac_building_address fba ON fb.FAC_BUILDING_KEY = fba.building_key;","[FAC_BUILDING, FAC_BUILDING_ADDRESS]"
9,How many students do we have?,SELECT COUNT(*) FROM mit_student_directory;,[MIT_STUDENT_DIRECTORY]
10,Show all statuses for materials?,SELECT DISTINCT library_material_status FROM library_material_status UNION SELECT DISTINCT tip_material_status FROM tip_material_status;,"[LIBRARY_MATERIAL_STATUS, TIP_MATERIAL_STATUS]"
11,What are the different cities WHERE people live?,SELECT DISTINCT city_name FROM zip_usa UNION SELECT DISTINCT city_name FROM zip_canada;,"[ZIP_USA, ZIP_CANADA]"
12,Give the average number of courses in one department with more than 100 courses.,"SELECT AVG(offered_subject_nr) FROM (SELECT DISTINCT DEPARTMENT_NAME, COUNT(*) OVER (PARTITION BY DEPARTMENT_NAME) AS offered_subject_nr FROM SUBJECT_SUMMARY) WHERE offered_subject_nr >= 100;",[SUBJECT_SUMMARY]
13,Count the number of rooms in a building.,"SELECT DISTINCT BUILDING_NAME_LONG, COUNT(*) OVER (PARTITION BY BUILDING_NAME_LONG) FROM fclt_rooms, fclt_building WHERE fclt_rooms.fclt_building_key = fclt_building.fclt_building_key;","[FCLT_ROOMS, FCLT_BUILDING]"
14,Count the number of space-units per building.,"SELECT DISTINCT BUILDING_NAME_LONG, num_spaces FROM (SELECT BUILDING_KEY, COUNT(*) OVER (PARTITION BY BUILDING_KEY) as num_spaces FROM SPACE_DETAIL) sd, FAC_BUILDING WHERE FAC_BUILDING.FAC_BUILDING_KEY = sd.BUILDING_KEY;","[SPACE_DETAIL, FAC_BUILDING]"
15,"For courses that have descriptions of Regular and Initial, what are their start dates?","SELECT SUBJECT_TITLE, TERM_START_DATE FROM (SELECT * FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE SUBJECT_DESCRIPTION LIKE '%regular%' OR SUBJECT_DESCRIPTION LIKE '%initial%') COURSE_CATALOG_SUBJECT_OFFERED, ACADEMIC_TERMS_ALL WHERE COURSE_CATALOG_SUBJECT_OFFERED.EFFECTIVE_TERM_CODE = ACADEMIC_TERMS_ALL.TERM_CODE;","[COURSE_CATALOG_SUBJECT_OFFERED, ACADEMIC_TERMS_ALL]"
16,What are the names of the 3 departments which offer the most courses per semester?,"SELECT * FROM (SELECT DISTINCT DEPARTMENT_NAME, COUNT(*) OVER (PARTITION BY DEPARTMENT_NAME) AS numcourses FROM SUBJECT_SUMMARY ORDER BY numcourses DESC) WHERE rownum <= 3;",[SUBJECT_SUMMARY]
17,WHERE is Prof. Michael Stonebraker's office?,"SELECT Room, floor, fac_building_address.* FROM (SELECT office_location FROM employee_directory WHERE full_name = 'Stonebraker, Michael'), fac_rooms, fac_building_address WHERE office_location = fac_room_key AND fac_rooms.building_key = fac_building_address.BUILDING_KEY;","[EMPLOYEE_DIRECTORY, FAC_ROOMS, FAC_BUILDING_ADDRESS]"
18,Which employees at MIT have a namesake?,"SELECT DISTINCT MIT_ID, employee.* FROM (SELECT full_name, COUNT(*) OVER (PARTITION BY full_name) AS cnt FROM employee_directory) employee, employee_directory WHERE employee.full_name = employee_directory.full_name AND cnt >= 2 ORDER BY employee.full_name;",[EMPLOYEE_DIRECTORY]
19,Show the name for subjects which are enrollable for Computer Science Students.,SELECT DISTINCT subject_title FROM SUBJECT_SUMMARY WHERE department_name = 'Electrical Eng & Computer Sci';,[SUBJECT_SUMMARY]
20,How many students does each department have?,"SELECT department_name, COUNT(*) OVER (PARTITION BY department_name) FROM mit_student_directory;",[MIT_STUDENT_DIRECTORY]
21,What categories are there for independent activities periods?,SELECT DISTINCT IAP_CATEGORY_NAME FROM IAP_SUBJECT_CATEGORY;,[IAP_SUBJECT_CATEGORY]
22,Find the city with the post code 501.,"SELECT COUNT(*) FROM ((SELECT zip_code, city_name FROM zip_usa) UNION (SELECT postal_code, city_name FROM zip_canada)) WHERE zip_code = '00501';","[ZIP_USA, ZIP_CANADA]"
23,How many employees are there all in all?,SELECT COUNT(DISTINCT MIT_ID) FROM employee_directory;,[EMPLOYEE_DIRECTORY]
24,How many departments does each school have?,"SELECT DISTINCT school_name, COUNT(department_name) OVER (PARTITION BY school_name) FROM student_department;",[STUDENT_DEPARTMENT]
25,"Show the name, kerberos credentials, and email for the employee with the name 'Michael'.","SELECT full_name, krb_name, email_address FROM employee_directory WHERE first_name = 'Michael';",[EMPLOYEE_DIRECTORY]
26,Show the school with the largest number of departments.,"SELECT * FROM (SELECT * FROM (SELECT DISTINCT school_name, COUNT(department_name) OVER (PARTITION BY school_name) AS cnt FROM student_department) ORDER BY cnt DESC) WHERE rownum <= 1;",[STUDENT_DEPARTMENT]
27,What are the courses with the maximum number of units?,"SELECT * FROM SUBJECT_SUMMARY, (SELECT MAX(total_units) AS maxi FROM SUBJECT_SUMMARY) WHERE total_units = maxi;",[SUBJECT_SUMMARY]
28,What is the TDL for Brazil?,SELECT * FROM top_level_domain WHERE top_level_domain_description = 'Brazil';,[TOP_LEVEL_DOMAIN]
29,What are all the different start dates of courses of computer science that lasted less than 100 days?,"SELECT DISTINCT * FROM (SELECT subject_title, department_name, term_start_date, term_end_date - term_start_date AS duration FROM SUBJECT_SUMMARY a, ACADEMIC_TERMS b WHERE a.term_code = b.term_code AND department_name = 'Electrical Eng & Computer Sci') WHERE duration <= 100;","[SUBJECT_SUMMARY, ACADEMIC_TERMS]"
30,List the courses and format for all courses that have a number of attendees greater than 800.,"SELECT DISTINCT subject_title, form_type, num_enrolled_students FROM subject_offered WHERE num_enrolled_students > 800;",[SUBJECT_OFFERED]
31,Which textbook-material is used the most often?,"SELECT * FROM (SELECT * FROM (SELECT c.title, c.isbn, COUNT(*) OVER (PARTITION BY c.title, c.isbn) AS cnt FROM tip_detail a, tip_subject_offered b, tip_material c WHERE is_no_course_material LIKE 'N' AND a.tip_subject_offered_key = b.tip_subject_offered_key AND a.tip_material_key = c.tip_material_key) ORDER BY cnt DESC) WHERE ROWNUM <= 1;","[TIP_DETAIL, TIP_SUBJECT_OFFERED, TIP_MATERIAL]"
32,"Show activity title, location, and supervisor for all independent activities ordered by start-date.","SELECT DISTINCT activity_title, session_location, term_start_date, person_name AS Leader FROM iap_subject_detail a, iap_subject_person b, academic_terms_all c, iap_subject_session d WHERE a.iap_subject_person_key = b.iap_subject_person_key AND a.iap_subject_session_key = d.iap_subject_session_key AND c.term_code = a.term_code AND b.person_role = 'Activity leader';","[IAP_SUBJECT_DETAIL, IAP_SUBJECT_PERSON, ACADEMIC_TERMS_ALL, IAP_SUBJECT_SESSION]"
33,"What are the titles and isbn numbers for all materials, sorted in ascending order of their price?","SELECT DISTINCT title, isbn, new_shelf_price FROM tip_material ORDER BY new_shelf_price ASC;",[TIP_MATERIAL]
34,Which were the first registered subjects?,"SELECT subject_title FROM COURSE_CATALOG_SUBJECT_OFFERED c, ACADEMIC_TERMS d, (SELECT MIN(academic_year) AS mini FROM COURSE_CATALOG_SUBJECT_OFFERED) WHERE c.effective_term_code = d.term_code AND d.academic_year = mini;","[COURSE_CATALOG_SUBJECT_OFFERED, ACADEMIC_TERMS]"
35,How many departments have less than 300 students?,"SELECT COUNT(*) FROM (SELECT DISTINCT department_name, COUNT(*) OVER (PARTITION BY department_name) AS cnt FROM mit_student_directory) WHERE cnt <= 300;",[MIT_STUDENT_DIRECTORY]
36,Which department has the most kinds of payroll ranks?,"SELECT * FROM (SELECT DISTINCT department_name, COUNT(DISTINCT payroll_rank) OVER (PARTITION BY department_name) AS cnt FROM wareuser.se_person a, employee_directory b WHERE a.mit_id = b.mit_id) a, (SELECT MAX(cnt) AS m FROM ((SELECT DISTINCT department_name, COUNT(DISTINCT payroll_rank) OVER (PARTITION BY department_name) AS cnt FROM wareuser.se_person a, employee_directory b WHERE a.mit_id = b.mit_id)) ) b WHERE a.cnt = b.m;","[SE_PERSON, EMPLOYEE_DIRECTORY]"
37,List email adress and names of student and employee whose first name is Carole.,"SELECT DISTINCT full_name, email_address FROM (SELECT DISTINCT first_name, full_name, email_address FROM mit_student_directory union SELECT DISTINCT first_name, full_name, email_address FROM employee_directory) WHERE first_name = 'Carole';","[MIT_STUDENT_DIRECTORY, EMPLOYEE_DIRECTORY]"
38,what are the different payment roll ranks?,SELECT DISTINCT payroll_rank FROM wareuser.se_person;,[SE_PERSON]
39,List buildings which were build before 1950 and have more than 100 employees.,"SELECT * FROM (SELECT DISTINCT BUILDING_NAME_LONG, year_built, COUNT(*) OVER (PARTITION BY BUILDING_NAME_LONG, year_built) as num_employees FROM ( SELECT * FROM (SELECT DISTINCT FCLT_BUILDING_KEY, BUILDING_NAME_LONG, extract(year FROM TO_DATE(date_built, 'MM/DD/YYYY')) as year_built FROM wareuser.fclt_building_hist) WHERE year_built <= 1950) a, fclt_rooms, employee_directory WHERE OFFICE_LOCATION = BUILDING_ROOM and fclt_rooms.FCLT_BUILDING_KEY = a.FCLT_BUILDING_KEY) WHERE num_employees >100;","[FCLT_BUILDING_HIST, FCLT_ROOMS, EMPLOYEE_DIRECTORY]"
40,How many courses are there in the centre for international studies?,SELECT COUNT(DISTINCT subject_id) FROM cis_course_catalog;,[CIS_COURSE_CATALOG]
41,What is the number of offered courses WHERE more than 100 students are enrolled?,SELECT COUNT(DISTINCT subject_id) FROM subject_offered WHERE num_enrolled_students > 100;,[SUBJECT_OFFERED]
42,Who is sharing his office with at least one other person?,"SELECT DISTINCT mit_id, full_name, a.office_location, num_employees FROM DRUPAL_EMPLOYEE_DIRECTORY a, (SELECT office_location, COUNT(mit_id) OVER(PARTITION BY office_location) as num_employees FROM (SELECT mit_id, office_location FROM DRUPAL_EMPLOYEE_DIRECTORY union SELECT full_name, office_location FROM mit_student_directory)) b WHERE b.num_employees>= 2 and b.office_location = a.office_location;","[DRUPAL_EMPLOYEE_DIRECTORY, MIT_STUDENT_DIRECTORY]"
43,List the subject-groups and their number of courses which start in March?,"SELECT DISTINCT CLUSTER_LIST, COUNT(subject_id) OVER (PARTITION BY CLUSTER_LIST) FROM SUBJECT_SUMMARY, academic_terms_all WHERE extract(month FROM term_start_date) = 3;","[SUBJECT_SUMMARY, ACADEMIC_TERMS_ALL]"
44,"List course instructors, their courses and the amount of material for them.","SELECT DISTINCT instructor_name, subject_title, COUNT(catalog_isbn) OVER (PARTITION BY instructor_name, subject_title) FROM LIBRARY_COURSE_INSTRUCTOR, LIBRARY_RESERVE_MATRL_DETAIL, LIBRARY_SUBJECT_OFFERED, LIBRARY_RESERVE_CATALOG WHERE LIBRARY_COURSE_INSTRUCTOR.LIBRARY_COURSE_INSTRUCTOR_KEY = LIBRARY_RESERVE_MATRL_DETAIL.LIBRARY_COURSE_INSTRUCTOR_KEY and LIBRARY_RESERVE_CATALOG.LIBRARY_RESERVE_CATALOG_KEY = LIBRARY_RESERVE_MATRL_DETAIL.LIBRARY_RESERVE_CATALOG_KEY and LIBRARY_SUBJECT_OFFERED.LIBRARY_SUBJECT_OFFERED_KEY = LIBRARY_RESERVE_MATRL_DETAIL.LIBRARY_SUBJECT_OFFERED_KEY;","[LIBRARY_COURSE_INSTRUCTOR, LIBRARY_RESERVE_MATRL_DETAIL, LIBRARY_SUBJECT_OFFERED, LIBRARY_RESERVE_CATALOG]"
45,Which building accomodates the most students?,"SELECT * FROM( SELECT * FROM( SELECT DISTINCT building_name, num_students FROM (SELECT fclt_building_key, COUNT(full_name) OVER (PARTITION BY fclt_building_key) as num_students FROM fclt_rooms, mit_student_directory WHERE office_location=BUILDING_ROOM) a, fclt_building WHERE a.fclt_building_key = fclt_building.fclt_building_key) ORDER BY num_students DESC)WHERE ROWNUM <= 1;","[FCLT_ROOMS, MIT_STUDENT_DIRECTORY, FCLT_BUILDING]"
46,Which building has on average the most rooms per floor?,"SELECT * FROM(SELECT DISTINCT building_name, num_rooms/num_floors FROM( SELECT fclt_building_key, COUNT(DISTINCT fclt_floor_key) OVER (PARTITION BY fclt_building_key) as num_floors, COUNT(DISTINCT fclt_room_key) OVER (PARTITION BY fclt_building_key) as num_rooms FROM fclt_rooms) a, fclt_building WHERE a.fclt_building_key = fclt_building.fclt_building_key ORDER BY num_rooms/num_floors DESC) WHERE ROWNUM <= 1;","[FCLT_ROOMS, FCLT_BUILDING]"
47,What is the most common usage for all rooms.,"SELECT * FROM(SELECT DISTINCT major_use, num_rooms FROM (SELECT fclt_major_use_key, COUNT(fclt_room_key) OVER (PARTITION BY fclt_major_use_key) as num_rooms FROM fclt_rooms) a, fclt_major_use WHERE a.fclt_major_use_key = fclt_major_use.fclt_major_use_key ORDER BY num_rooms DESC) WHERE rownum <= 1;","[FCLT_ROOMS, FCLT_MAJOR_USE]"
48,Which IAP instructor has held the most sessions of the same course?,"SELECT * FROM (SELECT DISTINCT person_name, activity_title, COUNT(IAP_subject_session_key) OVER (PARTITION BY person_name,activity_title) as num_session FROM iap_subject_detail, iap_subject_person WHERE IAP_SUBJECT_PERSON.IAP_SUBJECT_PERSON_KEY = IAP_SUBJECT_DETAIL.IAP_SUBJECT_PERSON_KEY) ORDER BY num_session DESC;","[IAP_SUBJECT_DETAIL, IAP_SUBJECT_PERSON]"
49,What is the largest building?,"SELECT * FROM(SELECT DISTINCT building_key, sum(room_square_footage) OVER (PARTITION BY building_key) as total_square_footage FROM space_detail) ORDER BY total_square_footage DESC;",[SPACE_DETAIL]

In [ ]:
#df_q = pd.concat([df_q, new_df], ignore_index=True)
df_q[['question', 'sql', 'tables', 'gpt_sql_nocontext','gpt_sql_global_schema','gpt_sql_log']]
#df_q

## Go thrugh the `unique_tables` list and save the respective schemas as proper CSV files

In [48]:
for t in unique_tables: 
    if t.upper().startswith('WAREUSER.'):
        t = t[len('WAREUSER.'):]
    schema_file = str(prefix) + '/data/views/schema/' + t + '.csv'
    if os.path.isfile(schema_file): 
        s = pd.read_csv(schema_file, header=None)
        s = s.drop(1) # delete the "header" line 
        column_names = [h.strip() for h in s[0][0].split(';')]
        s_new = pd.DataFrame(list(s[0][1:].apply(lambda row: [c.strip() for c in row.split(';')])), columns=column_names)
        new_schema_file = str(prefix) + '/data/views/schema_new/' + t + '.csv'
        s_new.to_csv(new_schema_file, index=False)

## Map tables to queries

In [49]:
queries = []
for t in sorted(list(unique_tables)):
    print(t)
    q = set()
    for i, T in enumerate(df_q['tables']): 
        if t in T: 
            q.add(i) 
    queries.append(list(q))

ACADEMIC_TERMS
ACADEMIC_TERMS_ALL
CIS_COURSE_CATALOG
COURSE_CATALOG_SUBJECT_OFFERED
DRUPAL_EMPLOYEE_DIRECTORY
EMPLOYEE_DIRECTORY
FAC_BUILDING
FAC_BUILDING_ADDRESS
FAC_ROOMS
FCLT_BUILDING
FCLT_BUILDING_ADDRESS_HIST
FCLT_BUILDING_HIST
FCLT_MAJOR_USE
FCLT_ROOMS
HR_ORG_UNIT
HR_ORG_UNIT_NEW
IAP_SUBJECT_CATEGORY
IAP_SUBJECT_DETAIL
IAP_SUBJECT_PERSON
IAP_SUBJECT_SESSION
LIBRARY_COURSE_INSTRUCTOR
LIBRARY_MATERIAL_STATUS
LIBRARY_RESERVE_CATALOG
LIBRARY_RESERVE_MATRL_DETAIL
LIBRARY_SUBJECT_OFFERED
MIT_STUDENT_DIRECTORY
SE_PERSON
SPACE_DETAIL
STUDENT_DEPARTMENT
SUBJECT_ENROLLABLE
SUBJECT_OFFERED
SUBJECT_SUMMARY
TIP_DETAIL
TIP_MATERIAL
TIP_MATERIAL_STATUS
TIP_SUBJECT_OFFERED
TOP_LEVEL_DOMAIN
ZIP_CANADA
ZIP_USA

In [50]:
queries

[[32, 34, 3, 7, 43, 15, 29],
 [32, 43, 15],
 [40],
 [34, 15],
 [42],
 [36, 37, 6, 39, 42, 17, 18, 23, 25],
 [8, 17, 14],
 [8, 17],
 [17],
 [4, 39, 45, 13, 46],
 [4],
 [39],
 [47],
 [39, 45, 13, 47, 46],
 [0, 1],
 [0, 1],
 [21],
 [32, 48],
 [32, 48],
 [32],
 [44],
 [10],
 [44],
 [44],
 [44],
 [35, 5, 6, 37, 9, 42, 45, 20],
 [36, 38],
 [49, 14],
 [24, 26],
 [2],
 [34, 41, 44, 15, 30, 31],
 [3, 5, 7, 43, 12, 16, 19, 27, 29],
 [31],
 [33, 10, 31],
 [10],
 [31],
 [28],
 [11, 22],
 [11, 22]]

In [51]:
df_t = pd.DataFrame(columns=['table', 'log'])
df_t['table'] = sorted(list(unique_tables))
df_t['log'] = queries
df_t

                             table                                  log
0                   ACADEMIC_TERMS           [32, 34, 3, 7, 43, 15, 29]
1               ACADEMIC_TERMS_ALL                         [32, 43, 15]
2               CIS_COURSE_CATALOG                                 [40]
3   COURSE_CATALOG_SUBJECT_OFFERED                             [34, 15]
4        DRUPAL_EMPLOYEE_DIRECTORY                                 [42]
5               EMPLOYEE_DIRECTORY  [36, 37, 6, 39, 42, 17, 18, 23, 25]
6                     FAC_BUILDING                          [8, 17, 14]
7             FAC_BUILDING_ADDRESS                              [8, 17]
8                        FAC_ROOMS                                 [17]
9                    FCLT_BUILDING                  [4, 39, 45, 13, 46]
10      FCLT_BUILDING_ADDRESS_HIST                                  [4]
11              FCLT_BUILDING_HIST                                 [39]
12                  FCLT_MAJOR_USE                                 [47]
13                      FCLT_ROOMS                 [39, 45, 13, 47, 46]
14                     HR_ORG_UNIT                               [0, 1]
15                 HR_ORG_UNIT_NEW                               [0, 1]
16            IAP_SUBJECT_CATEGORY                                 [21]
17              IAP_SUBJECT_DETAIL                             [32, 48]
18              IAP_SUBJECT_PERSON                             [32, 48]
19             IAP_SUBJECT_SESSION                                 [32]
20       LIBRARY_COURSE_INSTRUCTOR                                 [44]
21         LIBRARY_MATERIAL_STATUS                                 [10]
22         LIBRARY_RESERVE_CATALOG                                 [44]
23    LIBRARY_RESERVE_MATRL_DETAIL                                 [44]
24         LIBRARY_SUBJECT_OFFERED                                 [44]
25           MIT_STUDENT_DIRECTORY        [35, 5, 6, 37, 9, 42, 45, 20]
26                       SE_PERSON                             [36, 38]
27                    SPACE_DETAIL                             [49, 14]
28              STUDENT_DEPARTMENT                             [24, 26]
29              SUBJECT_ENROLLABLE                                  [2]
30                 SUBJECT_OFFERED             [34, 41, 44, 15, 30, 31]
31                 SUBJECT_SUMMARY    [3, 5, 7, 43, 12, 16, 19, 27, 29]
32                      TIP_DETAIL                                 [31]
33                    TIP_MATERIAL                         [33, 10, 31]
34             TIP_MATERIAL_STATUS                                 [10]
35             TIP_SUBJECT_OFFERED                                 [31]
36                TOP_LEVEL_DOMAIN                                 [28]
37                      ZIP_CANADA                             [11, 22]
38                         ZIP_USA                             [11, 22]

# Treat ChatGPT as an all-knowing oracle (without any additional information)
## Prompt
_Your job is to write SQL queries that answer a user's question using the tables in the MIT Data Warehouse. 
The MIT Data Warehouse is a central data source that combines data from various administrative systems at 
MIT, containing information about students, faculty, and personnel. You can find more about the MIT data 
warehouse tables at https://web.mit.edu/warehouse/metadata/tables/all_tables.html._

_How many organisation units in human resources are relabeled?_

In [67]:
api_key = config['api-key']
client = OpenAI(api_key=api_key)

## Populate the prompt and call the Open AI API

In [75]:
headers = {
    'Content-Type': 'application/json',
    'Authorization': f'Bearer {api_key}'
}

response = requests.get('https://api.openai.com/v1/engines', headers=headers)

if response.status_code == 200:
    engines = response.json()['data']
    print("Available engines:")
    for engine in engines:
        print(engine['id'])
else:
    print("Error:", response.text)

Available engines:
dall-e-3
whisper-1
davinci-002
gpt-3.5-turbo-1106
dall-e-2
gpt-3.5-turbo-16k
tts-1-hd-1106
tts-1-hd
gpt-4
gpt-4-turbo-2024-04-09
gpt-4-0613
gpt-4-1106-preview
gpt-4-vision-preview
gpt-3.5-turbo
gpt-3.5-turbo-instruct-0914
gpt-3.5-turbo-0613
gpt-3.5-turbo-instruct
gpt-4-1106-vision-preview
gpt-3.5-turbo-0125
tts-1
gpt-3.5-turbo-0301
babbage-002
tts-1-1106
gpt-4-0125-preview
text-embedding-3-large
gpt-4-turbo-preview
gpt-3.5-turbo-16k-0613
text-embedding-3-small
text-embedding-ada-002
gpt-4-turbo

In [ ]:
# TODO: do this in batch 
gpt_sql_nocontext = []
for q in df_q['question']: 
    response = client.chat.completions.create(
        model="gpt-4",
        temperature=0,
        messages = [
          {
          "role": "system",
          "content": "You are a OracleSQL expert. Given an input question, create a syntactically correct OracleSQL query to run and return ONLY the generated Query and nothing else.\
            Pay close attention on which column is in which table. if context contains more than one tables then create a query by performing JOIN operation only using the column unitid for the tables.\
Follow these Instructions for creating syntactically correct SQL query:\
- Be sure not to query for columns that do not exist in the tables and use alias only where required.\
- Likewise, when asked about the average (AVG function) or ratio, ensure the appropriate aggregation function is used.\
- Pay close attention to the filtering criteria mentioned in the question and incorporate them using the WHERE clause in your SQL query.\
- If the question involves multiple conditions, use logical operators such as AND, OR to combine them effectively.\
- When dealing with date or timestamp columns, use appropriate date functions (e.g., DATE_PART, EXTRACT) for extracting specific parts of the date or performing date arithmetic.\
- If the question involves grouping of data (e.g., finding totals or averages for different categories), use the GROUP BY clause along with appropriate aggregate functions.\
- Consider using aliases for tables and columns to improve readability of the query, especially in case of complex joins or subqueries.\
- If necessary, use subqueries or common table expressions (CTEs) to break down the problem into smaller, more manageable parts.\
Your job is to write SQL queries that answer a user's question using the tables in the MIT Data Warehouse. \
          The MIT Data Warehouse is a central data source that combines data from various administrative systems at MIT, containing \
          information about students, faculty, buildings, and organisation. You can find more about the MIT data warehouse tables at \
          https://web.mit.edu/warehouse/metadata/tables/all_tables.html. \
          Reply with only the answer in SQL and include no linebreaks, newlines, escape characters or other commentary"
          # Provide your answer in JSON form."
          # Reply with only the answer in JSON form and include no other commentary"
          },
            {"role":"user", 
             "content":q}]
    )
    gpt_sql_nocontext.append(response.choices[0].message.content)

In [ ]:
gpt_sql_nocontext

In [ ]:
len(gpt_sql_nocontext)

In [ ]:
df_q['gpt_sql_nocontext']=gpt_sql_nocontext

# Give ChatGPT the "database" schema as context and elicit its answer

In [ ]:
def table_to_sql_create(t): 
    schema_file=str(prefix) + '/data/views/schema_new/' + t + '.csv'
    p = None
    if os.path.isfile(schema_file):
        df_t = pd.read_csv(schema_file)
        p = "CREATE TABLE "+ t+ "(\n"  
        p = p + '\n'.join(list(df_t[['COLUMN_NAME', 'DATA_TYPE']].apply(lambda row: ' '.join(row.astype(str)), axis=1)))
        p = p + ')\n'
    return p

In [ ]:
prompt = "** all the tables in the database ** \n\n"
cnt = 0 
for t in unique_tables:
    if t.upper().startswith('WAREUSER.'):
        t = t[len('WAREUSER.'):]
    p = table_to_sql_create(t)
    if not p: 
        print(t)
    if p: 
        cnt = cnt + 1
        prompt = prompt + p
        prompt = prompt + "\n\n"

In [ ]:
print(len(prompt))
additional_space = 3000-len(prompt)

## Prompt
_Your job is to write SQL queries that answer a user's question using the tables in the MIT Data Warehouse. 
The MIT Data Warehouse is a central data source that combines data from various administrative systems at MIT, containing 
information about students, faculty, and personnel. The schemas of all the tables that you might need 
for answering the user questions are below. There are 50 tables in the database.  Reply with as many answers 
as you can think of in SQL and include no linebreaks, newlines, escape characters or other commentary for the each possible 
answer, but seperate the possibilities by semicolons. + "alltable_schemas"_

In [ ]:
gpt_sql_global_schema = []
for q in df_q['question']: 
    response = client.chat.completions.create(
        model="gpt-4",
        temperature = 0,
        messages = [
          {
          "role": "system",
          "content": "Your job is to write SQL queries that answer a user's question using the tables in the MIT Data Warehouse. \
          The MIT Data Warehouse is a central data source that combines data from various administrative systems at MIT, containing \
          information about students, faculty, and personnel. The schemas of all the tables that you might need \
          for answering the user questions are below. There are 39 tables in the database. Reply with only the \
          answer in SQL and include no linebreaks, newlines, escape characters or other commentary. \n\n" + prompt 
          # Provide your answer in JSON form."
          # Reply with only the answer in JSON form and include no other commentary"
        },
          {"role":"user", 
           "content":q}]
          )
    gpt_sql_global_schema.append(response.choices[0].message.content)
    print(response.choices[0].message.content)

In [ ]:
df_q['gpt_sql_global_schema']

In [ ]:
df_q['gpt_sql_global_schema'] = gpt_sql_global_schema

# Give ChatGPT the "database" schema and prev queries as context and elicit its answer
### Prompt
_Your job is to write SQL queries that answer a user's question using the tables in the MIT Data Warehouse. 
The MIT Data Warehouse is a central data source that combines data from various administrative systems at MIT, containing 
information about students, faculty, and personnel. The schemas of the all the tables that you might need 
for answering the user questions are given below. There are 47 tables in the database. 
For each table, the schema of the table and the previous queries that referred to the table are also given. \
Reply with as many answers as you can think of in SQL and include no linebreaks, newlines, escape characters or other 
commentary for the each possible  answer, but seperate the possibilities by semicolons_

In [54]:
def min_arg(l):
    min_a = list(l)[0]
    for i in l:
        if len(df_q['sql'][i]) < len(df_q['sql'][min_a]):
            min_a = i
    return min_a

In [17]:
def table_to_sql_create_with_logs(t, l, used_querries, cnter, maxqueriespertable, allowduplicates): 
    schema_file= str(prefix) + '/data/views/schema_new/' + t + '.csv'
    p = None
    if os.path.isfile(schema_file):
        df_t_ = pd.read_csv(schema_file)
        p = "CREATE TABLE " + t + "(\n" 
        p = p + ',\n'.join(list(df_t_[['COLUMN_NAME', 'DATA_TYPE']].apply(lambda row: ' '.join(row.astype(str)), axis=1)))
        p = p + ')\n'
        if l and cnter > 0:
            shortest_query_index = min_arg(l)
            sorted_indexes = sorted(l, key=lambda i: len(df_q['sql'][i]))
            if not all(df_q['sql'][item] in used_querries for item in sorted_indexes) or allowduplicates:
                p = p + "\n ** PREVIOUS SQL QUERIES THAT REFERRED TO THE TABLE {0} **\n".format(t)
                for i in range(len(sorted_indexes)):
                    shortest_query = df_q['sql'][sorted_indexes[i]]
                    if (shortest_query not in used_querries or allowduplicates) and maxqueriespertable>0:
                        p = p + "SQL: {0} \n".format(shortest_query)
                        used_querries.append(shortest_query)
                        cnter -= 1
                        maxqueriespertable-=1
    return p, cnter

In [298]:
def create_prompt(curr_query_index): 
    prompt = "*** ALL THE TABLES IN THE DATABASE and QUERY LOGS *** \n"
    cnt = 50 # number of querries
    used_querries=[]
    for i, t in enumerate(unique_tables):
        l = set(df_t['log'][i]).difference([curr_query_index])
        p,cnt = table_to_sql_create_with_logs(t, l, used_querries, cnt, 50, False)
        if not p:
            print(t)
        else: 
            prompt = prompt + p
            prompt = prompt + "\n"
    return prompt

In [299]:
 print(len(create_prompt(0)))

33369

In [300]:
gpt_sql_log = []
for i, q in enumerate(df_q['question']): 
    prompt = create_prompt(i)
    print(len(prompt))
    response = client.chat.completions.create(
      model="gpt-3.5-turbo",
      temperature = 0,
      messages = [
          {
          "role": "system",
          "content": "Your job is to write SQL queries that answer a user's question using the tables in the MIT Data Warehouse. \
          The MIT Data Warehouse is a central data source that combines data from various administrative systems at MIT, containing \
          information about students, faculty, and personnel. The schemas of the all the tables that you might need \
          for answering the user questions are given below. There are 39 tables in the database. \
          For each table, the schema of the table and the previous queries that referred to the table are also given. \
          \
          Reply with only the answer in SQL and include no linebreaks, newlines, escape characters or other commentary \n\n" + prompt 
          # prompt 
          # Provide your answer in JSON form."
          # Reply with only the answer in JSON form and include no other commentary"
        },
          {"role":"user", 
           "content":q}]
          )
    print(response.choices[0].message.content)
    gpt_sql_log.append(response.choices[0].message.content)

33369
SELECT COUNT(*) FROM HR_ORG_UNIT WHERE HR_DEPARTMENT_CODE_OLD IS NOT NULL;
33373
SELECT COUNT(*) FROM HR_ORG_UNIT_NEW WHERE HR_ORG_UNIT_LEVEL = 'New' AND HR_DEPARTMENT_CODE_OLD IS NULL;
33313
SELECT department_name, COUNT(*) FROM COURSE_CATALOG_SUBJECT_OFFERED GROUP BY department_name;
33175
SELECT DISTINCT SUBJECT_TITLE FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE TERM_CODE < (SELECT MIN(TERM_CODE) FROM ACADEMIC_TERMS_ALL) OR TERM_CODE > (SELECT MAX(TERM_CODE) FROM ACADEMIC_TERMS_ALL) OR TERM_CODE = (SELECT MAX(TERM_CODE) FROM ACADEMIC_TERMS_ALL);
33289
SELECT department_name, COUNT(DISTINCT office_location) AS num_location_changes FROM employee_directory GROUP BY department_name ORDER BY num_location_changes DESC FETCH FIRST ROW ONLY;
33342
SELECT AVG(SUBJECT_ENROLLMENT_NUMBER) FROM SUBJECT_SUMMARY;
33362
SELECT DISTINCT full_name FROM mit_student_directory WHERE mit_id IN (SELECT mit_id FROM employee_directory);
33193
SELECT MIN(TOTAL_UNITS) FROM SUBJECT_SUMMARY;
33261
SELECT BUILDING_NAME, STREET_NUMBER, STREET_NAME, CITY, STATE, POSTAL_CODE
FROM FAC_BUILDING_ADDRESS
JOIN FAC_BUILDING
ON FAC_BUILDING_ADDRESS.BUILDING_KEY = FAC_BUILDING.FAC_BUILDING_KEY;
33443
SELECT COUNT(*) FROM MIT_STUDENT_DIRECTORY;
33270
SELECT DISTINCT TIP_MATERIAL_STATUS FROM TIP_MATERIAL_STATUS;
33399
SELECT DISTINCT city_name FROM zip_usa; SELECT DISTINCT city_name FROM zip_canada;
33295
SELECT AVG(cnt) FROM (SELECT COUNT(*) AS cnt FROM SUBJECT_SUMMARY GROUP BY DEPARTMENT_NAME HAVING COUNT(*) > 100);
33302
SELECT COUNT(*) FROM FCLT_ROOMS WHERE BUILDING_KEY = 'building_key';
33266
SELECT BUILDING_KEY, COUNT(DISTINCT SPACE_UNIT_KEY) FROM SPACE_DETAIL GROUP BY BUILDING_KEY;
33087
SELECT DISTINCT term_start_date FROM SUBJECT_SUMMARY WHERE SUBJECT_DESCRIPTION IN ('Regular', 'Initial');
33314
SELECT department_name, COUNT(*) AS course_count FROM subject_offered GROUP BY department_name ORDER BY course_count DESC FETCH FIRST 3 ROWS ONLY;
33215
SELECT office_location FROM employee_directory WHERE full_name = 'Michael Stonebraker';
33230
SELECT DISTINCT full_name, email_address FROM (SELECT DISTINCT first_name, full_name, email_address FROM mit_student_directory union SELECT DISTINCT first_name, full_name, email_address FROM employee_directory) WHERE first_name = 'Carole'
33378
SELECT DISTINCT SUBJECT_TITLE FROM SUBJECT_ENROLLABLE WHERE OFFER_DEPT_CODE = '6';
33390
SELECT department_name, COUNT(*) AS num_students FROM mit_student_directory GROUP BY department_name;
33349
SELECT DISTINCT IAP_CATEGORY_NAME FROM IAP_SUBJECT_CATEGORY;
33342
SELECT city_name FROM zip_usa WHERE zip_code = '501';
33432
SELECT COUNT(*) FROM employee_directory;
33378
SELECT school_name, COUNT(department_name) AS num_departments FROM student_department GROUP BY school_name;
33391
SELECT full_name, krb_name, email_address FROM employee_directory WHERE full_name = 'Michael';
33303
SELECT school_name, COUNT(department_name) AS num_departments FROM student_department GROUP BY school_name ORDER BY num_departments DESC FETCH FIRST 1 ROWS ONLY;
33375
SELECT SUBJECT_TITLE FROM SUBJECT_SUMMARY WHERE TOTAL_UNITS = (SELECT MAX(TOTAL_UNITS) FROM SUBJECT_SUMMARY)
33336
SELECT TOP_LEVEL_DOMAIN_DESCRIPTION FROM TOP_LEVEL_DOMAIN WHERE TOP_LEVEL_DOMAIN = 'BR';
33212
SELECT DISTINCT term_start_date FROM SUBJECT_SUMMARY WHERE department_name = 'Electrical Eng & Computer Sci' AND term_end_date - term_start_date < 100;
33367
SELECT DISTINCT SUBJECT_TITLE, MEET_TIME, MEET_PLACE FROM SUBJECT_OFFERED WHERE NUM_ENROLLED_STUDENTS > 800;
33146
SELECT DISTINCT title, isbn FROM tip_material ORDER BY new_shelf_price ASC;
33120
SELECT ACTIVITY_TITLE, SESSION_LOCATION, SUPERVISOR_ATTRIBUTE
FROM IAP_SUBJECT_DETAIL
WHERE ENROLLMENT_TYPE = 'Independent'
ORDER BY SESSION_DATE;
33394
SELECT title, isbn FROM TIP_MATERIAL ORDER BY NEW_SHELF_PRICE ASC;
33267
SELECT DISTINCT SUBJECT_TITLE FROM SUBJECT_SUMMARY WHERE ROWNUM = 1;
33334
SELECT COUNT(DISTINCT department_name) FROM student_department WHERE department_code IN (SELECT department_code FROM mit_student_directory GROUP BY department_code HAVING COUNT(*) < 300);
33056
SELECT department_name, COUNT(DISTINCT payroll_rank) AS num_payroll_ranks FROM se_person GROUP BY department_name ORDER BY num_payroll_ranks DESC FETCH FIRST ROW ONLY;
33247
SELECT email_address, full_name
FROM mit_student_directory
WHERE first_name = 'Carole'
UNION
SELECT email_address, full_name
FROM employee_directory
WHERE first_name = 'Carole'
33367
SELECT DISTINCT PAYROLL_RANK FROM SE_PERSON;
32989
SELECT DISTINCT building_name FROM fac_building WHERE DATE_BUILT < '1950' AND NUM_OF_ROOMS > 100;
33353
SELECT COUNT(*) FROM SUBJECT_SUMMARY WHERE DEPARTMENT_NAME = 'Centre for International Studies';
33397
SELECT COUNT(*) FROM SUBJECT_OFFERED WHERE NUM_ENROLLED_STUDENTS > 100;
33004
SELECT DISTINCT full_name FROM employee_directory WHERE full_name IN (SELECT full_name FROM employee_directory GROUP BY full_name HAVING COUNT(*) > 1);
33318
SELECT SUBJECT_GROUP_ID, COUNT(*) AS num_courses FROM SUBJECT_ENROLLABLE WHERE SUBJECT_TITLE LIKE '%March%' GROUP BY SUBJECT_GROUP_ID;
32820
SELECT INSTRUCTOR_NAME, COURSE_NAME, COUNT(LIBRARY_MATERIAL_STATUS_KEY) AS MATERIAL_AMOUNT FROM LIBRARY_COURSE_INSTRUCTOR GROUP BY INSTRUCTOR_NAME, COURSE_NAME;
33110
SELECT BUILDING_NAME_LONG FROM (SELECT BUILDING_NAME_LONG, SUM(NUM_ENROLLED_STUDENTS) OVER (PARTITION BY BUILDING_NAME_LONG) AS TOTAL_STUDENTS FROM SUBJECT_OFFERED) WHERE TOTAL_STUDENTS = (SELECT MAX(SUM(NUM_ENROLLED_STUDENTS)) OVER () FROM SUBJECT_OFFERED);
33074
SELECT building_name FROM (SELECT DISTINCT building_name, num_rooms, num_floors, num_rooms/num_floors AS avg_rooms_per_floor FROM (SELECT fclt_building_key, COUNT(fclt_room_key) AS num_rooms FROM fclt_rooms GROUP BY fclt_building_key) a, (SELECT fclt_building_key, COUNT(DISTINCT floor) AS num_floors FROM fclt_rooms GROUP BY fclt_building_key) b WHERE a.fclt_building_key = b.fclt_building_key) WHERE avg_rooms_per_floor = (SELECT MAX(num_rooms/num_floors) FROM (SELECT fclt_building_key, COUNT(fclt_room_key) AS num_rooms FROM fclt_rooms GROUP BY fclt_building_key) a, (SELECT fclt_building_key, COUNT(DISTINCT floor) AS num_floors FROM fclt_rooms GROUP BY fclt_building_key) b WHERE a.fclt_building_key = b.fclt_building_key);
33188
SELECT MAJOR_USE_DESC, COUNT(*) AS num_rooms FROM FCLT_ROOMS GROUP BY MAJOR_USE_DESC ORDER BY num_rooms DESC FETCH FIRST ROW ONLY;
33170
SELECT DISTINCT instructor_name, course_name, COUNT(*) OVER (PARTITION BY instructor_name, course_name) AS session_count FROM LIBRARY_COURSE_INSTRUCTOR ORDER BY session_count DESC;
33306
SELECT BUILDING_NAME_LONG FROM FCLT_BUILDING WHERE EXT_GROSS_AREA = (SELECT MAX(EXT_GROSS_AREA) FROM FCLT_BUILDING)

In [301]:
df_q['gpt_sql_log_50_all'] = gpt_sql_log

In [191]:
df_q.keys()

Index(['question', 'sql', 'tables', 'gpt_sql_log_50_all', 'gpt_sql_log_50_1',
       'gpt_sql_log_25_1', 'gpt_sql_log_10_1', 'gpt_sql',
       'gpt_sql_logs_50_all'],
      dtype='object')

# Give ChatGPT the "database" schema and prev queries as context as well as their corresponding questions

In [55]:
def table_to_sql_create_with_logs_question_pairs(t, l, used_querries, cnter, maxqueriespertable, allowduplicates): 
    schema_file= str(prefix) + '/data/views/schema_new/' + t + '.csv'
    p = None
    if os.path.isfile(schema_file):
        df_t_ = pd.read_csv(schema_file)
        p = "CREATE TABLE " + t + "(\n" 
        p = p + ',\n'.join(list(df_t_[['COLUMN_NAME', 'DATA_TYPE']].apply(lambda row: ' '.join(row.astype(str)), axis=1)))
        p = p + ')\n'
        if l and cnter > 0:
            sorted_indexes = sorted(l, key=lambda i: len(df_q['sql'][i]))
            if not all(df_q['sql'][item] in used_querries for item in sorted_indexes) or allowduplicates:
                p = p + "\n ** PREVIOUS QUESTIONS AND CORRESPONDING SQL QUERIES THAT REFERRED TO THE TABLE {0} **\n".format(t)
                for i in range(len(sorted_indexes)):
                    shortest_query = df_q['sql'][sorted_indexes[i]]
                    if (shortest_query not in used_querries or allowduplicates) and maxqueriespertable>0:
                        p = p + "Question: {0} \n".format(df_q['question'][sorted_indexes[i]])
                        p = p + "SQL: {0} \n".format(shortest_query)
                        used_querries.append(shortest_query)
                        cnter -= 1
                        maxqueriespertable-=1
    return p, cnter

In [56]:
def create_prompt_for_q_a_pairs(curr_query_index, num_of_queries): 
    prompt = "*** ALL THE TABLES IN THE DATABASE and QUERY LOGS *** \n"
    cnt = num_of_queries # number of querries
    used_querries=[]
    for i, t in enumerate(unique_tables):
        l = set(df_t['log'][i]).difference([curr_query_index])
        p,cnt = table_to_sql_create_with_logs_question_pairs(t, l, used_querries, cnt, 50, True)
        if not p:
            print(t)
        else: 
            prompt = prompt + p
            prompt = prompt + "\n"
    return prompt

In [ ]:
def create_prompt_for_q_a_pairs(curr_query_index, num_of_queries): 
    prompt = "*** ALL THE TABLES IN THE DATABASE and QUERY LOGS *** \n"
    cnt = num_of_queries # number of querries
    used_querries=[]
    for i, t in enumerate(unique_tables):
        l = set(df_t['log'][i]).difference([curr_query_index])
        p,cnt = table_to_sql_create_with_logs_question_pairs(t, l, used_querries, cnt, 50, True)
        if not p:
            print(t)
        else: 
            prompt = prompt + p
            prompt = prompt + "\n"
    return prompt

In [65]:
print(len(create_prompt_for_q_a_pairs(0, 100)))

57335

In [68]:
for h in range(100,110,10):
    for j in range(3):
        gpt_sql_log = []
        for i, q in enumerate(df_q['question']): 
            prompt = create_prompt_for_q_a_pairs(i, h)
            print(len(prompt))
            response = client.chat.completions.create(
            model="gpt-3.5-turbo",
              temperature = 0,
              top_p=1.0,
              seed=42,
              messages = [
                {
                "role": "system",
                "content": "Your job is to write SQL queries that answer a user's question using the tables in the MIT Data Warehouse. \
                The MIT Data Warehouse is a central data source that combines data from various administrative systems at MIT, containing \
                information about students, faculty, and personnel. The schemas of the all the tables that you might need \
                for answering the user questions are given below. There are 39 tables in the database. \
                For each table, the schema of the table and the previous queries that referred to the table are also given. \
                \
                Reply with only the answer in SQL and include no linebreaks, newlines, escape characters or other commentary \n\n" + prompt 
              # prompt 
              # Provide your answer in JSON form."
              # Reply with only the answer in JSON form and include no other commentary"
                },
                {"role":"user", 
               "content":q}]
                )
            print(response.choices[0].message.content)
            gpt_sql_log.append(response.choices[0].message.content)
        df_q["gpt_sql_q_a_log_{0}_all.{1}".format(str(h), str(j))] = gpt_sql_log

57335
SELECT COUNT(*) FROM (SELECT hr_org_unit_key FROM hr_org_unit MINUS SELECT hr_org_unit_key FROM hr_org_unit_new);
57319
SELECT COUNT(*) FROM (SELECT hr_org_unit_key FROM hr_org_unit_new EXCEPT SELECT hr_org_unit_key FROM hr_org_unit);
57454
SELECT DEPARTMENT_NAME, COUNT(*) FROM SUBJECT_SUMMARY GROUP BY DEPARTMENT_NAME;
56971
SELECT DISTINCT subject_title FROM SUBJECT_SUMMARY WHERE term_start_date < SYSDATE OR term_start_date > SYSDATE OR term_start_date = SYSDATE;
57256
SELECT * FROM (SELECT FULL_NAME, COUNT(DISTINCT OFFICE_LOCATION) AS num_locations FROM EMPLOYEE_DIRECTORY GROUP BY FULL_NAME ORDER BY num_locations DESC) WHERE ROWNUM = 1;
57279
SELECT AVG(SUBJECT_ENROLLMENT_NUMBER) FROM SUBJECT_SUMMARY;
57373
SELECT DISTINCT full_name
FROM mit_student_directory
WHERE full_name IN (SELECT full_name
                    FROM employee_directory);
57001
SELECT SUBJECT_TITLE FROM SUBJECT_SUMMARY WHERE TOTAL_UNITS = (SELECT MIN(TOTAL_UNITS) FROM SUBJECT_SUMMARY);
57329
SELECT BUILDING_NAME_LONG, STREET_NUMBER, STREET_NAME, CITY, STATE, POSTAL_CODE FROM FAC_BUILDING_ADDRESS;
57638
SELECT COUNT(DISTINCT MIT_ID) FROM MIT_STUDENT_DIRECTORY;
56956
SELECT DISTINCT TIP_MATERIAL_STATUS FROM TIP_MATERIAL_STATUS;
57421
SELECT DISTINCT city_name FROM ((SELECT city_name FROM zip_usa) UNION (SELECT city_name FROM zip_canada));
57439
SELECT AVG(course_COUNT) FROM (SELECT COUNT(*) AS course_COUNT FROM SUBJECT_ENROLLABLE GROUP BY OFFER_DEPT_CODE HAVING COUNT(*) > 100);
57243
SELECT COUNT(*) FROM FAC_ROOMS WHERE BUILDING_KEY = 'building_key';
57161
SELECT BUILDING_KEY, COUNT(DISTINCT SPACE_UNIT_KEY) FROM SPACE_DETAIL;
56061
SELECT term_start_date FROM SUBJECT_SUMMARY WHERE SUBJECT_TITLE IN (SELECT SUBJECT_TITLE FROM SUBJECT_SUMMARY WHERE SUBJECT_DESCRIPTION IN ('Regular', 'Initial'));
57456
SELECT OFFER_DEPT_NAME, COUNT(*) AS course_count FROM SUBJECT_OFFERED GROUP BY OFFER_DEPT_NAME ORDER BY course_count DESC FETCH FIRST 3 ROWS ONLY;
56299
SELECT office_location FROM employee_directory WHERE full_name = 'Michael Stonebraker'
57415
SELECT DISTINCT a.full_name
FROM employee_directory a, employee_directory b
WHERE a.full_name = b.full_name AND a.mit_id <> b.mit_id;
57524
SELECT DISTINCT SUBJECT_TITLE FROM SUBJECT_ENROLLABLE WHERE OFFER_DEPT_CODE = '6';
57570
SELECT DEPARTMENT_NAME, COUNT(*) FROM MIT_STUDENT_DIRECTORY GROUP BY DEPARTMENT_NAME;
57484
SELECT DISTINCT IAP_CATEGORY_NAME FROM IAP_SUBJECT_CATEGORY;
57329
SELECT city_name FROM zip_usa WHERE ZIP_CODE = '501';
57616
SELECT COUNT(*) FROM employee_directory;
57559
SELECT SCHOOL_NAME, COUNT(DISTINCT DEPARTMENT_NAME) FROM STUDENT_DEPARTMENT GROUP BY SCHOOL_NAME;
57527
SELECT full_name, krb_name, email_address FROM employee_directory WHERE full_name LIKE '%Michael%';
57472
SELECT * FROM (SELECT DISTINCT SCHOOL_NAME, COUNT(*) OVER (PARTITION BY SCHOOL_NAME) AS num_departments FROM STUDENT_DEPARTMENT ORDER BY num_departments DESC) WHERE ROWNUM <= 1;
57545
SELECT DISTINCT SUBJECT_TITLE FROM SUBJECT_SUMMARY WHERE TOTAL_UNITS = (SELECT MAX(TOTAL_UNITS) FROM SUBJECT_SUMMARY);
57505
SELECT TOP_LEVEL_DOMAIN FROM TOP_LEVEL_DOMAIN WHERE TOP_LEVEL_DOMAIN_DESCRIPTION = 'Brazil';
56941
SELECT DISTINCT TERM_START_DATE FROM SUBJECT_SUMMARY WHERE SUBJECT_ID IN (SELECT SUBJECT_ID FROM SUBJECT_ENROLLABLE WHERE OFFER_DEPT_CODE = '6' AND TERM_CODE IN (SELECT TERM_CODE FROM ACADEMIC_TERMS WHERE TERM_END_DATE - TERM_START_DATE < 100));
57498
SELECT DISTINCT SUBJECT_TITLE, CLUSTER_TYPE_DESC FROM SUBJECT_OFFERED WHERE NUM_ENROLLED_STUDENTS > 800;
55906
SELECT title, COUNT(*) AS num_uses FROM TIP_MATERIAL GROUP BY title ORDER BY num_uses DESC;
55205
SELECT ACTIVITY_TITLE, SESSION_LOCATION, RESPONSIBLE_FACULTY_NAME FROM IAP_SUBJECT_DETAIL ORDER BY SESSION_DATE;
57521
SELECT title, isbn FROM TIP_MATERIAL ORDER BY NEW_SHELF_PRICE ASC;
56892
SELECT SUBJECT_TITLE FROM SUBJECT_OFFERED WHERE ROWNUM = 1;
57509
SELECT COUNT(*) FROM (SELECT DEPARTMENT_NAME, COUNT(*) AS num_students FROM MIT_STUDENT_DIRECTORY GROUP BY DEPARTMENT_NAME HAVING COUNT(*) < 300);
56725
SELECT department_name, COUNT(DISTINCT payroll_rank) FROM se_person GROUP BY department_name ORDER BY COUNT(DISTINCT payroll_rank) DESC;
57055
SELECT email_address, full_name
FROM mit_student_directory
WHERE first_name = 'Carole'
UNION
SELECT email_address, full_name
FROM employee_directory
WHERE first_name = 'Carole';
57615
SELECT DISTINCT PAYROLL_RANK FROM SE_PERSON;
55254
SELECT DISTINCT fb.building_name
FROM FAC_BUILDING fb
JOIN EMPLOYEE_DIRECTORY ed ON fb.FAC_BUILDING_KEY = ed.OFFICE_LOCATION
WHERE fb.DATE_BUILT < '1950-01-01' AND ed.MIT_ID IS NOT NULL
GROUP BY fb.building_name
HAVING COUNT(DISTINCT ed.MIT_ID) > 100;
57482
SELECT COUNT(*) FROM SUBJECT_SUMMARY WHERE DEPARTMENT_NAME = 'Center for International Studies';
57541
SELECT COUNT(DISTINCT SUBJECT_TITLE) FROM SUBJECT_OFFERED WHERE NUM_ENROLLED_STUDENTS > 100;
56191
SELECT DISTINCT office_location, COUNT(*) OVER (PARTITION BY office_location) AS num_occupants FROM employee_directory WHERE office_location IS NOT NULL AND office_location != '' AND COUNT(*) OVER (PARTITION BY office_location) > 1;
56949
SELECT SUBJECT_GROUP_ID, COUNT(*) FROM SUBJECT_OFFERED WHERE TERM_CODE LIKE '%03' GROUP BY SUBJECT_GROUP_ID;
53900
SELECT INSTRUCTOR_NAME, COURSE_NAME, COUNT(LIBRARY_MATERIAL_STATUS_KEY) FROM LIBRARY_COURSE_INSTRUCTOR GROUP BY INSTRUCTOR_NAME, COURSE_NAME;
56409
SELECT * FROM (SELECT DISTINCT BUILDING_NAME_LONG, SUM(NUM_ENROLLED_STUDENTS) OVER (PARTITION BY BUILDING_NAME_LONG) AS total_students FROM SUBJECT_SUMMARY) ORDER BY total_students DESC;
56757
SELECT * FROM (SELECT DISTINCT BUILDING_NAME_LONG, AVG(num_spaces) OVER (PARTITION BY BUILDING_NAME_LONG) as avg_rooms_per_floor FROM (SELECT BUILDING_KEY, FLOOR, COUNT(*) OVER (PARTITION BY BUILDING_KEY, FLOOR) as num_spaces FROM FAC_ROOMS) sd, FAC_BUILDING WHERE FAC_BUILDING.FAC_BUILDING_KEY = sd.BUILDING_KEY) ORDER BY avg_rooms_per_floor DESC;
56908
SELECT DISTINCT MAJOR_USE_DESC FROM FAC_ROOMS;
56925
SELECT DISTINCT INSTRUCTOR_NAME, ACTIVITY_TITLE, COUNT(*) OVER (PARTITION BY INSTRUCTOR_NAME, ACTIVITY_TITLE) AS num_sessions FROM IAP_SUBJECT_DETAIL;
57501
SELECT * FROM (SELECT DISTINCT BUILDING_NAME_LONG, EXT_GROSS_AREA FROM FAC_BUILDING ORDER BY EXT_GROSS_AREA DESC) WHERE ROWNUM <= 1;
57335
SELECT COUNT(*) FROM (SELECT hr_org_unit_key FROM hr_org_unit MINUS SELECT hr_org_unit_key FROM hr_org_unit_new);
57319
SELECT COUNT(*) FROM (SELECT hr_org_unit_key FROM hr_org_unit_new EXCEPT SELECT hr_org_unit_key FROM hr_org_unit);
57454
SELECT DEPARTMENT_NAME, COUNT(*) FROM SUBJECT_SUMMARY GROUP BY DEPARTMENT_NAME;
56971
SELECT DISTINCT subject_title, term_start_date, term_end_date FROM SUBJECT_SUMMARY, ACADEMIC_TERMS WHERE term_start_date < SYSDATE AND term_end_date < SYSDATE UNION SELECT DISTINCT subject_title, term_start_date, term_end_date FROM SUBJECT_SUMMARY, ACADEMIC_TERMS WHERE term_start_date > SYSDATE AND term_end_date > SYSDATE UNION SELECT DISTINCT subject_title, term_start_date, term_end_date FROM SUBJECT_SUMMARY, ACADEMIC_TERMS WHERE term_start_date <= SYSDATE AND term_end_date >= SYSDATE;
57256
SELECT * FROM (SELECT FULL_NAME, COUNT(DISTINCT OFFICE_LOCATION) AS num_locations FROM EMPLOYEE_DIRECTORY GROUP BY FULL_NAME ORDER BY num_locations DESC) WHERE ROWNUM = 1;
57279
SELECT AVG(SUBJECT_ENROLLMENT_NUMBER) FROM SUBJECT_SUMMARY;
57373
SELECT DISTINCT full_name
FROM mit_student_directory
WHERE full_name IN (SELECT full_name
                    FROM employee_directory);
57001
SELECT SUBJECT_TITLE FROM SUBJECT_SUMMARY WHERE TOTAL_UNITS = (SELECT MIN(TOTAL_UNITS) FROM SUBJECT_SUMMARY);
57329
SELECT BUILDING_NAME_LONG, STREET_NUMBER, STREET_NAME, CITY, STATE, POSTAL_CODE FROM FAC_BUILDING_ADDRESS;
57638
SELECT COUNT(DISTINCT MIT_ID) FROM mit_student_directory;
56956
SELECT DISTINCT TIP_MATERIAL_STATUS FROM TIP_MATERIAL_STATUS;
57421
SELECT DISTINCT city_name FROM ((SELECT city_name FROM zip_usa) UNION (SELECT city_name FROM zip_canada));
57439
SELECT AVG(course_COUNT) FROM (SELECT COUNT(*) AS course_COUNT FROM SUBJECT_ENROLLABLE GROUP BY OFFER_DEPT_CODE HAVING COUNT(*) > 100);
57243
SELECT COUNT(*) FROM FAC_ROOMS WHERE BUILDING_KEY = 'building_key';
57161
SELECT building_key, COUNT(DISTINCT space_unit_key) FROM space_detail GROUP BY building_key;
56061
SELECT term_start_date FROM SUBJECT_SUMMARY WHERE SUBJECT_TITLE IN (SELECT SUBJECT_TITLE FROM SUBJECT_SUMMARY WHERE SUBJECT_DESCRIPTION IN ('Regular', 'Initial'));
57456
SELECT OFFER_DEPT_NAME, COUNT(*) AS course_count FROM SUBJECT_OFFERED GROUP BY OFFER_DEPT_NAME ORDER BY course_count DESC FETCH FIRST 3 ROWS ONLY;
56299
SELECT office_location FROM employee_directory WHERE full_name = 'Michael Stonebraker'
57415
SELECT DISTINCT a.full_name
FROM employee_directory a, employee_directory b
WHERE a.full_name = b.full_name
AND a.mit_id <> b.mit_id;
57524
SELECT DISTINCT SUBJECT_TITLE FROM SUBJECT_ENROLLABLE WHERE OFFER_DEPT_CODE = '6';
57570
SELECT DEPARTMENT_NAME, COUNT(*) FROM MIT_STUDENT_DIRECTORY GROUP BY DEPARTMENT_NAME;
57484
SELECT DISTINCT IAP_CATEGORY_NAME FROM IAP_SUBJECT_CATEGORY;
57329
SELECT city_name FROM zip_usa WHERE ZIP_CODE = '501';
57616
SELECT COUNT(*) FROM employee_directory;
57559
SELECT SCHOOL_NAME, COUNT(DISTINCT DEPARTMENT_NAME) FROM STUDENT_DEPARTMENT GROUP BY SCHOOL_NAME;
57527
SELECT full_name, krb_name, email_address FROM employee_directory WHERE full_name LIKE '%Michael%';
57472
SELECT * FROM (SELECT DISTINCT SCHOOL_NAME, COUNT(*) OVER (PARTITION BY SCHOOL_NAME) AS num_departments FROM STUDENT_DEPARTMENT ORDER BY num_departments DESC) WHERE ROWNUM <= 1;
57545
SELECT DISTINCT SUBJECT_TITLE FROM SUBJECT_SUMMARY WHERE TOTAL_UNITS = (SELECT MAX(TOTAL_UNITS) FROM SUBJECT_SUMMARY);
57505
SELECT TOP_LEVEL_DOMAIN FROM TOP_LEVEL_DOMAIN WHERE TOP_LEVEL_DOMAIN_DESCRIPTION = 'Brazil';
56941
SELECT DISTINCT TERM_START_DATE FROM SUBJECT_SUMMARY, ACADEMIC_TERMS WHERE SUBJECT_SUMMARY.TERM_CODE = ACADEMIC_TERMS.TERM_CODE AND SUBJECT_SUMMARY.OFFER_DEPT_CODE = '6' AND (TERM_END_DATE - TERM_START_DATE) < 100;
57498
SELECT DISTINCT SUBJECT_TITLE, FORMAT FROM SUBJECT_OFFERED WHERE NUM_ENROLLED_STUDENTS > 800;
55906
SELECT TITLE, COUNT(*) AS USAGE_COUNT FROM TIP_MATERIAL GROUP BY TITLE ORDER BY USAGE_COUNT DESC;
55205
SELECT ACTIVITY_TITLE, SESSION_LOCATION, RESPONSIBLE_FACULTY_NAME FROM IAP_SUBJECT_DETAIL ORDER BY SESSION_DATE;
57521
SELECT title, isbn FROM TIP_MATERIAL ORDER BY NEW_SHELF_PRICE ASC;
56892
SELECT DISTINCT SUBJECT_TITLE FROM SUBJECT_SUMMARY WHERE WAREHOUSE_LOAD_DATE = (SELECT MIN(WAREHOUSE_LOAD_DATE) FROM SUBJECT_SUMMARY);
57509
SELECT COUNT(*) FROM (SELECT DEPARTMENT_NAME, COUNT(*) AS num_students FROM MIT_STUDENT_DIRECTORY GROUP BY DEPARTMENT_NAME HAVING COUNT(*) < 300);
56725
SELECT department_name, COUNT(DISTINCT payroll_rank) FROM se_person GROUP BY department_name ORDER BY COUNT(DISTINCT payroll_rank) DESC;
57055
SELECT email_address, full_name FROM mit_student_directory WHERE first_name = 'Carole' UNION SELECT email_address, full_name FROM employee_directory WHERE first_name = 'Carole'
57615
SELECT DISTINCT PAYROLL_RANK FROM SE_PERSON;
55254
SELECT DISTINCT fb.building_name
FROM fac_building fb
JOIN fac_building_address fba ON fb.fac_building_key = fba.building_key
JOIN employee_directory ed ON fb.fac_building_key = ed.office_location
WHERE fb.date_built < '1950-01-01' AND ed.employee_type = 'Employee'
GROUP BY fb.building_name
HAVING COUNT(DISTINCT ed.mit_id) > 100;
57482
SELECT COUNT(*) FROM SUBJECT_SUMMARY WHERE DEPARTMENT_NAME = 'Center for International Studies';
57541
SELECT COUNT(DISTINCT SUBJECT_TITLE) FROM SUBJECT_OFFERED WHERE NUM_ENROLLED_STUDENTS > 100;
56191
SELECT DISTINCT office_location, COUNT(*) OVER (PARTITION BY office_location) FROM employee_directory WHERE office_location IS NOT NULL AND office_location <> '' AND COUNT(*) OVER (PARTITION BY office_location) > 1;
56949
SELECT DISTINCT SUBJECT_GROUP_ID, COUNT(*) OVER (PARTITION BY SUBJECT_GROUP_ID) FROM SUBJECT_OFFERED WHERE TERM_CODE LIKE '%03%';
53900
SELECT INSTRUCTOR_NAME, COURSE_NAME, COUNT(LIBRARY_MATERIAL_STATUS_KEY) FROM LIBRARY_COURSE_INSTRUCTOR GROUP BY INSTRUCTOR_NAME, COURSE_NAME;
56409
SELECT * FROM (SELECT DISTINCT BUILDING_NAME_LONG, SUM(NUM_ENROLLED_STUDENTS) OVER (PARTITION BY BUILDING_NAME_LONG) AS TOTAL_STUDENTS FROM SUBJECT_SUMMARY) ORDER BY TOTAL_STUDENTS DESC;
56757
SELECT building_name, AVG(num_spaces) FROM (SELECT DISTINCT BUILDING_NAME_LONG, num_spaces FROM (SELECT BUILDING_KEY, FLOOR, COUNT(*) OVER (PARTITION BY BUILDING_KEY, FLOOR) as num_spaces FROM SPACE_DETAIL) sd, FAC_BUILDING WHERE FAC_BUILDING.FAC_BUILDING_KEY = sd.BUILDING_KEY) GROUP BY building_name ORDER BY AVG(num_spaces) DESC;
56908
SELECT DISTINCT MAJOR_USE_DESC, COUNT(*) OVER (PARTITION BY MAJOR_USE_DESC) FROM FAC_ROOMS;
56925
SELECT DISTINCT INSTRUCTOR_NAME, ACTIVITY_TITLE, COUNT(*) OVER (PARTITION BY INSTRUCTOR_NAME, ACTIVITY_TITLE) AS num_sessions FROM IAP_SUBJECT_DETAIL;
57501
SELECT * FROM (SELECT DISTINCT BUILDING_NAME_LONG, EXT_GROSS_AREA FROM FAC_BUILDING ORDER BY EXT_GROSS_AREA DESC) WHERE ROWNUM <= 1;
57335
SELECT COUNT(*) FROM (SELECT hr_org_unit_key FROM hr_org_unit MINUS SELECT hr_org_unit_key FROM hr_org_unit_new);
57319
SELECT COUNT(*) FROM (SELECT hr_org_unit_key FROM hr_org_unit_new EXCEPT SELECT hr_org_unit_key FROM hr_org_unit);
57454
SELECT DEPARTMENT_NAME, COUNT(*) FROM SUBJECT_SUMMARY GROUP BY DEPARTMENT_NAME;
56971
SELECT DISTINCT subject_title FROM SUBJECT_SUMMARY WHERE term_start_date < SYSDATE OR term_start_date > SYSDATE OR term_start_date = SYSDATE;
57256
SELECT * FROM (SELECT FULL_NAME, COUNT(DISTINCT OFFICE_LOCATION) AS num_locations FROM EMPLOYEE_DIRECTORY GROUP BY FULL_NAME ORDER BY num_locations DESC) WHERE ROWNUM = 1;
57279
SELECT AVG(SUBJECT_ENROLLMENT_NUMBER) FROM SUBJECT_SUMMARY;
57373
SELECT DISTINCT full_name
FROM mit_student_directory
WHERE full_name IN (SELECT full_name
                    FROM employee_directory);
57001
SELECT SUBJECT_TITLE FROM SUBJECT_SUMMARY WHERE TOTAL_UNITS = (SELECT MIN(TOTAL_UNITS) FROM SUBJECT_SUMMARY);
57329
SELECT BUILDING_NAME_LONG, STREET_NUMBER, STREET_NAME, CITY, STATE, POSTAL_CODE FROM FAC_BUILDING_ADDRESS;
57638
SELECT COUNT(DISTINCT MIT_ID) FROM mit_student_directory;
56956
SELECT DISTINCT TIP_MATERIAL_STATUS FROM TIP_MATERIAL_STATUS;
57421
SELECT DISTINCT CITY_NAME FROM ZIP_USA UNION SELECT DISTINCT CITY_NAME FROM ZIP_CANADA;
57439
SELECT AVG(course_count) FROM (SELECT COUNT(*) AS course_count FROM SUBJECT_ENROLLABLE GROUP BY OFFER_DEPT_CODE HAVING COUNT(*) > 100);
57243
SELECT DISTINCT BUILDING_NAME_LONG, COUNT(*) OVER (PARTITION BY BUILDING_NAME_LONG) FROM FAC_BUILDING_ADDRESS;
57161
SELECT building_key, COUNT(DISTINCT space_unit_key) FROM space_detail;
56061
SELECT term_start_date FROM SUBJECT_SUMMARY WHERE SUBJECT_TITLE IN (SELECT SUBJECT_TITLE FROM SUBJECT_SUMMARY WHERE SUBJECT_DESCRIPTION IN ('Regular', 'Initial'));
57456
SELECT OFFER_DEPT_NAME, COUNT(*) AS course_count FROM SUBJECT_OFFERED GROUP BY OFFER_DEPT_NAME ORDER BY course_count DESC FETCH FIRST 3 ROWS ONLY;
56299
SELECT office_location FROM employee_directory WHERE full_name = 'Michael Stonebraker'
57415
SELECT DISTINCT a.full_name
FROM employee_directory a, employee_directory b
WHERE a.full_name = b.full_name AND a.mit_id <> b.mit_id;
57524
SELECT DISTINCT SUBJECT_TITLE FROM SUBJECT_ENROLLABLE WHERE OFFER_DEPT_CODE = '6';
57570
SELECT DEPARTMENT_NAME, COUNT(*) FROM MIT_STUDENT_DIRECTORY GROUP BY DEPARTMENT_NAME;
57484
SELECT DISTINCT IAP_CATEGORY_NAME FROM IAP_SUBJECT_CATEGORY;
57329
SELECT city_name FROM zip_usa WHERE ZIP_CODE = '501';
57616
SELECT COUNT(*) FROM employee_directory;
57559
SELECT SCHOOL_NAME, COUNT(DISTINCT DEPARTMENT_NAME) FROM STUDENT_DEPARTMENT GROUP BY SCHOOL_NAME;
57527
SELECT full_name, krb_name, email_address FROM employee_directory WHERE full_name LIKE '%Michael%';
57472
SELECT * FROM (SELECT DISTINCT SCHOOL_NAME, COUNT(*) OVER (PARTITION BY SCHOOL_NAME) AS num_departments FROM STUDENT_DEPARTMENT ORDER BY num_departments DESC) WHERE ROWNUM <= 1;
57545
SELECT DISTINCT SUBJECT_TITLE FROM SUBJECT_SUMMARY WHERE TOTAL_UNITS = (SELECT MAX(TOTAL_UNITS) FROM SUBJECT_SUMMARY);
57505
SELECT TOP_LEVEL_DOMAIN FROM TOP_LEVEL_DOMAIN WHERE TOP_LEVEL_DOMAIN_DESCRIPTION = 'Brazil';
56941
SELECT DISTINCT TERM_START_DATE FROM SUBJECT_SUMMARY, ACADEMIC_TERMS
WHERE SUBJECT_SUMMARY.TERM_CODE = ACADEMIC_TERMS.TERM_CODE
AND SUBJECT_SUMMARY.OFFER_DEPT_CODE = '6'
AND TERM_END_DATE - TERM_START_DATE < 100;
57498
SELECT DISTINCT SUBJECT_TITLE, FORMAT FROM SUBJECT_OFFERED WHERE NUM_ENROLLED_STUDENTS > 800;
55906
SELECT TITLE, COUNT(*) AS num_uses FROM TIP_MATERIAL GROUP BY TITLE ORDER BY num_uses DESC;
55205
SELECT ACTIVITY_TITLE, SESSION_LOCATION, RESPONSIBLE_FACULTY_NAME FROM IAP_SUBJECT_DETAIL ORDER BY SESSION_DATE;
57521
SELECT TITLE, ISBN FROM TIP_MATERIAL ORDER BY NEW_SHELF_PRICE ASC;
56892
SELECT DISTINCT SUBJECT_TITLE FROM SUBJECT_SUMMARY WHERE TERM_CODE = (SELECT MIN(TERM_CODE) FROM SUBJECT_SUMMARY);
57509
SELECT COUNT(*) FROM (SELECT DEPARTMENT_NAME, COUNT(*) AS num_students FROM MIT_STUDENT_DIRECTORY GROUP BY DEPARTMENT_NAME HAVING COUNT(*) < 300);
56725
SELECT department_name, COUNT(DISTINCT payroll_rank) FROM se_person GROUP BY department_name ORDER BY COUNT(DISTINCT payroll_rank) DESC;
57055
SELECT email_address, full_name
FROM mit_student_directory
WHERE first_name = 'Carole'
UNION
SELECT email_address, full_name
FROM employee_directory
WHERE first_name = 'Carole';
57615
SELECT DISTINCT PAYROLL_RANK FROM SE_PERSON;
55254
SELECT DISTINCT fb.building_name
FROM fac_building fb
JOIN employee_directory ed ON fb.fac_building_key = ed.office_location
WHERE fb.date_built < '1950-01-01'
GROUP BY fb.building_name
HAVING COUNT(DISTINCT ed.mit_id) > 100;
57482
SELECT COUNT(*) FROM SUBJECT_SUMMARY WHERE DEPARTMENT_NAME = 'Center for International Studies';
57541
SELECT COUNT(DISTINCT SUBJECT_TITLE) FROM SUBJECT_OFFERED WHERE NUM_ENROLLED_STUDENTS > 100;
56191
SELECT DISTINCT office_location, COUNT(*) OVER (PARTITION BY office_location) AS num_occupants FROM employee_directory WHERE office_location IS NOT NULL AND office_location != '' AND office_location IN (SELECT office_location FROM employee_directory GROUP BY office_location HAVING COUNT(*) > 1);
56949
SELECT DISTINCT SUBJECT_GROUP_ID, COUNT(*) OVER (PARTITION BY SUBJECT_GROUP_ID) AS num_courses
FROM SUBJECT_OFFERED
WHERE TO_CHAR(WAREHOUSE_LOAD_DATE, 'MM') = '03';
53900
SELECT INSTRUCTOR_NAME, COURSE_NAME, COUNT(*) AS MATERIAL_AMOUNT FROM LIBRARY_COURSE_INSTRUCTOR GROUP BY INSTRUCTOR_NAME, COURSE_NAME;
56409
SELECT * FROM (SELECT DISTINCT BUILDING_NAME_LONG, SUM(NUM_ENROLLED_STUDENTS) OVER (PARTITION BY BUILDING_NAME_LONG) AS TOTAL_STUDENTS FROM SUBJECT_SUMMARY) ORDER BY TOTAL_STUDENTS DESC;
56757
SELECT building_name FROM (SELECT building_name, AVG(num_rooms) OVER (PARTITION BY building_name) AS avg_rooms_per_floor FROM (SELECT building_name, floor, COUNT(*) AS num_rooms FROM fac_rooms GROUP BY building_name, floor) ORDER BY avg_rooms_per_floor DESC) WHERE ROWNUM = 1;
56908
SELECT DISTINCT MAJOR_USE_DESC FROM FAC_ROOMS;
56925
SELECT DISTINCT INSTRUCTOR_NAME, ACTIVITY_TITLE, COUNT(*) OVER (PARTITION BY INSTRUCTOR_NAME, ACTIVITY_TITLE) AS num_sessions FROM IAP_SUBJECT_DETAIL;
57501
SELECT * FROM (SELECT DISTINCT BUILDING_NAME_LONG, EXT_GROSS_AREA FROM FAC_BUILDING ORDER BY EXT_GROSS_AREA DESC) WHERE ROWNUM <= 1;

In [59]:
for i in range(0,60,10):
    sql=[]
    for j in range(len(df_q)):
        if df_q["gpt_sql_q_a_log_{0}_1.0".format(str(i))][j] == df_q["gpt_sql_q_a_log_{0}_1.1".format(str(i))][j]:
            sql.append(df_q["gpt_sql_q_a_log_{0}_1.0".format(str(i))][j])
        elif df_q["gpt_sql_q_a_log_{0}_1.1".format(str(i))][j] == df_q["gpt_sql_q_a_log_{0}_1.2".format(str(i))][j]:
            sql.append(df_q["gpt_sql_q_a_log_{0}_1.1".format(str(i))][j])
        elif df_q["gpt_sql_q_a_log_{0}_1.0".format(str(i))][j] == df_q["gpt_sql_q_a_log_{0}_1.2".format(str(i))][j]:
            sql.append(df_q["gpt_sql_q_a_log_{0}_1.2".format(str(i))][j])
        else:
            print("oh wow: " + str(j) +" + " + str(i)) 
            sql.append(df_q["gpt_sql_q_a_log_{0}_1.2".format(str(i))][j])
    df_q["gpt_sql_q_a_log_{0}_1".format(str(i))] = sql
    print(i)

oh wow: 1 + 0
oh wow: 4 + 0
oh wow: 6 + 0
oh wow: 30 + 0
oh wow: 39 + 0
oh wow: 47 + 0
0
oh wow: 1 + 10
oh wow: 7 + 10
oh wow: 8 + 10
oh wow: 16 + 10
oh wow: 36 + 10
oh wow: 48 + 10
10
oh wow: 16 + 20
oh wow: 24 + 20
oh wow: 33 + 20
oh wow: 39 + 20
oh wow: 42 + 20
oh wow: 44 + 20
20
oh wow: 3 + 30
oh wow: 6 + 30
oh wow: 27 + 30
oh wow: 37 + 30
oh wow: 39 + 30
30
oh wow: 18 + 40
oh wow: 32 + 40
oh wow: 39 + 40
40
oh wow: 3 + 50
oh wow: 42 + 50
oh wow: 46 + 50
50

In [107]:
df_q[['gpt_4_sql_q_a_log_20_1.0', 'gpt_4_sql_q_a_log_20_1.1', 'gpt_4_sql_q_a_log_20_1.2']]

,gpt_4_sql_q_a_log_20_1.0,gpt_4_sql_q_a_log_20_1.1,gpt_4_sql_q_a_log_20_1.2
0,SELECT COUNT(*) FROM (SELECT hr_org_unit_key FROM hr_org_unit INTERSECT SELECT hr_org_unit_key FROM hr_org_unit_new);,SELECT COUNT(*) FROM (SELECT hr_org_unit_key FROM hr_org_unit INTERSECT SELECT hr_org_unit_key FROM hr_org_unit_new);,SELECT COUNT(*) FROM (SELECT hr_org_unit_key FROM hr_org_unit INTERSECT SELECT hr_org_unit_key FROM hr_org_unit_new);
1,SELECT COUNT(*) FROM hr_org_unit_new WHERE hr_org_unit_key NOT IN (SELECT hr_org_unit_key FROM hr_org_unit);,SELECT COUNT(*) FROM hr_org_unit_new WHERE hr_org_unit_key NOT IN (SELECT hr_org_unit_key FROM hr_org_unit);,SELECT COUNT(*) FROM hr_org_unit_new WHERE hr_org_unit_key NOT IN (SELECT hr_org_unit_key FROM hr_org_unit);
2,"SELECT OFFER_DEPT_NAME, COUNT(DISTINCT MASTER_COURSE_NUMBER) FROM LIBRARY_SUBJECT_OFFERED GROUP BY OFFER_DEPT_NAME;","SELECT OFFER_DEPT_NAME, COUNT(DISTINCT MASTER_COURSE_NUMBER) FROM LIBRARY_SUBJECT_OFFERED GROUP BY OFFER_DEPT_NAME;","SELECT OFFER_DEPT_NAME, COUNT(DISTINCT MASTER_COURSE_NUMBER) FROM LIBRARY_SUBJECT_OFFERED GROUP BY OFFER_DEPT_NAME;"
3,SELECT DISTINCT subject_title FROM course_catalog_subject_offered WHERE term_code < (SELECT term_code FROM academic_terms_all WHERE is_current_term = 'Y') UNION SELECT DISTINCT subject_title FROM course_catalog_subject_offered WHERE term_code = (SELECT term_code FROM academic_terms_all WHERE is_current_term = 'Y') UNION SELECT DISTINCT subject_title FROM course_catalog_subject_offered WHERE term_code > (SELECT term_code FROM academic_terms_all WHERE is_current_term = 'Y');,SELECT DISTINCT subject_title FROM course_catalog_subject_offered WHERE term_code < (SELECT term_code FROM academic_terms_all WHERE is_current_term = 'Y') UNION SELECT DISTINCT subject_title FROM course_catalog_subject_offered WHERE term_code = (SELECT term_code FROM academic_terms_all WHERE is_current_term = 'Y') UNION SELECT DISTINCT subject_title FROM course_catalog_subject_offered WHERE term_code > (SELECT term_code FROM academic_terms_all WHERE is_current_term = 'Y');,SELECT DISTINCT subject_title FROM course_catalog_subject_offered WHERE term_code < (SELECT term_code FROM academic_terms_all WHERE is_current_term = 'Y') UNION SELECT DISTINCT subject_title FROM course_catalog_subject_offered WHERE term_code = (SELECT term_code FROM academic_terms_all WHERE is_current_term = 'Y') UNION SELECT DISTINCT subject_title FROM course_catalog_subject_offered WHERE term_code > (SELECT term_code FROM academic_terms_all WHERE is_current_term = 'Y');
4,"SELECT * FROM (SELECT RESPONSIBLE_FACULTY_NAME, COUNT(DISTINCT OFFICE_LOCATION) AS num_location_changes FROM LIBRARY_SUBJECT_OFFERED GROUP BY RESPONSIBLE_FACULTY_NAME ORDER BY num_location_changes DESC) WHERE ROWNUM <= 1;","SELECT * FROM (SELECT RESPONSIBLE_FACULTY_NAME, COUNT(DISTINCT OFFICE_LOCATION) AS num_location_changes FROM SE_PERSON GROUP BY RESPONSIBLE_FACULTY_NAME ORDER BY num_location_changes DESC) WHERE ROWNUM <= 1;","SELECT * FROM (SELECT responsible_faculty_name, COUNT(DISTINCT office_location) AS num_location_changes FROM se_person GROUP BY responsible_faculty_name ORDER BY num_location_changes DESC) WHERE ROWNUM <= 1;"
5,SELECT AVG(SUBJECT_ENROLLMENT_NUMBER) FROM SUBJECT_SUMMARY;,SELECT AVG(SUBJECT_ENROLLMENT_NUMBER) FROM SUBJECT_SUMMARY;,SELECT AVG(SUBJECT_ENROLLMENT_NUMBER) FROM SUBJECT_SUMMARY;
6,SELECT DISTINCT MIT_ID FROM MIT_STUDENT_DIRECTORY;,"SELECT DISTINCT mit_id, full_name FROM mit_student_directory WHERE mit_id IN (SELECT mit_id FROM se_person WHERE employee_type = 'Student');","SELECT DISTINCT mit_id, full_name FROM mit_student_directory WHERE mit_id IN (SELECT mit_id FROM se_person WHERE employee_type = 'Student');"
7,SELECT MIN(TOTAL_UNITS) FROM COURSE_CATALOG_SUBJECT_OFFERED;,SELECT MIN(TOTAL_UNITS) FROM COURSE_CATALOG_SUBJECT_OFFERED;,SELECT MIN(TOTAL_UNITS) FROM COURSE_CATALOG_SUBJECT_OFFERED;
8,"SELECT BUILDING_NAME_LONG, STREET_NUMBER, STREET_NAME, CITY, STATE, POSTAL_CODE FROM FAC_BUILDING_ADDRESS;","SELECT BUILDING_NAME_LONG, STREET_NUMBER, STREET_NAME, CITY, STATE, POSTAL_CODE FROM FAC_BUILDING_ADDRESS;","SELECT BUILDING_NAME_LONG, STREET_NUMBER, STREET_NAME, CITY, STATE, POSTAL_CODE FROM FAC_BUILDING_ADDRESS;"
9,SELECT COUNT(DISTINCT MIT_ID) FROM MIT_STUDENT_DIRECTORY;,SELECT COUNT(DISTINCT MIT_ID) FROM MIT_STUDENT_DIRECTORY;,SELECT COUNT(DISTINCT MIT_ID) FROM MIT_STUDENT_DIRECTORY;
10,SELECT DISTINCT library_material_status FROM library_material_status;,SELECT DISTINCT library_material_status FROM library_material_status;,SELECT DISTINCT library_material_status FROM library_material_status;
11,SELECT DISTINCT city FROM fac_building_address;,SELECT DISTINCT city FROM fac_building_address;,SELECT DISTINCT city FROM fac_building_address;
12,SELECT AVG(num_courses) FROM (SELECT COUNT(DISTINCT MASTER_COURSE_NUMBER) AS num_courses FROM COURSE_CATALOG_SUBJECT_OFFERED GROUP BY DEPARTMENT_NAME HAVING COUNT(DISTINCT MASTER_COURSE_NUMBER) > 100);,SELECT AVG(num_courses) FROM (SELECT COUNT(DISTINCT subject_id) AS num_courses FROM course_catalog_subject_offered GROUP BY department_name HAVING COUNT(DISTINCT subject_id) > 100);,SELECT AVG(num_courses) FROM (SELECT COUNT(DISTINCT subject_id) AS num_courses FROM course_catalog_subject_offered GROUP BY department_name HAVING COUNT(DISTINCT subject_id) > 100);
13,SELECT COUNT(*) FROM fclt_rooms WHERE fclt_building_key = 'BUILDING_KEY';,SELECT COUNT(*) FROM fclt_rooms WHERE fclt_building_key = 'BUILDING_KEY';,SELECT COUNT(*) FROM fclt_rooms WHERE fclt_building_key = 'BUILDING_KEY';
14,"SELECT building_key, COUNT(DISTINCT space_unit_key) FROM space_detail GROUP BY building_key;","SELECT building_key, COUNT(DISTINCT space_unit_key) FROM space_detail GROUP BY building_key;","SELECT building_key, COUNT(DISTINCT space_unit_key) FROM space_detail GROUP BY building_key;"
15,"SELECT DISTINCT term_start_date FROM academic_terms_all WHERE term_selector IN ('Regular', 'Initial');","SELECT DISTINCT term_start_date FROM academic_terms_all WHERE term_description IN ('Regular', 'Initial');","SELECT DISTINCT term_start_date FROM academic_terms_all WHERE term_selector IN ('Regular', 'Initial');"
16,"SELECT department_name, COUNT(DISTINCT subject_id) as num_courses FROM course_catalog_subject_offered GROUP BY department_name ORDER BY num_courses DESC FETCH FIRST 3 ROWS ONLY;","SELECT department_name, COUNT(DISTINCT subject_id) as num_courses FROM course_catalog_subject_offered GROUP BY department_name ORDER BY num_courses DESC FETCH FIRST 3 ROWS ONLY;","SELECT department_name, COUNT(DISTINCT subject_id) as num_courses FROM course_catalog_subject_offered GROUP BY department_name ORDER BY num_courses DESC FETCH FIRST 3 ROWS ONLY;"
17,SELECT office_location FROM se_person WHERE full_name = 'Michael Stonebraker';,SELECT office_location FROM se_person WHERE full_name = 'Michael Stonebraker';,SELECT office_location FROM se_person WHERE full_name = 'Michael Stonebraker';
18,"SELECT DISTINCT a.mit_id, a.full_name, b.mit_id, b.full_name FROM employee_directory a, employee_directory b WHERE a.full_name = b.full_name AND a.mit_id <> b.mit_id;","SELECT DISTINCT a.mit_id, a.full_name, b.mit_id, b.full_name FROM employee_directory a, employee_directory b WHERE a.full_name = b.full_name AND a.mit_id <> b.mit_id;","SELECT DISTINCT a.mit_id, a.full_name, b.mit_id, b.full_name FROM employee_directory a, employee_directory b WHERE a.full_name = b.full_name AND a.mit_id <> b.mit_id;"
19,SELECT DISTINCT subject_title FROM subject_enrollable WHERE offer_dept_code = '6';,SELECT DISTINCT SUBJECT_TITLE FROM SUBJECT_ENROLLABLE WHERE OFFER_DEPT_CODE = '6';,SELECT DISTINCT SUBJECT_TITLE FROM SUBJECT_ENROLLABLE WHERE OFFER_DEPT_CODE = '6';
20,"SELECT department_name, COUNT(*) FROM mit_student_directory GROUP BY department_name;","SELECT department_name, COUNT(*) FROM mit_student_directory GROUP BY department_name;","SELECT department_name, COUNT(*) FROM mit_student_directory GROUP BY department_name;"
21,SELECT DISTINCT iap_category_name FROM iap_subject_category;,SELECT DISTINCT iap_category_name FROM iap_subject_category;,SELECT DISTINCT iap_category_name FROM iap_subject_category;
22,SELECT city_name FROM zip_usa WHERE zip_code = '501';,SELECT city_name FROM zip_usa WHERE zip_code = '501' UNION SELECT city_name FROM zip_canada WHERE postal_code = '501';,SELECT city_name FROM zip_usa WHERE zip_code = '501';
23,SELECT COUNT(*) FROM employee_directory;,SELECT COUNT(*) FROM employee_directory;,SELECT COUNT(*) FROM employee_directory;
24,"SELECT school_name, COUNT(DISTINCT department_code) FROM student_department GROUP BY school_name;","SELECT school_name, COUNT(DISTINCT department_code) FROM student_department GROUP BY school_name;","SELECT school_name, COUNT(DISTINCT department_code) FROM student_department GROUP BY school_name;"
25,"SELECT full_name, krb_name, email_address FROM se_person WHERE first_name = 'Michael';","SELECT FULL_NAME, KRB_NAME, EMAIL_ADDRESS FROM SE_PERSON WHERE FIRST_NAME = 'Michael';","SELECT full_name, krb_name, email_address FROM se_person WHERE first_name = 'Michael';"
26,"SELECT school_name\nFROM (\n SELECT school_name, COUNT(DISTINCT department_code) AS num_departments\n FROM student_department\n GROUP BY school_name\n ORDER BY num_departments DESC\n)\nWHERE ROWNUM = 1;","SELECT school_name\nFROM (\n SELECT school_name, COUNT(DISTINCT department_code) AS num_departments\n FROM student_department\n GROUP BY school_name\n ORDER BY num_departments DESC\n)\nWHERE ROWNUM = 1;","SELECT school_name\nFROM (\n SELECT school_name, COUNT(DISTINCT department_code) AS num_departments\n FROM subject_summary\n GROUP BY school_name\n ORDER BY num_departments DESC\n)\nWHERE ROWNUM = 1;"
27,"SELECT DISTINCT subject_title, total_units FROM course_catalog_subject_offered WHERE total_units = (SELECT MAX(total_units) FROM course_catalog_subject_offered);","SELECT DISTINCT subject_title, total_units FROM subject_summary WHERE total_units = (SELECT MAX(total_units) FROM subject_summary);","SELECT DISTINCT subject_title, total_units FROM subject_summary WHERE total_units = (SELECT MAX(total_units) FROM subject_summary);"
28,SELECT TOP_LEVEL_DOMAIN_DESCRIPTION FROM TOP_LEVEL_DOMAIN WHERE TOP_LEVEL_DOMAIN = 'BR';,SELECT TOP_LEVEL_DOMAIN_DESCRIPTION FROM TOP_LEVEL_DOMAIN WHERE TOP_LEVEL_DOMAIN = 'BR';,SELECT TOP_LEVEL_DOMAIN_DESCRIPTION FROM TOP_LEVEL_DOMAIN WHERE TOP_LEVEL_DOMAIN = 'BR';
29,"SELECT DISTINCT term_start_date FROM academic_terms_all a, subject_summary b WHERE a.term_code = b.term_code AND b.department_code = '6' AND (term_end_date - term_start_date) < 100;",SELECT DISTINCT term_start_date FROM iap_subject_detail WHERE activity_title LIKE '%Computer Science%' AND term_end_date - term_start_date < 100;,SELECT DISTINCT term_start_date FROM iap_subject_detail WHERE activity_title LIKE '%Computer Science%' AND term_end_date - term_start_date < 100;
30,"SELECT DISTINCT subject_title, meet_time, meet_place FROM subject_offered WHERE num_enrolled_students > 800;","SELECT DISTINCT subject_title, meet_time FROM subject_offered WHERE num_enrolled_students > 800;","SELECT DISTINCT subject_title, meet_time FROM subject_offered WHERE num_enrolled_students > 800;"
31,"SELECT catalog_title, COUNT(*) FROM library_reserve_catalog GROUP BY catalog_title ORDER BY COUNT(*) DESC;",SELECT catalog_title FROM library_reserve_catalog WHERE ROWNUM <= 1;,"SELECT catalog_title, COUNT(*) FROM library_reserve_catalog GROUP BY catalog_title ORDER BY COUNT(*) DESC;"
32,"SELECT ACTIVITY_TITLE, SESSION_LOCATION, PERSON_NAME FROM IAP_SUBJECT_DETAIL, IAP_SUBJECT_PERSON WHERE IAP_SUBJECT_DETAIL.IAP_SUBJECT_PERSON_KEY = IAP_SUBJECT_PERSON.IAP_SUBJECT_PERSON_KEY AND PERSON_ROLE = 'Supervisor' ORDER BY SESSION_START_DATE;","SELECT ACTIVITY_TITLE, SESSION_LOCATION, PERSON_NAME FROM IAP_SUBJECT_DETAIL, IAP_SUBJECT_PERSON WHERE IAP_SUBJECT_DETAIL.IAP_SUBJECT_PERSON_KEY = IAP_SUBJECT_PERSON.IAP_SUBJECT_PERSON_KEY AND PERSON_ROLE = 'Supervisor' ORDER BY SESSION_START_DATE;","SELECT ACTIVITY_TITLE, SESSION_LOCATION, PERSON_NAME FROM IAP_SUBJECT_DETAIL, IAP_SUBJECT_PERSON WHERE IAP_SUBJECT_DETAIL.IAP_SUBJECT_PERSON_KEY = IAP_SUBJECT_PERSON.IAP_SUBJECT_PERSON_KEY AND PERSON_ROLE = 'Supervisor' ORDER BY SESSION_START_DATE;"
33,"SELECT title, isbn FROM tip_material ORDER BY new_shelf_price;","SELECT title, isbn FROM tip_material ORDER BY new_shelf_price;","SELECT title, isbn FROM tip_material ORDER BY new_shelf_price;"
34,SELECT DISTINCT subject_title FROM subject_summary WHERE rownum = 1;,SELECT DISTINCT subject_title FROM subject_summary WHERE rownum = 1;,SELECT DISTINCT subject_title FROM subject_summary WHERE rownum = 1;
35,"SELECT COUNT(*) FROM (SELECT DEPARTMENT_NAME FROM STUDENT_DEPARTMENT, SUBJECT_SUMMARY WHERE STUDENT_DEPARTMENT.DEPARTMENT_CODE = SUBJECT_SUMMARY.DEPARTMENT_CODE GROUP BY DEPARTMENT_NAME HAVING COUNT(DISTINCT SUBJECT_ID) < 300);","SELECT COUNT(*) FROM (SELECT DEPARTMENT_NAME, COUNT(*) AS num_students FROM MIT_STUDENT_DIRECTORY GROUP BY DEPARTMENT_NAME HAVING COUNT(*) < 300);","SELECT COUNT(*) FROM (SELECT department_name, COUNT(*) as num_students FROM mit_student_directory GROUP BY department_name HAVING COUNT(*) < 300);"
36,SELECT department_name\nFROM employee_directory\nGROUP BY department_name\nORDER BY COUNT(DISTINCT payroll_rank) DESC\nFETCH FIRST ROW ONLY;,SELECT department_name\nFROM employee_directory\nGROUP BY department_name\nORDER BY COUNT(DISTINCT payroll_rank) DESC\nFETCH FIRST ROW ONLY;,"SELECT department_code FROM se_person GROUP BY department_code HAVING COUNT(DISTINCT payroll_rank) = (SELECT MAX(cnt) FROM (SELECT department_code, COUNT(DISTINCT payroll_rank) AS cnt FROM se_person GROUP BY department_code));"
37,"SELECT email_address, full_name FROM mit_student_directory WHERE first_name = 'Carole' UNION SELECT email_address, full_name FROM employee_directory WHERE first_name = 'Carole'","SELECT email_address, full_name FROM mit_student_directory WHERE first_name = 'Carole' UNION SELECT email_address, full_name FROM employee_directory WHERE first_name = 'Carole';","SELECT email_address, full_name FROM mit_student_directory WHERE first_name = 'Carole' UNION SELECT email_address, full_name FROM employee_directory WHERE first_name = 'Carole';"
38,SELECT DISTINCT payroll_rank FROM se_person;,SELECT DISTINCT payroll_rank FROM se_person;,SELECT DISTINCT payroll_rank FROM se_person;
39,"SELECT DISTINCT fb.building_name FROM fac_building fb, fac_building_hist fbh, employee_directory ed WHERE fb.FAC_BUILDING_KEY = fbh.FCLT_BUILDING_KEY AND fb.BUILDING_NUMBER = fbh.BUILDING_NUMBER AND fb.DATE_BUILT < '1950' AND ed.OFFICE_LOCATION = fb.FAC_BUILDING_KEY GROUP BY fb.building_name HAVING COUNT(DISTINCT ed.MIT_ID) > 100;","SELECT DISTINCT fb.building_name FROM fac_building fb, employee_directory ed WHERE fb.date_built < '1950' AND fb.num_of_rooms > 100;","SELECT DISTINCT fb.building_name FROM fac_building fb, fac_building_hist fbh, employee_directory ed WHERE fb.FAC_BUILDING_KEY = fbh.FCLT_BUILDING_KEY AND fb.BUILDING_NUMBER = fbh.BUILDING_NUMBER AND fb.DATE_BUILT < '1950' AND ed.OFFICE_LOCATION = fb.FAC_BUILDING_KEY GROUP BY fb.building_name HAVING COUNT(DISTINCT ed.MIT_ID) > 100;"
40,SELECT COUNT(DISTINCT SUBJECT_TITLE) FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE OFFER_DEPT_NAME = 'Center for International Studies';,SELECT COUNT(DISTINCT SUBJECT_TITLE) FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE DEPARTMENT_NAME = 'Center for International Studies';,SELECT COUNT(DISTINCT SUBJECT_TITLE) FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE DEPARTMENT_NAME = 'Center for International Studies';
41,SELECT COUNT(DISTINCT SUBJECT_ID) FROM SUBJECT_OFFERED WHERE NUM_ENROLLED_STUDENTS > 100;,SELECT COUNT(DISTINCT SUBJECT_ID) FROM SUBJECT_OFFERED WHERE NUM_ENROLLED_STUDENTS > 100;,SELECT COUNT(DISTINCT SUBJECT_ID) FROM SUBJECT_OFFERED WHERE NUM_ENROLLED_STUDENTS > 100;
42,SELECT DISTINCT full_name\nFROM employee_directory\nWHERE office_location IN (\n SELECT office_location\n FROM employee_directory\n GROUP BY office_location\n HAVING COUNT(*) > 1\n);,SELECT DISTINCT full_name FROM employee_directory WHERE office_location IN (SELECT office_location FROM employee_directory GROUP BY office_location HAVING COUNT(*) > 1);,SELECT DISTINCT full_name FROM employee_directory WHERE office_location IN (SELECT office_location FROM employee_directory GROUP BY office_location HAVING COUNT(*) > 1);
43,"SELECT subject_group_id, COUNT(*) FROM subject_offered WHERE term_code LIKE '%03' GROUP BY subject_group_id;","SELECT subject_group_id, COUNT(DISTINCT course_number) FROM subject_offered WHERE term_code LIKE '%03' GROUP BY subject_group_id;","SELECT subject_group_id, COUNT(DISTINCT course_number) FROM subject_offered WHERE term_code LIKE '%03' GROUP BY subject_group_id;"
44,"SELECT instructor_name, course_name, COUNT(*) as material_amount FROM library_course_instructor GROUP BY instructor_name, course_name;","SELECT instructor_name, course_name, COUNT(library_material_status_key) \nFROM library_course_instructor \nGROUP BY instructor_name, course_name;","SELECT instructor_name, course_name, COUNT(library_material_status_key) \nFROM library_course_instructor \nGROUP BY instructor_name, course_name;"
45,"SELECT building_name_long, SUM(num_enrolled_students) FROM subject_offered GROUP BY building_name_long ORDER BY SUM(num_enrolled_students) DESC FETCH FIRST ROW ONLY;","SELECT building_name, SUM(num_enrolled_students) FROM subject_offered GROUP BY building_name ORDER BY SUM(num_enrolled_students) DESC FETCH FIRST ROW ONLY;","SELECT building_name, SUM(num_enrolled_students) FROM subject_offered GROUP BY building_name ORDER BY SUM(num_enrolled_students) DESC FETCH FIRST ROW ONLY;"
46,"SELECT building_name_long, AVG(num_rooms) FROM (SELECT building_name_long, floor, COUNT(*) OVER (PARTITION BY building_name_long, floor) as num_rooms FROM fclt_rooms, fclt_building WHERE fclt_rooms.fclt_building_key = fclt_building.fclt_building_key) GROUP BY building_name_long;","SELECT building_name_long, AVG(num_rooms) FROM (SELECT building_name_long, floor, COUNT(*) OVER (PARTITION BY building_name_long, floor) as num_rooms FROM fclt_rooms, fclt_building WHERE fclt_rooms.fclt_building_key = fclt_building.fclt_building_key) GROUP BY building_name_long;","SELECT building_name_long FROM (SELECT building_name_long, AVG(num_rooms) as avg_rooms_per_floor FROM (SELECT building_name_long, floor, COUNT(*) as num_rooms FROM fclt_rooms, fclt_building WHERE fclt_rooms.fclt_building_key = fclt_building.fclt_building_key GROUP BY building_name_long, floor) GROUP BY building_name_long ORDER BY avg_rooms_per_floor DESC) WHERE ROWNUM = 1;"
47,"SELECT MAJOR_USE_DESC, COUNT(*) FROM FCLT_ROOMS GROUP BY MAJOR_USE_DESC ORDER BY COUNT(*) DESC;","SELECT MAJOR_USE_DESC, COUNT(*) FROM FCLT_ROOMS GROUP BY MAJOR_USE_DESC ORDER BY COUNT(*) DESC;","SELECT MAJOR_USE_DESC, COUNT(*) FROM FCLT_ROOMS GROUP BY MAJOR_USE_DESC ORDER BY COUNT(*) DESC;"
48,"SELECT DISTINCT person_name, activity_title, COUNT(*) OVER (PARTITION BY person_name, activity_title) AS session_count FROM iap_subject_person WHERE person_role = 'Activity leader' ORDER BY session_count DESC;","SELECT DISTINCT PERSON_NAME, ACTIVITY_TITLE, COUNT(*) OVER (PARTITION BY PERSON_NAME, ACTIVITY_TITLE) AS num_sessions FROM IAP_SUBJECT_PERSON, IAP_SUBJECT_DETAIL WHERE IAP_SUBJECT_PERSON.IAP_SUBJECT_PERSON_KEY = IAP_SUBJECT_DETAIL.IAP_SUBJECT_PERSON_KEY;","SELECT DISTINCT PERSON_NAME, ACTIVITY_TITLE, COUNT(*) OVER (PARTITION BY PERSON_NAME, ACTIVITY_TITLE) AS num_sessions FROM IAP_SUBJECT_PERSON, IAP_SUBJECT_DETAIL WHERE IAP_SUBJECT_PERSON.IAP_SUBJECT_PERSON_KEY = IAP_SUBJECT_DETAIL.IAP_SUBJECT_PERSON_KEY;"
49,SELECT building_name_long FROM fac_building ORDER BY ext_gross_area DESC FETCH FIRST ROW ONLY;,SELECT building_name_long FROM fac_building WHERE ext_gross_area = (SELECT MAX(ext_gross_area) FROM fac_building),SELECT building_name_long FROM fac_building ORDER BY ext_gross_area DESC FETCH FIRST ROW ONLY;

In [17]:
for j in range(0,60,10):
    sql = []
    for i in range(len(df_q)):
        if df_q['gpt_sql_q_a_log_{0}_1.0'.format(j)][i] == df_q['gpt_sql_q_a_log_{0}_1.1'.format(j)][i]:
            sql.append(df_q['gpt_sql_q_a_log_{0}_1.0'.format(j)][i])
        elif df_q['gpt_sql_q_a_log_{0}_1.1'.format(j)][i] == df_q['gpt_sql_q_a_log_{0}_1.2'.format(j)][i]:
            sql.append(df_q['gpt_sql_q_a_log_{0}_1.1'.format(j)][i])
        else:
            sql.append(df_q['gpt_sql_q_a_log_{0}_1.2'.format(j)][i])
    df_q['gpt_sql_q_a_log_{0}_1'.format(j)]=sql

In [109]:
df_q['gpt_sql_q_a_log_20_1.0'] = sql

# Give ChatGPT the "database" schema and prev queries as context as well as their corresponding questions

# READ DATAFRAME

In [15]:
df_q = pd.read_csv(str(prefix) + '/data/gpt_eval_50querries_noAmb_v1.0.csv')

In [16]:
df_q

,question,sql,tables,gpt_sql_q_a_log_20_1,gpt_sql_q_a_log_20_1.0,gpt_sql_q_a_log_20_1.1,gpt_sql_q_a_log_20_1.2,gpt_sql_q_a_log_0_1.0,gpt_sql_q_a_log_0_1.1,gpt_sql_q_a_log_0_1.2,gpt_sql_q_a_log_10_1.0,gpt_sql_q_a_log_10_1.1,gpt_sql_q_a_log_10_1.2,gpt_sql_q_a_log_30_1.0,gpt_sql_q_a_log_30_1.1,gpt_sql_q_a_log_30_1.2,gpt_sql_q_a_log_40_1.0,gpt_sql_q_a_log_40_1.1,gpt_sql_q_a_log_40_1.2,gpt_sql_q_a_log_50_1.0,gpt_sql_q_a_log_50_1.1,gpt_sql_q_a_log_50_1.2
0,How many organisation units in human resources are relabeled?,SELECT COUNT(*) FROM (SELECT hr_org_unit_key FROM hr_org_unit_new INTERSECT SELECT hr_org_unit_key FROM hr_org_unit);,"['HR_ORG_UNIT_NEW', 'HR_ORG_UNIT']",SELECT COUNT(*) FROM (SELECT hr_org_unit_key FROM hr_org_unit INTERSECT SELECT hr_org_unit_key FROM hr_org_unit_new);,SELECT COUNT(*) FROM hr_org_unit WHERE hr_org_unit_key IN (SELECT hr_org_unit_key FROM hr_org_unit_new);,SELECT COUNT(*) FROM hr_org_unit WHERE hr_org_unit_key IN (SELECT hr_org_unit_key FROM hr_org_unit_new);,SELECT COUNT(*) FROM hr_org_unit WHERE hr_org_unit_key IN (SELECT hr_org_unit_key FROM hr_org_unit_new);,SELECT COUNT(DISTINCT HR_ORG_UNIT_KEY) FROM HR_ORG_UNIT_NEW WHERE HR_DEPARTMENT_NAME <> HR_DEPARTMENT_NAME_LONG,SELECT COUNT(DISTINCT HR_ORG_UNIT_KEY) FROM HR_ORG_UNIT_NEW WHERE HR_DEPARTMENT_NAME <> HR_DEPARTMENT_NAME_LONG,SELECT COUNT(DISTINCT HR_ORG_UNIT_KEY) FROM HR_ORG_UNIT_NEW WHERE HR_DEPARTMENT_NAME <> HR_DEPARTMENT_NAME_LONG,SELECT COUNT(*) FROM HR_ORG_UNIT WHERE HR_DEPARTMENT_NAME <> HR_DEPARTMENT_NAME_ALPHA;,SELECT COUNT(*) FROM HR_ORG_UNIT WHERE HR_DEPARTMENT_NAME <> HR_DEPARTMENT_NAME_ALPHA;,SELECT COUNT(*) FROM HR_ORG_UNIT WHERE HR_DEPARTMENT_NAME <> HR_DEPARTMENT_NAME_ALPHA;,SELECT COUNT(*) FROM hr_org_unit WHERE hr_org_unit_key IN (SELECT hr_org_unit_key FROM hr_org_unit_new);,SELECT COUNT(*) FROM hr_org_unit WHERE hr_org_unit_key IN (SELECT hr_org_unit_key FROM hr_org_unit_new);,SELECT COUNT(*) FROM hr_org_unit WHERE hr_org_unit_key IN (SELECT hr_org_unit_key FROM hr_org_unit_new);,SELECT COUNT(*) FROM hr_org_unit WHERE hr_org_unit_key IN (SELECT hr_org_unit_key FROM hr_org_unit_new);,SELECT COUNT(*) FROM (SELECT hr_org_unit_key FROM hr_org_unit MINUS SELECT hr_org_unit_key FROM hr_org_unit_new);,SELECT COUNT(*) FROM hr_org_unit WHERE hr_org_unit_key IN (SELECT hr_org_unit_key FROM hr_org_unit_new);,SELECT COUNT(*) FROM hr_org_unit WHERE hr_org_unit_key IN (SELECT hr_org_unit_key FROM hr_org_unit_new);,SELECT COUNT(*) FROM hr_org_unit WHERE hr_org_unit_key IN (SELECT hr_org_unit_key FROM hr_org_unit_new);,SELECT COUNT(*) FROM hr_org_unit WHERE hr_org_unit_key IN (SELECT hr_org_unit_key FROM hr_org_unit_new);
1,How many organisation units in human resources are new and not relabeled?,SELECT COUNT(*) FROM (SELECT hr_org_unit_key FROM hr_org_unit_new MINUS SELECT hr_org_unit_key FROM hr_org_unit);,"['HR_ORG_UNIT_NEW', 'HR_ORG_UNIT']",SELECT COUNT(*) FROM hr_org_unit_new WHERE hr_org_unit_key NOT IN (SELECT hr_org_unit_key FROM hr_org_unit);,SELECT COUNT(*) FROM hr_org_unit_new WHERE hr_org_unit_key NOT IN (SELECT hr_org_unit_key FROM hr_org_unit);,SELECT COUNT(*) FROM hr_org_unit_new WHERE hr_org_unit_key NOT IN (SELECT hr_org_unit_key FROM hr_org_unit);,SELECT COUNT(*) FROM hr_org_unit_new WHERE hr_org_unit_key NOT IN (SELECT hr_org_unit_key FROM hr_org_unit);,SELECT COUNT(*)\nFROM HR_ORG_UNIT_NEW\nWHERE WAREHOUSE_LOAD_DATE = (SELECT MAX(WAREHOUSE_LOAD_DATE) FROM HR_ORG_UNIT_NEW)\nAND HR_ORG_UNIT_LEVEL = 'NEW'\nAND HR_DEPARTMENT_NAME <> HR_DEPARTMENT_NAME_LONG,SELECT COUNT(*) \nFROM HR_ORG_UNIT_NEW \nWHERE HR_DEPARTMENT_CODE_OLD IS NULL,SELECT COUNT(*)\nFROM HR_ORG_UNIT_NEW\nWHERE HR_ORG_UNIT_LEVEL = 'NEW' AND HR_DEPARTMENT_NAME <> HR_DEPARTMENT_NAME_LONG,SELECT COUNT(*) FROM HR_ORG_UNIT_NEW WHERE HR_DEPARTMENT_NAME NOT LIKE '%relabeled%';,SELECT COUNT(*) FROM HR_ORG_UNIT_NEW WHERE HR_DEPARTMENT_CODE_OLD IS NULL;,SELECT COUNT(HR_ORG_UNIT_KEY) FROM HR_ORG_UNIT_NEW WHERE HR_ORG_UNIT_LEVEL = 'NEW' AND HR_DEPARTMENT_NAME != HR_DEPARTMENT_NAME_OLD;,SELECT COUNT(*) FROM hr_org_unit_new \nWHERE hr_org_unit_key NOT IN \n(SELECT hr_org_unit_key FROM hr_org_unit);,SELECT COUNT(*) FROM hr_org_unit_new \nWHERE hr_org_unit_key NOT IN \n(SELECT hr_org_unit_key FROM hr_org_unit);,SELECT COUNT(*) FROM hr_org_unit_new WHERE hr_org_unit_key NOT IN (SELECT hr_org_unit_key FROM hr_org_unit);,SELECT COUNT(*) FROM hr_org_unit_new WHERE hr_org_unit_key NOT IN (SELECT hr_org_unit_key FROM hr_org_unit);,SELECT COUNT(*) FROM hr_org_unit_new WHERE hr_org_unit_key NOT IN (SELECT hr_org_unit_key FROM hr_org_unit);,SELECT COUNT(*) FROM hr_org_unit_new WHERE hr_org_unit_key NOT IN (SELECT hr_org_unit_key FROM hr_org_unit);,SELECT COUNT(*) FROM hr_org_unit_new WHERE hr_org_unit_key NOT IN (SELECT hr_org_unit_key FROM hr_org_unit);,SELECT COUNT(*) FROM hr_org_unit_new WHERE hr_org_unit_key NOT IN (SELECT hr_org_unit_key FROM hr_org_unit);,SELECT COUNT(*) FROM hr_org_unit_new WHERE hr_org_unit_key NOT IN (SELECT hr_org_unit_key FROM hr_org_unit);
2,COUNT the number of courses offered by each department.,"SELECT OFFER_DEPT_CODE, COUNT(*) AS course_COUNT FROM SUBJECT_ENROLLABLE GROUP BY OFFER_DEPT_CODE;",['SUBJECT_ENROLLABLE'],"SELECT DEPARTMENT_NAME, COUNT(DISTINCT SUBJECT_ID) FROM COURSE_CATALOG_SUBJECT_OFFERED GROUP BY DEPARTMENT_NAME;","SELECT DEPARTMENT_NAME, COUNT(DISTINCT SUBJECT_ID) FROM COURSE_CATALOG_SUBJECT_OFFERED GROUP BY DEPARTMENT_NAME;","SELECT DEPARTMENT_NAME, COUNT(DISTINCT SUBJECT_ID) FROM COURSE_CATALOG_SUBJECT_OFFERED GROUP BY DEPARTMENT_NAME;","SELECT DEPARTMENT_NAME, COUNT(DISTINCT SUBJECT_ID) FROM COURSE_CATALOG_SUBJECT_OFFERED GROUP BY DEPARTMENT_NAME;","SELECT DEPARTMENT_CODE, COUNT(DISTINCT SUBJECT_ID) AS NUM_COURSES\nFROM COURSE_CATALOG_SUBJECT_OFFERED\nGROUP BY DEPARTMENT_CODE","SELECT DEPARTMENT_CODE, COUNT(DISTINCT SUBJECT_ID) AS NUM_COURSES\nFROM COURSE_CATALOG_SUBJECT_OFFERED\nGROUP BY DEPARTMENT_CODE","SELECT DEPARTMENT_CODE, COUNT(DISTINCT SUBJECT_ID) AS NUM_COURSES\nFROM COURSE_CATALOG_SUBJECT_OFFERED\nGROUP BY DEPARTMENT_CODE","SELECT DEPARTMENT_NAME, COUNT(DISTINCT SUBJECT_ID) FROM COURSE_CATALOG_SUBJECT_OFFERED GROUP BY DEPARTMENT_NAME;","SELECT DEPARTMENT_NAME, COUNT(DISTINCT SUBJECT_ID) FROM COURSE_CATALOG_SUBJECT_OFFERED GROUP BY DEPARTMENT_NAME;","SELECT DEPARTMENT_NAME, COUNT(DISTINCT SUBJECT_ID) FROM COURSE_CATALOG_SUBJECT_OFFERED GROUP BY DEPARTMENT_NAME;","SELECT department_name, COUNT(DISTINCT subject_id) FROM course_catalog_subject_offered GROUP BY department_name;","SELECT department_name, COUNT(DISTINCT subject_id) FROM course_catalog_subject_offered GROUP BY department_name;","SELECT DEPARTMENT_NAME, COUNT(DISTINCT SUBJECT_ID) FROM COURSE_CATALOG_SUBJECT_OFFERED GROUP BY DEPARTMENT_NAME;","SELECT department_name, COUNT(DISTINCT subject_id) FROM course_catalog_subject_offered GROUP BY department_name;","SELECT department_name, COUNT(DISTINCT subject_id) FROM course_catalog_subject_offered GROUP BY department_name;","SELECT department_name, COUNT(DISTINCT subject_id) FROM course_catalog_subject_offered GROUP BY department_name;","SELECT department_name, COUNT(DISTINCT subject_id) FROM course_catalog_subject_offered GROUP BY department_name;","SELECT department_name, COUNT(DISTINCT subject_id) FROM course_catalog_subject_offered GROUP BY department_name;","SELECT department_name, COUNT(DISTINCT subject_id) FROM course_catalog_subject_offered GROUP BY department_name;"
3,"What are the past, upcoming, and current courses?","SELECT DISTINCT subject_title, academic_terms.term_code, CASE WHEN term_start_date > SYSDATE THEN 'Upcoming' WHEN term_start_date <= SYSDATE AND term_end_date > SYSDATE THEN 'Current' ELSE 'Past' END AS term_status FROM SUBJECT_SUMMARY, academic_terms WHERE SUBJECT_SUMMARY.term_code = academic_terms.term_code;","['SUBJECT_SUMMARY', 'ACADEMIC_TERMS']","SELECT DISTINCT SUBJECT_TITLE, TERM_CODE FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE TERM_CODE < (SELECT MIN(TERM_CODE) FROM ACADEMIC_TERMS_ALL) UNION SELECT DISTINCT SUBJECT_TITLE, TERM_CODE FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE TERM_CODE > (SELECT MAX(TERM_CODE) FROM ACADEMIC_TERMS_ALL) UNION SELECT DISTINCT SUBJECT_TITLE, TERM_CODE FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE TERM_CODE = (SELECT MAX(TERM_CODE) FROM ACADEMIC_TERMS_ALL);","SELECT DISTINCT subject_title, term_code FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE term_code < (SELECT MIN(term_code) FROM ACADEMIC_TERMS_ALL WHERE term_start_date > SYSDATE) UNION SELECT DISTINCT subject_title, term_code FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE term_code = (SELECT MIN(term_code) FROM ACADEMIC_TERMS_ALL WHERE term_start_date > SYSDATE) UNION SELECT DISTINCT subject_title, term_code FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE term_code > (SELECT MIN(term_code) FROM ACADEMIC_TERMS_ALL WHERE term_start_date > SYSDATE);","SELECT DISTINCT subject_title, term_code FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE term_code < (SELECT MIN(term_code) FROM ACADEMIC_TERMS_ALL) OR term_code > (SELECT MAX(term_code) FROM ACADEMIC_TERMS_ALL) OR term_code = (SELECT MAX(term_code) FROM ACADEMIC_TERMS_ALL);","SELECT DISTINCT subject_title, term_code FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE term_code < (SELECT MIN(term_code) FROM ACADEMIC_TERMS_ALL) OR term_code > (SELECT MAX(term_code) FROM ACADEMIC_TERMS_ALL) OR term_code = (SELECT MAX(term_code) FROM ACADEMIC_TERMS_ALL);",SELECT DISTINCT SUBJECT_TITLE\nFROM SUBJECT_OFFERED\nWHERE TERM_CODE < '2023'\nUNION\nSELECT DISTINCT SUBJECT_TITLE\nFROM SUBJECT_OFFERED\nWHERE TERM_CODE = '2023'\nUNION\nSELECT DISTINCT SUBJECT_TITLE\nFROM SUBJECT_OFFERED\nWHERE TERM_CODE > '2023',SELECT DISTINCT SUBJECT_TITLE\nFROM SUBJECT_OFFERED\nWHERE TERM_CODE < '2023'\nUNION\nSELECT DISTINCT SUBJECT_TITLE\nFROM SUBJECT_OFFERED\nWHERE TERM_CODE = '2023'\nUNION\nSELECT DISTINCT SUBJECT_TITLE\nFROM SUBJECT_OFFERED\nWHERE TERM_CODE > '2023',SELECT DISTINCT SUBJECT_TITLE\nFROM SUBJECT_OFFERED\nWHERE TERM_CODE < '2023'\nUNION\nSELECT DISTINCT SUBJECT_TITLE\nFROM SUBJECT_OFFERED\nWHERE TERM_CODE = '2023'\nUNION\nSELECT DISTINCT SUBJECT_TITLE\nFROM SUBJECT_OFFERED\nWHERE TERM_CODE > '2023',"SELECT DISTINCT subject_title, term_code FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE term_code < (SELECT MIN(term_code) FROM ACADEMIC_TERMS_ALL) OR term_code > (SELECT MAX(term_code) FROM ACADEMIC_TERMS_ALL) OR term_code = (SELECT MAX(term_code) FROM ACADEMIC_TERMS_ALL);","SELECT DISTINCT subject_title, term_code FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE term_code < (SELECT MIN(term_code) FROM ACADEMIC_TERMS) OR term_code > (SELECT MAX(term_code) FROM ACADEMIC_TERMS) OR term_code = (SELECT MAX(term_code) FROM ACADEMIC_TERMS);","SELECT DISTINCT subject_title, term_code FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE term_code < (SELECT MIN(term_code) FROM ACADEMIC_TERMS) OR term_code > (SELECT MAX(term_code) FROM ACADEMIC_TERMS) OR term_code = (SELECT MAX(term_code) FROM ACADEMIC_TERMS);","SELECT DISTINCT subject_title, term_code FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE term_code < (SELECT MIN(term_code) FROM ACADEMIC_TERMS_ALL) UNION SELECT DISTINCT subject_title, term_code FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE term_code = (SELECT MIN(term_code) FROM ACADEMIC_TERMS_ALL) UNION SELECT DISTINCT subject_title, term_code FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE term_code > (SELECT MIN(term_code) FROM ACADEMIC_TERMS_ALL);","SELECT DISTINCT subject_title, term_code FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE term_code < (SELECT MIN(term_code) FROM ACADEMIC_TERMS_ALL WHERE term_start_date > SYSDATE) UNION SELECT DISTINCT subject_title, term_code FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE term_code = (SELECT MIN(term_code) FROM ACADEMIC_TERMS_ALL WHERE term_start_date > SYSDATE) UNION SELECT DISTINCT subject_title, term_code FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE term_code > (SELECT MIN(term_code) FROM ACADEMIC_TERMS_ALL WHERE term_start_date > SYSDATE);","SELECT DISTINCT subject_title, term_code FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE term_code IN (SELECT term_code FROM ACADEMIC_TERMS WHERE term_end_date < SYSDATE) OR term_code IN (SELECT term_code FROM ACADEMIC_TERMS WHERE term_start_date > SYSDATE) OR term_code IN (SELECT term_code FROM ACADEMIC_TERMS WHERE term_start_date <= SYSDATE AND term_end_date >= SYSDATE);","SELECT DISTINCT subject_title, term_code FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE term_code < (SELECT MIN(term_code) FROM ACADEMIC_TERMS_ALL) UNION SELECT DISTINCT subject_title, term_code FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE term_code = (SELECT MIN(term_code) FROM ACADEMIC_TERMS_ALL) UNION SELECT DISTINCT subject_title, term_code FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE term_code > (SELECT MIN(term_code) FROM ACADEMIC_TERMS_ALL);","SELECT DISTINCT subject_title, term_code FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE term_code < (SELECT MIN(term_code) FROM ACADEMIC_TERMS_ALL) UNION SELECT DISTINCT subject_title, term_code FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE term_code = (SELECT MIN(term_code) FROM ACADEMIC_TERMS_ALL) UNION SELECT DISTINCT subject_title, term_code FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE term_code > (SELECT MIN(term_code) FROM ACADEMIC_TERMS_ALL);","SELECT DISTINCT subject_title, term_code FROM course_catalog_subject_offered WHERE term_start_date < SYSDATE OR term_start_date > SYSDATE;","SELECT DISTINCT subject_title, term_code FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE term_code < (SELECT MIN(term_code) FROM ACADEMIC_TERMS_ALL) UNION SELECT DISTINCT subject_title, term_code FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE term_code = (SELECT MIN(term_code) FROM ACADEMIC_TERMS_ALL) UNION SELECT DISTINCT subject_title, term_code FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE term_code > (SELECT MIN(term_code) FROM ACADEMIC_TERMS_ALL);","SELECT DISTINCT subject_title, term_code, term_start_date\nFROM COURSE_CATALOG_SUBJECT_OFFERED, ACADEMIC_TERMS_ALL\nWHERE term_code = ACADEMIC_TERMS_ALL.TERM_CODE;","SELECT DISTINCT subject_title, term_code FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE term_start_date < SYSDATE OR term_start_date > SYSDATE;"
4,Which faculty has had the most location changes?,SELECT MAX(cnt) FROM (SELECT COUNT(*) AS cnt FROM WAREUSER.FCLT_BUILDING_ADDRESS_HIST GROUP BY fclt_building_key);,['FCLT_BUILDING_ADDRESS_HIST'],"SELECT * FROM (SELECT DISTINCT organization, COUNT(DISTINCT office_location) OVER (PARTITION BY organization) as num_locations FROM employee_directory) WHERE ROWNUM <= 1;","SELECT * FROM (SELECT DISTINCT full_name, COUNT(DISTINCT office_location) OVER (PARTITION BY full_name) as num_location_changes FROM employee_directory) WHERE num_location_changes = (SELECT MAX(num_location_changes) FROM (SELECT DISTINCT full_name, COUNT(DISTINCT office_location) OVER (PARTITION BY full_name) as num_location_changes FROM employee_directory));","SELECT * FROM (SELECT DISTINCT full_name, COUNT(DISTINCT office_location) OVER (PARTITION BY full_name) as num_location_changes FROM employee_directory) WHERE num_location_changes = (SELECT MAX(num_location_changes) FROM (SELECT DISTINCT full_name, COUNT(DISTINCT office_location) OVER (PARTITION BY full_name) as num_location_changes FROM employee_directory));","SELECT * FROM (SELECT DISTINCT full_name, COUNT(DISTINCT office_location) OVER (PARTITION BY full_name) as num_location_changes FROM employee_directory) WHERE num_location_changes = (SELECT MAX(num_location_changes) FROM (SELECT DISTINCT full_name, COUNT(DISTINCT office_location) OVER (PARTITION BY full_name) as num_location_changes FROM employee_directory));","SELECT HR_ORG_UNIT_TITLE\nFROM (\n SELECT HR_ORG_UNIT_TITLE, COUNT(DISTINCT OFFICE_LOCATION) AS location_changes\n FROM EMPLOYEE_DIRECTORY\n GROUP BY HR_ORG_UNIT_TITLE\n ORDER BY location_changes DESC\n)\nWHERE ROWNUM = 1",SELECT FULL_NAME\nFROM EMPLOYEE_DIRECTORY\nGROUP BY FULL_NAME\nORDER BY COUNT(DISTINCT OFFICE_LOCATION) DESC\nFETCH FIRST ROW ONLY,"SELECT ORGANIZATION, COUNT(DISTINCT OFFICE_LOCATION) AS LOCATION_COUNT\nFROM SE_PERSON\nGROUP BY ORGANIZATION\nORDER BY LOCATION_COUNT DESC\nFETCH FIRST ROW ONLY","SELECT FULL_NAME, OFFICE_LOCATION, COUNT(DISTINCT OFFICE_LOCATION) AS num_location_changes FROM EMPLOYEE_DIRECTORY GROUP BY FULL_NAME ORDER BY num_location_changes DESC FETCH FIRST ROW ONLY;","SELECT HR_ORG_UNIT_TITLE, COUNT(DISTINCT OFFICE_LOCATION) AS num_location_changes FROM EMPLOYEE_DIRECTORY GROUP BY HR_ORG_UNIT_TITLE ORDER BY num_location_changes DESC FETCH FIRST ROW ONLY;","SELECT HR_ORG_UNIT_TITLE, COUNT(DISTINCT OFFICE_LOCATION) AS num_location_changes FROM EMPLOYEE_DIRECTORY GROUP BY HR_ORG_UNIT_TITLE ORDER BY num_location_changes DESC FETCH FIRST ROW ONLY;","SELECT * FROM (SELECT DISTINCT full_name, COUNT(DISTINCT office_location) OVER (PARTITION BY full_name) as num_location_changes FROM employee_directory) ORDER BY num_location_changes DESC;","SELECT * FROM (SELECT DISTINCT full_name, COUNT(DISTINCT office_location) OVER (PARTITION BY full_name) as num_location_changes FROM employee_directory) ORDER BY num_location_changes DESC;","SELECT * FROM (SELECT DISTINCT full_name, COUNT(DISTINCT office_location) OVER (PARTITION BY full_name) as num_location_changes FROM employee_directory) ORDER BY num_location_changes DESC;","SELECT * FROM (SELECT DISTINCT full_name, COUNT(DISTINCT office_location) OVER (PARTITION BY full_name) as num_location_changes FROM employee_directory) ORDER BY num_location_changes DESC;","SELECT * FROM (SELECT DISTINCT full_name, COUNT(DISTINCT office_location) OVER (PARTITION BY full_name) as num_location_changes FROM employee_directory) ORDER BY num_location_changes DESC;","SELECT * FROM (SELECT DISTINCT full_name, COUNT(DISTINCT office_location) OVER (PARTITION BY full_name) as num_locations FROM employee_directory) ORDER BY num_locations DESC;","SELECT * FROM (SELECT DISTINCT full_name, COUNT(DISTINCT office_location) OVER (PARTITION BY full_name) as num_location_changes FROM employee_directory) ORDER BY num_location_changes DESC;","SELECT * FROM (SELECT DISTINCT full_name, COUNT(DISTINCT office_location) OVER (PARTITION BY full_name) as num_location_changes FROM employee_directory) ORDER BY num_location_changes DESC;","SELECT * FROM (SELECT DISTINCT full_name, COUNT(DISTINCT office_location) OVER (PARTITION BY full_name) as num_location_changes FROM employee_directory) ORDER BY num_location_changes DESC;"
5,What is the average number of courses a student can enroll in?,"SELECT AVG(cnt) FROM (SELECT COUNT(*) AS cnt FROM mit_student_directory, SUBJECT_SUMMARY WHERE DEPARTMENT_CODE = department GROUP BY full_name);","['MIT_STUDENT_DIRECTORY', 'SUBJECT_SUMMARY']",SELECT AVG(SUBJECT_ENROLLMENT_NUMBER) FROM SUBJECT_SUMMARY;,SELECT AVG(SUBJECT_ENROLLMENT_NUMBER) FROM SUBJECT_SUMMARY;,SELECT AVG(SUBJECT_ENROLLMENT_NUMBER) FROM SUBJECT_SUMMARY;,SELECT AVG(SUBJECT_ENROLLMENT_NUMBER) FROM SUBJECT_SUMMARY;,SELECT AVG(SUBJECT_ENROLLMENT_NUMBER) FROM SUBJECT_OFFERED,SELECT AVG(SUBJECT_ENROLLMENT_NUMBER) FROM SUBJECT_OFFERED,SELECT AVG(SUBJECT_ENROLLMENT_NUMBER) FROM SUBJECT_OFFERED,SELECT AVG(SUBJECT_ENROLLMENT_NUMBER) FROM SUBJECT_SUMMARY;,SELECT AVG(SUBJECT_ENROLLMENT_NUMBER) FROM SUBJECT_SUMMARY;,SELECT AVG(SUBJECT_ENROLLMENT_NUMBER) FROM SUBJECT_SUMMARY;,SELECT AVG(SUBJECT_ENROLLMENT_NUMBER) FROM SUBJECT_SUMMARY;,SELECT AVG(SUBJECT_ENROLLMENT_NUMBER) FROM SUBJECT_SUMMARY;,SELECT AVG(SUBJECT_ENROLLMENT_NUMBER) FROM SUBJECT_SUMMARY;,SELECT AVG(SUBJECT_ENROLLMENT_NUMBER) FROM SUBJECT_SUMMARY;,SELECT AVG(SUBJECT_ENROLLMENT_NUMBER) FROM SUBJECT_SUMMARY;,SELECT AVG(SUBJECT_ENROLLMENT_NUMBER) FROM SUBJECT_SUMMARY;,SELECT AVG(SUBJECT_ENROLLMENT_NUMBER) FROM SUBJECT_SUMMARY;,SELECT AVG(SUBJECT_ENROLLMENT_NUMBER) FROM SUBJECT_SUMMARY;,SELECT AVG(SUBJECT_ENROLLMENT_NUMBER) FROM SUBJECT_SUMMARY;

In [ ]:
new_row = {'question':"What kind of questions can I ask the data warehoues?", 'sql':["SELECT DISTINCT ST.STAR_NAME, REPLACE (REPLACE (ST.DESCRIPTION, CHR(13)), CHR(10), ' ') AS STAR_DESCRIPTION,  UV.VIEW_NAME, REPLACE (REPLACE (UV.DESCRIPTION, CHR(13)), CHR(10), ' ') AS VIEW_DESCRIPTION, F.FIELD_NAME, F.DEFINITION AS FIELD_DESCRIPTION  FROM STAR ST JOIN STAR_USER_VIEW SAV ON ST.STAR_ID = SAV.STAR_ID JOIN USER_VIEW UV ON SAV.VIEW_ID = UV.VIEW_ID JOIN FIELDS F ON F.TABLE_NAME = UV.VIEW_NAME ORDER BY 1, 3, 4;"],
       'tables':[], 'gpt_sql_nocontext':[],
       'gpt_sql_global_schema':[], 'expected_responses':[],
       'responses_gpt_nocontent':[], 'failures_gpt_nocontent':[],
       'accuracies_nocontext':[], 'precisions_nocontext':[], 'recalls_nocontext':[],
       'f1_scores_nocontext':[], 'responses_gpt_global_schema':[],
       'failures_gpt_global_schema':[], 'accuracies_global_schema':[],
       'precisions_global_schema':[], 'recalls_global_schema':[],
       'f1_scores_global_schema':[]}
new_df = pd.DataFrame([new_row])
df_q = pd.concat([df_q, new_df], ignore_index=True)

In [ ]:
sql = []
tables = []
gpt_sql_nocontext = []
gpt_sql_global_schema = []
expected_responses = []
for i in range(len(df_q)):
    sql.append(ast.literal_eval(df_q['sql'][i]))
    tables.append(ast.literal_eval(df_q['tables'][i]))
    gpt_sql_nocontext.append(ast.literal_eval(df_q['gpt_sql_nocontext'][i]))
    gpt_sql_global_schema.append(ast.literal_eval(df_q['gpt_sql_global_schema'][i]))
    #expected_responses.append(ast.literal_eval(df_q['expected_responses'][i]))
    #responses_gpt_nocontent.append(ast.literal_eval(df_q['responses_gpt_nocontent'][i]))
    #responses_gpt_global_schema.append(ast.literal_eval(df_q['responses_gpt_global_schema'][i]))
    #tables_referred_by_gpt_sql_global_schema.append(ast.literal_eval(df_q['tables_referred_by_gpt_sql_global_schema'][i]))
    #tables_referred_by_gpt_sql_nocontext.append(ast.literal_eval(df_q['tables_referred_by_gpt_sql_nocontext'][i]))
    #sql_outputsizes.append(ast.literal_eval(df_q['sql_outputsizes'][i]))
df_q['sql'] = sql
df_q['tables'] = tables
df_q['gpt_sql_global_schema'] = gpt_sql_global_schema
df_q['gpt_sql_nocontext'] = gpt_sql_nocontext
#df_q['sql_outputsizes'] = sql_outputsizes

In [ ]:
sql = []
tables = []
gpt_sql_global_schema = []
gpt_sql_nocontext = []
question = []
gpt_global_schema = []
for i in range(len(df_q)):
    if i == 0 or df_q['question'][i] != df_q['question'][i-1]:
        if gpt_global_schema != None and i != 0:
            gpt_sql_global_schema.append(gpt_global_schema)
        gpt_global_schema = []
        sql.append(df_q['sql'][i])
        tables.append(df_q['tables'][i])
        gpt_global_schema.append(df_q['gpt_sql_global_schema'][i])
        gpt_sql_nocontext.append(df_q['gpt_sql_nocontext'][i])
        question.append(df_q['question'][i])
    else:
        gpt_global_schema.append(df_q['gpt_sql_global_schema'][i])
gpt_sql_global_schema.append(gpt_global_schema)
df_temp = pd.DataFrame(data={"question":question, "sql":sql, "tables":tables, "gpt_sql_global_schema":gpt_sql_global_schema, "gpt_sql_nocontext":gpt_sql_nocontext})

In [ ]:
#pd.set_option('display.max_rows', None)
pd.set_option('display.max_columns', None)
pd.set_option('display.max_colwidth', None)
df_q

# Generated for all answers the actual output

In [21]:

def execute_query(query, tables):
  connection = cx_Oracle.connect(user=config['username'], password=config['password'], dsn=config['dsn'])

  if 'LIMIT' in query:
    contains_limit = True
    limit_number = re.search(r'\bLIMIT\s+(\d+)', query)
    limit_value = int(limit_number.group(1))
    query = query[:query.index('LIMIT ')]
    query = 'SELECT * FROM (' + query + ') WHERE ROWNUM <=' + str(limit_value)

  # Set input type handler to cx_Oracle.STRING
  connection.inputtypehandler = cx_Oracle.STRING
  # Create a cursor object
  cursor = connection.cursor()

  # Set DEFINE OFF
  cursor.setoutputsize(0)

  # Execute SQL queries
  try:
    cursor.execute(query)
    # Fetch the results
    rows = cursor.fetchall()
  except Exception as e1:
    # Preprocessing wueries
    for table in tables:
      table_mod = ' WAREUSER.' + table
      query = query.replace(' ' + table, table_mod)
      print(query)
    try:
      cursor.execute(query)
      # Fetch the results
      rows = cursor.fetchall()
    except Exception as e2:
      # Print the error message to stderr
      print("An error occurred:", str(e1))
      print("An error occurred:", str(e2))
      return None
  cursor.close()
  connection.close()
  return rows

## Start with the correct answers

In [22]:

gold_answers = []
failures = []
for q in df_q['sql']:
    print(q)
    try:
        gold_answers.append(execute_query(q[:-1], [v.upper() for v in Parser(q).tables]))
        failures.append(None)
    except Exception as e:
        gold_answers.append(None)
        failures.append(str(e))
    print(failures)
    print('------')

SELECT COUNT(*) FROM (SELECT hr_org_unit_key FROM hr_org_unit_new INTERSECT SELECT hr_org_unit_key FROM hr_org_unit);
[None]
------
SELECT COUNT(*) FROM (SELECT hr_org_unit_key FROM hr_org_unit_new MINUS SELECT hr_org_unit_key FROM hr_org_unit);
[None, None]
------
SELECT OFFER_DEPT_CODE, COUNT(*) AS course_COUNT FROM SUBJECT_ENROLLABLE GROUP BY OFFER_DEPT_CODE;
[None, None, None]
------
SELECT DISTINCT subject_title, academic_terms.term_code, CASE WHEN term_start_date > SYSDATE THEN 'Upcoming' WHEN term_start_date <= SYSDATE AND term_end_date > SYSDATE THEN 'Current' ELSE 'Past' END AS term_status FROM SUBJECT_SUMMARY, academic_terms WHERE SUBJECT_SUMMARY.term_code = academic_terms.term_code;
[None, None, None, None]
------
SELECT MAX(cnt) FROM (SELECT COUNT(*) AS cnt FROM WAREUSER.FCLT_BUILDING_ADDRESS_HIST GROUP BY fclt_building_key);
[None, None, None, None, None]
------
SELECT AVG(cnt) FROM (SELECT COUNT(*) AS cnt FROM mit_student_directory, SUBJECT_SUMMARY WHERE DEPARTMENT_CODE = department GROUP BY full_name);
[None, None, None, None, None, None]
------
SELECT DISTINCT empl.full_name FROM mit_student_directory mit, employee_directory empl WHERE empl.full_name = mit.full_name;
[None, None, None, None, None, None, None]
------
SELECT DISTINCT subject_title, term_end_date - term_start_date FROM (SELECT MIN(term_end_date - term_start_date) AS min_duration FROM academic_terms), academic_terms, SUBJECT_SUMMARY WHERE SUBJECT_SUMMARY.term_code = ACADEMIC_TERMS.TERM_CODE AND term_end_date - term_start_date = min_duration;
[None, None, None, None, None, None, None, None]
------
SELECT fb.building_name, fba.* FROM wareuser.fac_building fb INNER JOIN wareuser.fac_building_address fba ON fb.FAC_BUILDING_KEY = fba.building_key;
[None, None, None, None, None, None, None, None, None]
------
SELECT COUNT(*) FROM mit_student_directory;
[None, None, None, None, None, None, None, None, None, None]
------
SELECT DISTINCT library_material_status FROM library_material_status UNION SELECT DISTINCT tip_material_status FROM tip_material_status;
[None, None, None, None, None, None, None, None, None, None, None]
------
SELECT DISTINCT city_name FROM zip_usa UNION SELECT DISTINCT city_name FROM zip_canada;
[None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT AVG(offered_subject_nr) FROM (SELECT DISTINCT DEPARTMENT_NAME, COUNT(*) OVER (PARTITION BY DEPARTMENT_NAME) AS offered_subject_nr FROM SUBJECT_SUMMARY) WHERE offered_subject_nr >= 100;
[None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT DISTINCT BUILDING_NAME_LONG, COUNT(*) OVER (PARTITION BY BUILDING_NAME_LONG) FROM fclt_rooms, fclt_building WHERE fclt_rooms.fclt_building_key = fclt_building.fclt_building_key;
[None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT DISTINCT BUILDING_NAME_LONG, num_spaces FROM (SELECT BUILDING_KEY, COUNT(*) OVER (PARTITION BY BUILDING_KEY) as num_spaces FROM SPACE_DETAIL) sd, FAC_BUILDING WHERE FAC_BUILDING.FAC_BUILDING_KEY = sd.BUILDING_KEY;
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT SUBJECT_TITLE, TERM_START_DATE FROM (SELECT * FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE SUBJECT_DESCRIPTION LIKE '%regular%' OR SUBJECT_DESCRIPTION LIKE '%initial%') COURSE_CATALOG_SUBJECT_OFFERED, ACADEMIC_TERMS_ALL WHERE COURSE_CATALOG_SUBJECT_OFFERED.EFFECTIVE_TERM_CODE = ACADEMIC_TERMS_ALL.TERM_CODE;
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT * FROM (SELECT DISTINCT DEPARTMENT_NAME, COUNT(*) OVER (PARTITION BY DEPARTMENT_NAME) AS numcourses FROM SUBJECT_SUMMARY ORDER BY numcourses DESC) WHERE rownum <= 3;
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT Room, floor, fac_building_address.* FROM (SELECT office_location FROM employee_directory WHERE full_name = 'Stonebraker, Michael'), fac_rooms, fac_building_address WHERE office_location = fac_room_key AND fac_rooms.building_key = fac_building_address.BUILDING_KEY;
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT DISTINCT MIT_ID, employee.* FROM (SELECT full_name, COUNT(*) OVER (PARTITION BY full_name) AS cnt FROM employee_directory) employee, employee_directory WHERE employee.full_name = employee_directory.full_name AND cnt >= 2 ORDER BY employee.full_name;
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT DISTINCT subject_title FROM  SUBJECT_SUMMARY WHERE department_name = 'Electrical Eng & Computer Sci';
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT department_name, COUNT(*) OVER (PARTITION BY department_name) FROM mit_student_directory;
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT DISTINCT IAP_CATEGORY_NAME FROM IAP_SUBJECT_CATEGORY;
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT COUNT(*) FROM ((SELECT zip_code, city_name FROM zip_usa) UNION (SELECT postal_code, city_name FROM zip_canada)) WHERE zip_code = '00501';
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT COUNT(DISTINCT MIT_ID) FROM employee_directory;
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT DISTINCT school_name, COUNT(department_name) OVER (PARTITION BY school_name) FROM student_department;
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT full_name, krb_name, email_address FROM employee_directory WHERE first_name = 'Michael';
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT * FROM (SELECT * FROM (SELECT DISTINCT school_name, COUNT(department_name) OVER (PARTITION BY school_name) AS cnt FROM student_department) ORDER BY cnt DESC) WHERE rownum <= 1;
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT * FROM SUBJECT_SUMMARY, (SELECT MAX(total_units) AS maxi FROM SUBJECT_SUMMARY) WHERE total_units = maxi;
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT * FROM top_level_domain WHERE top_level_domain_description = 'Brazil';
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT DISTINCT * FROM (SELECT subject_title, department_name, term_start_date, term_end_date - term_start_date AS duration FROM SUBJECT_SUMMARY a, ACADEMIC_TERMS b WHERE a.term_code = b.term_code AND department_name = 'Electrical Eng & Computer Sci') WHERE duration <= 100;
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT DISTINCT subject_title, form_type, num_enrolled_students FROM subject_offered WHERE num_enrolled_students > 800;
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT * FROM (SELECT * FROM (SELECT c.title, c.isbn, COUNT(*) OVER (PARTITION BY c.title, c.isbn) AS cnt FROM tip_detail a, tip_subject_offered b, tip_material c WHERE is_no_course_material LIKE 'N' AND a.tip_subject_offered_key = b.tip_subject_offered_key AND a.tip_material_key = c.tip_material_key) ORDER BY cnt DESC) WHERE ROWNUM <= 1;
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT DISTINCT activity_title, session_location, term_start_date, person_name AS Leader FROM iap_subject_detail a, iap_subject_person b, academic_terms_all c, iap_subject_session d WHERE a.iap_subject_person_key = b.iap_subject_person_key AND a.iap_subject_session_key = d.iap_subject_session_key AND c.term_code = a.term_code AND b.person_role = 'Activity leader';
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT DISTINCT title, isbn, new_shelf_price FROM tip_material ORDER BY new_shelf_price ASC;
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT subject_title FROM COURSE_CATALOG_SUBJECT_OFFERED c, ACADEMIC_TERMS d, (SELECT MIN(academic_year) AS mini FROM COURSE_CATALOG_SUBJECT_OFFERED) WHERE c.effective_term_code = d.term_code AND d.academic_year = mini;
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT COUNT(*) FROM (SELECT DISTINCT department_name, COUNT(*) OVER (PARTITION BY department_name) AS cnt FROM mit_student_directory) WHERE cnt <= 300;
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT * FROM (SELECT DISTINCT department_name, COUNT(DISTINCT payroll_rank) OVER (PARTITION BY department_name) AS cnt FROM wareuser.se_person a, employee_directory b WHERE a.mit_id = b.mit_id) a, (SELECT MAX(cnt) AS m FROM ((SELECT DISTINCT department_name, COUNT(DISTINCT payroll_rank) OVER (PARTITION BY department_name) AS cnt FROM wareuser.se_person a, employee_directory b WHERE a.mit_id = b.mit_id)) ) b WHERE a.cnt = b.m;
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT DISTINCT full_name, email_address FROM (SELECT DISTINCT first_name, full_name, email_address FROM mit_student_directory union SELECT DISTINCT first_name, full_name, email_address FROM employee_directory) WHERE first_name = 'Carole';
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT DISTINCT payroll_rank FROM wareuser.se_person;
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT * FROM (SELECT DISTINCT BUILDING_NAME_LONG, year_built, COUNT(*) OVER (PARTITION BY BUILDING_NAME_LONG, year_built) as num_employees FROM ( SELECT * FROM (SELECT DISTINCT FCLT_BUILDING_KEY, BUILDING_NAME_LONG, extract(year FROM TO_DATE(date_built, 'MM/DD/YYYY')) as year_built FROM wareuser.fclt_building_hist) WHERE year_built <= 1950) a, fclt_rooms, employee_directory WHERE OFFICE_LOCATION = BUILDING_ROOM and fclt_rooms.FCLT_BUILDING_KEY = a.FCLT_BUILDING_KEY) WHERE num_employees >100;
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT COUNT(DISTINCT subject_id) FROM cis_course_catalog;
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT COUNT(DISTINCT subject_id) FROM subject_offered WHERE num_enrolled_students > 100;
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT DISTINCT mit_id, full_name, a.office_location, num_employees FROM DRUPAL_EMPLOYEE_DIRECTORY a, (SELECT office_location, COUNT(mit_id) OVER(PARTITION BY office_location) as num_employees FROM (SELECT mit_id, office_location FROM DRUPAL_EMPLOYEE_DIRECTORY union SELECT full_name, office_location FROM mit_student_directory)) b WHERE b.num_employees>= 2 and b.office_location = a.office_location;
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT DISTINCT CLUSTER_LIST, COUNT(subject_id) OVER (PARTITION BY CLUSTER_LIST) FROM SUBJECT_SUMMARY, academic_terms_all WHERE extract(month FROM term_start_date) = 3;
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT DISTINCT instructor_name,  subject_title, COUNT(catalog_isbn) OVER (PARTITION BY instructor_name, subject_title) FROM LIBRARY_COURSE_INSTRUCTOR, LIBRARY_RESERVE_MATRL_DETAIL, LIBRARY_SUBJECT_OFFERED, LIBRARY_RESERVE_CATALOG WHERE LIBRARY_COURSE_INSTRUCTOR.LIBRARY_COURSE_INSTRUCTOR_KEY = LIBRARY_RESERVE_MATRL_DETAIL.LIBRARY_COURSE_INSTRUCTOR_KEY and LIBRARY_RESERVE_CATALOG.LIBRARY_RESERVE_CATALOG_KEY = LIBRARY_RESERVE_MATRL_DETAIL.LIBRARY_RESERVE_CATALOG_KEY and LIBRARY_SUBJECT_OFFERED.LIBRARY_SUBJECT_OFFERED_KEY = LIBRARY_RESERVE_MATRL_DETAIL.LIBRARY_SUBJECT_OFFERED_KEY;
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT * FROM( SELECT * FROM( SELECT DISTINCT building_name, num_students FROM (SELECT fclt_building_key, COUNT(full_name) OVER (PARTITION BY fclt_building_key) as num_students FROM fclt_rooms, mit_student_directory WHERE office_location=BUILDING_ROOM) a, fclt_building WHERE a.fclt_building_key = fclt_building.fclt_building_key) ORDER BY num_students DESC)WHERE ROWNUM <= 1;
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT * FROM(SELECT DISTINCT building_name, num_rooms/num_floors FROM( SELECT fclt_building_key, COUNT(DISTINCT fclt_floor_key) OVER (PARTITION BY fclt_building_key) as num_floors, COUNT(DISTINCT fclt_room_key) OVER (PARTITION BY fclt_building_key) as num_rooms FROM fclt_rooms) a, fclt_building WHERE a.fclt_building_key =  fclt_building.fclt_building_key ORDER BY num_rooms/num_floors DESC) WHERE ROWNUM <= 1;
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT * FROM(SELECT DISTINCT major_use, num_rooms FROM (SELECT fclt_major_use_key, COUNT(fclt_room_key) OVER (PARTITION BY fclt_major_use_key) as num_rooms FROM fclt_rooms) a, fclt_major_use WHERE a.fclt_major_use_key = fclt_major_use.fclt_major_use_key ORDER BY num_rooms DESC) WHERE rownum <= 1;
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT * FROM (SELECT DISTINCT person_name, activity_title, COUNT(IAP_subject_session_key) OVER (PARTITION BY person_name,activity_title) as num_session FROM iap_subject_detail, iap_subject_person WHERE IAP_SUBJECT_PERSON.IAP_SUBJECT_PERSON_KEY = IAP_SUBJECT_DETAIL.IAP_SUBJECT_PERSON_KEY) ORDER BY num_session DESC;
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT * FROM(SELECT DISTINCT building_key, sum(room_square_footage) OVER (PARTITION BY building_key) as total_square_footage FROM space_detail) ORDER BY total_square_footage DESC;
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------

In [23]:
df_q['expected_responses'] = gold_answers
if not all(f is None for f in failures):
    print("Please check errors!")

## Continue with the answers from gpt with no additional information

In [ ]:
gold_answers = []
failures = []
for q in df_q['gpt_sql_nocontext']:
    try:
        if q[len(q)-1]==';':
            q = q[:-1]
        print(q)
        gold_answers.append(execute_query(q, [v.upper() for v in Parser(q).tables]))
        failures.append(None)
    except Exception as e:
        gold_answers.append(None)
        failures.append(str(e))

In [ ]:
df_q['responses_gpt_nocontent'] = gold_answers
df_q['failures_gpt_nocontent'] = failures

## Continue with the answers from gpt with schema information

In [18]:
df_q.keys()

Index(['question', 'sql', 'tables', 'gpt_sql_q_a_log_20_1',
       'gpt_sql_q_a_log_20_1.0', 'gpt_sql_q_a_log_20_1.1',
       'gpt_sql_q_a_log_20_1.2', 'gpt_sql_q_a_log_0_1.0',
       'gpt_sql_q_a_log_0_1.1', 'gpt_sql_q_a_log_0_1.2',
       'gpt_sql_q_a_log_10_1.0', 'gpt_sql_q_a_log_10_1.1',
       'gpt_sql_q_a_log_10_1.2', 'gpt_sql_q_a_log_30_1.0',
       'gpt_sql_q_a_log_30_1.1', 'gpt_sql_q_a_log_30_1.2',
       'gpt_sql_q_a_log_40_1.0', 'gpt_sql_q_a_log_40_1.1',
       'gpt_sql_q_a_log_40_1.2', 'gpt_sql_q_a_log_50_1.0',
       'gpt_sql_q_a_log_50_1.1', 'gpt_sql_q_a_log_50_1.2',
       'gpt_sql_q_a_log_0_1', 'gpt_sql_q_a_log_10_1', 'gpt_sql_q_a_log_30_1',
       'gpt_sql_q_a_log_40_1', 'gpt_sql_q_a_log_50_1'],
      dtype='object')

In [ ]:
gold_answers = []
failures = []
for q in df_q['gpt_sql_global_schema']:
    try:
        if q[len(q)-1]==';':
            q = q[:-1]
        print(q)
        gold_answers.append(execute_query(q, [v.upper() for v in Parser(q).tables]))
        failures.append(None)
    except Exception as e:
        gold_answers.append(None)
        failures.append(str(e))
    print(failures)
    print('------')

In [ ]:
df_q['responses_gpt_global_schema'] = gold_answers
df_q['failures_gpt_global_schema'] = failures

## Continue with the answers from gpt with schema information and query logs

In [24]:
for j in range(0,60,10):
    gold_answers = []
    failures = []
    for q in df_q['gpt_sql_q_a_log_{0}_1'.format(j)]:
        try:
            if q[len(q)-1]==';':
                q = q[:-1]
            print(q)
            gold_answers.append(execute_query(q, [v.upper() for v in Parser(q).tables]))
            failures.append(None)
        except Exception as e:
            gold_answers.append(None)
            failures.append(str(e))
        print(failures)
        print('------')
    df_q['responses_gpt_sql_q_a_log_{0}_1'.format(j)] = gold_answers

SELECT COUNT(DISTINCT HR_ORG_UNIT_KEY) FROM HR_ORG_UNIT_NEW WHERE HR_DEPARTMENT_NAME <> HR_DEPARTMENT_NAME_LONG
[None]
------
SELECT COUNT(*)
FROM HR_ORG_UNIT_NEW
WHERE HR_ORG_UNIT_LEVEL = 'NEW' AND HR_DEPARTMENT_NAME <> HR_DEPARTMENT_NAME_LONG
[None, None]
------
SELECT DEPARTMENT_CODE, COUNT(DISTINCT SUBJECT_ID) AS NUM_COURSES
FROM COURSE_CATALOG_SUBJECT_OFFERED
GROUP BY DEPARTMENT_CODE
[None, None, None]
------
SELECT DISTINCT SUBJECT_TITLE
FROM SUBJECT_OFFERED
WHERE TERM_CODE < '2023'
UNION
SELECT DISTINCT SUBJECT_TITLE
FROM SUBJECT_OFFERED
WHERE TERM_CODE = '2023'
UNION
SELECT DISTINCT SUBJECT_TITLE
FROM SUBJECT_OFFERED
WHERE TERM_CODE > '2023'
[None, None, None, None]
------
SELECT ORGANIZATION, COUNT(DISTINCT OFFICE_LOCATION) AS LOCATION_COUNT
FROM SE_PERSON
GROUP BY ORGANIZATION
ORDER BY LOCATION_COUNT DESC
FETCH FIRST ROW ONLY
SELECT ORGANIZATION, COUNT(DISTINCT OFFICE_LOCATION) AS LOCATION_COUNT
FROM WAREUSER.SE_PERSON
GROUP BY ORGANIZATION
ORDER BY LOCATION_COUNT DESC
FETCH FIRST ROW ONLY
An error occurred: ORA-00933: SQL command not properly ended
An error occurred: ORA-00933: SQL command not properly ended
[None, None, None, None, None]
------
SELECT AVG(SUBJECT_ENROLLMENT_NUMBER) FROM SUBJECT_OFFERED
[None, None, None, None, None, None]
------
SELECT DISTINCT FIRST_NAME, LAST_NAME
FROM MIT_STUDENT_DIRECTORY
WHERE DEPARTMENT = 'MIT'
[None, None, None, None, None, None, None]
------
SELECT MIN(TOTAL_UNITS) FROM COURSE_CATALOG_SUBJECT_OFFERED WHERE TERM_CODE = 'THIS_SEMESTER'
[None, None, None, None, None, None, None, None]
------
SELECT BUILDING_NAME, STREET_NUMBER, STREET_NAME, CITY, STATE, POSTAL_CODE
FROM FCLT_BUILDING_ADDRESS_HIST
SELECT BUILDING_NAME, STREET_NUMBER, STREET_NAME, CITY, STATE, POSTAL_CODE
FROM WAREUSER.FCLT_BUILDING_ADDRESS_HIST
An error occurred: ORA-00942: table or view does not exist
An error occurred: ORA-00904: "BUILDING_NAME": invalid identifier
[None, None, None, None, None, None, None, None, None]
------
SELECT COUNT(*) FROM MIT_STUDENT_DIRECTORY
[None, None, None, None, None, None, None, None, None, None]
------
SELECT DISTINCT TIP_MATERIAL_STATUS
FROM TIP_MATERIAL_STATUS
[None, None, None, None, None, None, None, None, None, None, None]
------
SELECT DISTINCT CITY FROM EMPLOYEE_DIRECTORY
SELECT DISTINCT CITY FROM WAREUSER.EMPLOYEE_DIRECTORY
An error occurred: ORA-00904: "CITY": invalid identifier
An error occurred: ORA-00904: "CITY": invalid identifier
[None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT AVG(num_courses)
FROM (
    SELECT COUNT(*) AS num_courses
    FROM COURSE_CATALOG_SUBJECT_OFFERED
    GROUP BY DEPARTMENT_CODE
    HAVING COUNT(*) > 100
)
[None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT COUNT(*) FROM FAC_ROOMS WHERE BUILDING_KEY = 'building_key'
[None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT BUILDING_KEY, COUNT(SPACE_UNIT_KEY)
FROM SPACE_DETAIL
GROUP BY BUILDING_KEY
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT TERM_START_DATE
FROM ACADEMIC_TERMS
WHERE TERM_DESCRIPTION IN ('Regular', 'Initial')
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT DEPARTMENT_NAME
FROM COURSE_CATALOG_SUBJECT_OFFERED
GROUP BY DEPARTMENT_NAME
ORDER BY COUNT(*) DESC
FETCH FIRST 3 ROWS ONLY
SELECT DEPARTMENT_NAME
FROM WAREUSER.COURSE_CATALOG_SUBJECT_OFFERED
GROUP BY DEPARTMENT_NAME
ORDER BY COUNT(*) DESC
FETCH FIRST 3 ROWS ONLY
An error occurred: ORA-00933: SQL command not properly ended
An error occurred: ORA-00933: SQL command not properly ended
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT OFFICE_LOCATION
FROM EMPLOYEE_DIRECTORY
WHERE FULL_NAME = 'Michael Stonebraker'
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT DISTINCT FULL_NAME
FROM EMPLOYEE_DIRECTORY
GROUP BY FULL_NAME
HAVING COUNT(FULL_NAME) > 1
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT DISTINCT SUBJECT_TITLE
FROM SUBJECT_ENROLLABLE
WHERE OFFER_SCHOOL_CODE = 'CSCI'
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT DEPARTMENT_NAME, COUNT(*) AS NUM_STUDENTS
FROM MIT_STUDENT_DIRECTORY
GROUP BY DEPARTMENT_NAME
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT DISTINCT IAP_CATEGORY_NAME FROM IAP_SUBJECT_CATEGORY
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT CITY
FROM ZIP_USA
WHERE ZIP_CODE = '501'
SELECT CITY
FROM WAREUSER.ZIP_USA
WHERE ZIP_CODE = '501'
An error occurred: ORA-00904: "CITY": invalid identifier
An error occurred: ORA-00904: "CITY": invalid identifier
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT COUNT(*) FROM EMPLOYEE_DIRECTORY
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT SCHOOL_NAME, COUNT(DISTINCT DEPARTMENT_CODE) AS NUM_DEPARTMENTS
FROM STUDENT_DEPARTMENT
GROUP BY SCHOOL_NAME
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT FULL_NAME, KRB_NAME, EMAIL_ADDRESS
FROM EMPLOYEE_DIRECTORY
WHERE FULL_NAME LIKE '%Michael%'
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT SCHOOL_NAME
FROM STUDENT_DEPARTMENT
GROUP BY SCHOOL_NAME
ORDER BY COUNT(DISTINCT DEPARTMENT_CODE) DESC
FETCH FIRST ROW ONLY
SELECT SCHOOL_NAME
FROM WAREUSER.STUDENT_DEPARTMENT
GROUP BY SCHOOL_NAME
ORDER BY COUNT(DISTINCT DEPARTMENT_CODE) DESC
FETCH FIRST ROW ONLY
An error occurred: ORA-00933: SQL command not properly ended
An error occurred: ORA-00933: SQL command not properly ended
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT SUBJECT_TITLE
FROM COURSE_CATALOG_SUBJECT_OFFERED
WHERE TOTAL_UNITS = (SELECT MAX(TOTAL_UNITS) FROM COURSE_CATALOG_SUBJECT_OFFERED)
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT TOP_LEVEL_DOMAIN
FROM TOP_LEVEL_DOMAIN
WHERE TOP_LEVEL_DOMAIN = 'BR'
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT DISTINCT TERM_START_DATE
FROM ACADEMIC_TERMS
WHERE TERM_CODE IN (
    SELECT DISTINCT TERM_CODE
    FROM COURSE_CATALOG_SUBJECT_OFFERED
    WHERE SUBJECT_ID = '6'
    AND TERM_DURATION < 100
)
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT SUBJECT_TITLE, MEET_TIME, MEET_PLACE
FROM COURSE_CATALOG_SUBJECT_OFFERED
WHERE SUBJECT_ENROLLMENT_NUMBER > 800
SELECT SUBJECT_TITLE, MEET_TIME, MEET_PLACE
FROM WAREUSER.COURSE_CATALOG_SUBJECT_OFFERED
WHERE SUBJECT_ENROLLMENT_NUMBER > 800
An error occurred: ORA-00904: "SUBJECT_ENROLLMENT_NUMBER": invalid identifier
An error occurred: ORA-00904: "SUBJECT_ENROLLMENT_NUMBER": invalid identifier
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT TITLE
FROM TIP_MATERIAL
WHERE RECORD_COUNT = (SELECT MAX(RECORD_COUNT) FROM TIP_MATERIAL)
SELECT TITLE
FROM WAREUSER.TIP_MATERIAL
WHERE RECORD_COUNT = (SELECT MAX(RECORD_COUNT) FROM WAREUSER.TIP_MATERIAL)
An error occurred: ORA-00904: "RECORD_COUNT": invalid identifier
An error occurred: ORA-00904: "RECORD_COUNT": invalid identifier
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT ACTIVITY_TITLE, SESSION_LOCATION, RESPONSIBLE_FACULTY_NAME
FROM IAP_SUBJECT_DETAIL
WHERE ENROLLMENT_TYPE = 'Independent'
ORDER BY SESSION_START_TIME
SELECT ACTIVITY_TITLE, SESSION_LOCATION, RESPONSIBLE_FACULTY_NAME
FROM WAREUSER.IAP_SUBJECT_DETAIL
WHERE ENROLLMENT_TYPE = 'Independent'
ORDER BY SESSION_START_TIME
An error occurred: ORA-00904: "SESSION_START_TIME": invalid identifier
An error occurred: ORA-00904: "SESSION_START_TIME": invalid identifier
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT TITLE, ISBN
FROM TIP_MATERIAL
ORDER BY NEW_SHELF_PRICE ASC
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT SUBJECT_ID, SUBJECT_TITLE
FROM SUBJECT_OFFERED
WHERE WAREHOUSE_LOAD_DATE = (SELECT MIN(WAREHOUSE_LOAD_DATE) FROM SUBJECT_OFFERED)
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT COUNT(*)
FROM (
    SELECT DEPARTMENT_NAME, COUNT(*) AS TOTAL_STUDENTS
    FROM MIT_STUDENT_DIRECTORY
    GROUP BY DEPARTMENT_NAME
    HAVING COUNT(*) < 300
)
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT DEPARTMENT_NAME
FROM (
    SELECT DEPARTMENT_NAME, COUNT(DISTINCT PAYROLL_RANK) AS RANK_COUNT
    FROM SE_PERSON
    GROUP BY DEPARTMENT_NAME
    ORDER BY RANK_COUNT DESC
)
WHERE ROWNUM = 1
SELECT DEPARTMENT_NAME
FROM (
    SELECT DEPARTMENT_NAME, COUNT(DISTINCT PAYROLL_RANK) AS RANK_COUNT
    FROM WAREUSER.SE_PERSON
    GROUP BY DEPARTMENT_NAME
    ORDER BY RANK_COUNT DESC
)
WHERE ROWNUM = 1
An error occurred: ORA-00942: table or view does not exist
An error occurred: ORA-00904: "DEPARTMENT_NAME": invalid identifier
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT EMAIL_ADDRESS, FULL_NAME
FROM MIT_STUDENT_DIRECTORY
WHERE FIRST_NAME = 'Carole'
UNION
SELECT EMAIL_ADDRESS, FULL_NAME
FROM EMPLOYEE_DIRECTORY
WHERE FIRST_NAME = 'Carole'
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT DISTINCT PAYROLL_RANK FROM SE_PERSON
SELECT DISTINCT PAYROLL_RANK FROM WAREUSER.SE_PERSON
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT DISTINCT b.BUILDING_NAME
FROM FAC_BUILDING b
JOIN EMPLOYEE_DIRECTORY e ON b.FCLT_BUILDING_KEY = e.OFFICE_LOCATION
WHERE b.DATE_BUILT < '1950' AND e.PRIMARY_TITLE = 'Employee'
GROUP BY b.BUILDING_NAME
HAVING COUNT(DISTINCT e.MIT_ID) > 100
SELECT DISTINCT b.BUILDING_NAME
FROM WAREUSER.FAC_BUILDING b
JOIN EMPLOYEE_DIRECTORY e ON b.FCLT_BUILDING_KEY = e.OFFICE_LOCATION
WHERE b.DATE_BUILT < '1950' AND e.PRIMARY_TITLE = 'Employee'
GROUP BY b.BUILDING_NAME
HAVING COUNT(DISTINCT e.MIT_ID) > 100
SELECT DISTINCT b.BUILDING_NAME
FROM WAREUSER.FAC_BUILDING b
JOIN WAREUSER.EMPLOYEE_DIRECTORY e ON b.FCLT_BUILDING_KEY = e.OFFICE_LOCATION
WHERE b.DATE_BUILT < '1950' AND e.PRIMARY_TITLE = 'Employee'
GROUP BY b.BUILDING_NAME
HAVING COUNT(DISTINCT e.MIT_ID) > 100
An error occurred: ORA-00904: "B"."FCLT_BUILDING_KEY": invalid identifier
An error occurred: ORA-00904: "B"."FCLT_BUILDING_KEY": invalid identifier
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT COUNT(*)
FROM COURSE_CATALOG_SUBJECT_OFFERED
WHERE DEPARTMENT_NAME = 'CENTER FOR INTERNATIONAL STUDIES'
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT COUNT(DISTINCT SUBJECT_ID)
FROM SUBJECT_OFFERED
WHERE NUM_ENROLLED_STUDENTS > 100
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT DISTINCT FULL_NAME
FROM EMPLOYEE_DIRECTORY
WHERE OFFICE_LOCATION IN (
    SELECT OFFICE_LOCATION
    FROM EMPLOYEE_DIRECTORY
    GROUP BY OFFICE_LOCATION
    HAVING COUNT(*) > 1
)
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT SUBJECT_GROUP_ID, COUNT(*)
FROM SUBJECT_OFFERED
WHERE TERM_CODE LIKE '%03%'
GROUP BY SUBJECT_GROUP_ID
SELECT SUBJECT_GROUP_ID, COUNT(*)
FROM WAREUSER.SUBJECT_OFFERED
WHERE TERM_CODE LIKE '%03%'
GROUP BY SUBJECT_GROUP_ID
An error occurred: ORA-00904: "SUBJECT_GROUP_ID": invalid identifier
An error occurred: ORA-00904: "SUBJECT_GROUP_ID": invalid identifier
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT INSTRUCTOR_NAME, COURSE_NAME, COUNT(TIP_MATERIAL_KEY)
FROM LIBRARY_COURSE_INSTRUCTOR
JOIN LIBRARY_SUBJECT_OFFERED
ON LIBRARY_COURSE_INSTRUCTOR.LIBRARY_COURSE_INSTRUCTOR_KEY = LIBRARY_SUBJECT_OFFERED.LIBRARY_COURSE_INSTRUCTOR_KEY
JOIN TIP_DETAIL
ON LIBRARY_SUBJECT_OFFERED.LIBRARY_SUBJECT_OFFERED_KEY = TIP_DETAIL.LIBRARY_SUBJECT_OFFERED_KEY
GROUP BY INSTRUCTOR_NAME, COURSE_NAME
SELECT INSTRUCTOR_NAME, COURSE_NAME, COUNT(TIP_MATERIAL_KEY)
FROM WAREUSER.LIBRARY_COURSE_INSTRUCTOR
JOIN LIBRARY_SUBJECT_OFFERED
ON WAREUSER.LIBRARY_COURSE_INSTRUCTOR.LIBRARY_COURSE_INSTRUCTOR_KEY = LIBRARY_SUBJECT_OFFERED.LIBRARY_COURSE_INSTRUCTOR_KEY
JOIN TIP_DETAIL
ON LIBRARY_SUBJECT_OFFERED.LIBRARY_SUBJECT_OFFERED_KEY = TIP_DETAIL.LIBRARY_SUBJECT_OFFERED_KEY
GROUP BY INSTRUCTOR_NAME, COURSE_NAME
SELECT INSTRUCTOR_NAME, COURSE_NAME, COUNT(TIP_MATERIAL_KEY)
FROM WAREUSER.LIBRARY_COURSE_INSTRUCTOR
JOIN WAREUSER.LIBRARY_SUBJECT_OFFERED
ON WAREUSER.LIBRARY_COURSE_INSTRUCTOR.LIBRARY_COURSE_INSTRUCTOR_KEY = WAREUSER.LIBRARY_SUBJECT_OFFERED.LIBRARY_COURSE_INSTRUCTOR_KEY
JOIN TIP_DETAIL
ON WAREUSER.LIBRARY_SUBJECT_OFFERED.LIBRARY_SUBJECT_OFFERED_KEY = TIP_DETAIL.LIBRARY_SUBJECT_OFFERED_KEY
GROUP BY INSTRUCTOR_NAME, COURSE_NAME
SELECT INSTRUCTOR_NAME, COURSE_NAME, COUNT(TIP_MATERIAL_KEY)
FROM WAREUSER.LIBRARY_COURSE_INSTRUCTOR
JOIN WAREUSER.LIBRARY_SUBJECT_OFFERED
ON WAREUSER.LIBRARY_COURSE_INSTRUCTOR.LIBRARY_COURSE_INSTRUCTOR_KEY = WAREUSER.LIBRARY_SUBJECT_OFFERED.LIBRARY_COURSE_INSTRUCTOR_KEY
JOIN WAREUSER.TIP_DETAIL
ON WAREUSER.LIBRARY_SUBJECT_OFFERED.LIBRARY_SUBJECT_OFFERED_KEY = WAREUSER.TIP_DETAIL.LIBRARY_SUBJECT_OFFERED_KEY
GROUP BY INSTRUCTOR_NAME, COURSE_NAME
An error occurred: ORA-00904: "LIBRARY_SUBJECT_OFFERED"."LIBRARY_COURSE_INSTRUCTOR_KEY": invalid identifier
An error occurred: ORA-00904: "WAREUSER"."LIBRARY_SUBJECT_OFFERED"."LIBRARY_COURSE_INSTRUCTOR_KEY": invalid identifier
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT BUILDING_NAME
FROM FAC_BUILDING
ORDER BY NUM_OF_ROOMS DESC
FETCH FIRST ROW ONLY
SELECT BUILDING_NAME
FROM WAREUSER.FAC_BUILDING
ORDER BY NUM_OF_ROOMS DESC
FETCH FIRST ROW ONLY
An error occurred: ORA-00933: SQL command not properly ended
An error occurred: ORA-00933: SQL command not properly ended
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT BUILDING_NAME
FROM (
    SELECT BUILDING_NAME, AVG(NUM_OF_ROOMS) AS AVG_ROOMS_PER_FLOOR
    FROM FCLT_BUILDING
    GROUP BY BUILDING_NAME
    ORDER BY AVG_ROOMS_PER_FLOOR DESC
)
WHERE ROWNUM = 1
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT MAJOR_USE, COUNT(*) AS USAGE_COUNT
FROM FCLT_MAJOR_USE
GROUP BY MAJOR_USE
ORDER BY USAGE_COUNT DESC
FETCH FIRST ROW ONLY
SELECT MAJOR_USE, COUNT(*) AS USAGE_COUNT
FROM WAREUSER.FCLT_MAJOR_USE
GROUP BY MAJOR_USE
ORDER BY USAGE_COUNT DESC
FETCH FIRST ROW ONLY
An error occurred: ORA-00933: SQL command not properly ended
An error occurred: ORA-00933: SQL command not properly ended
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT INSTRUCTOR_NAME
FROM (
    SELECT INSTRUCTOR_NAME, COUNT(*) AS SESSION_COUNT
    FROM LIBRARY_COURSE_INSTRUCTOR
    GROUP BY INSTRUCTOR_NAME
    ORDER BY SESSION_COUNT DESC
)
WHERE ROWNUM = 1
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT BUILDING_NAME
FROM FCLT_BUILDING
ORDER BY EXT_GROSS_AREA DESC
FETCH FIRST ROW ONLY
SELECT BUILDING_NAME
FROM WAREUSER.FCLT_BUILDING
ORDER BY EXT_GROSS_AREA DESC
FETCH FIRST ROW ONLY
An error occurred: ORA-00933: SQL command not properly ended
An error occurred: ORA-00933: SQL command not properly ended
[None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None, None]
------
SELECT COUNT(*) FROM HR_ORG_UNIT WHERE HR_DEPARTMENT_NAME <> HR_DEPARTMENT_NAME_ALPHA
[None]
------

In [66]:
df_q['responses_gpt_sql_q_a_log_20_1'] = gold_answers
#df_q['failures_gpt_sql_log'] = failures

# Calculate Accuracy, Precision, Recall and F1-Score

Accuracy: $\frac{\text{Number of correct predictions}}{\text{Total number of predictions}}$

Precision: $\frac{\text{True Positives}}{\text{True Positives} + \text{False Positives}}$

Recall: $\frac{\text{True Positives}}{\text{True Positives} + \text{False Negatives}}$

F1-Score: $2 \times \frac{\text{Precision} \times \text{Recall}}{\text{Precision} + \text{Recall}}$

In [26]:
def metric_(gold_set, prediction_set, recall=None):
  if gold_set is None or prediction_set is None:
    return np.array([0, 0, 0])
  if len(gold_set) == len(prediction_set) == 0:
    return np.array([1, 1, 1])

  true_positives = len(gold_set.intersection(prediction_set))
  false_positives = len(prediction_set - gold_set)
  false_negatives = len(gold_set - prediction_set)

  assert true_positives + false_positives == len(prediction_set)
  assert true_positives + false_negatives == len(gold_set)

  precision = true_positives / (true_positives + false_positives) if (true_positives + false_positives) != 0 else 1

  if recall is None:
    recall = true_positives / (true_positives + false_negatives) if (true_positives + false_negatives) != 0 else 0
  f1 = 2 * (precision * recall) / (precision + recall) if (precision + recall) != 0 else 0
  return np.array([precision, recall, f1])

In [32]:
a, b, c, d = [], [], [], []
for j in range(0,60,10):
    accuracies_nocontext, precisions_nocontext, recalls_nocontext, f1_scores_nocontext = calculate_metrics_for('responses_gpt_sql_q_a_log_{0}_1'.format(j))
    print(j)
    a.append(sum(accuracies_nocontext)/(len(df_q)))
    b.append(sum(precisions_nocontext)/(len(df_q)))
    c.append(sum(recalls_nocontext)/(len(df_q)))
    d.append(sum(f1_scores_nocontext)/(len(df_q)))
    print(sum(accuracies_nocontext)/(len(df_q)))
    print(sum(precisions_nocontext)/(len(df_q)))
    print(sum(recalls_nocontext)/(len(df_q)))
    print(sum(f1_scores_nocontext)/(len(df_q)))

0
0.16
0.2969417475728155
0.19384615384615386
0.19470792020069286
10
0.12
0.2956660214014537
0.1920650883365159
0.1931762750870442
20
0.14
0.31567014863354703
0.2403731396784062
0.23360394578240598
30
0.12
0.3001670308667636
0.217013177136708
0.19461386463200966
40
0.12
0.26006777528363706
0.21885391286082004
0.19556096792586444
50
0.12
0.26006777528363706
0.21885391286082004
0.19556096792586444

In [36]:
d

[0.19470792020069286,
 0.1931762750870442,
 0.23360394578240598,
 0.19461386463200966,
 0.19556096792586444,
 0.19556096792586444]

In [28]:
def calculate_metrics_for(gpt_format:str):
    accuracies = []
    precisions = []
    recalls = []
    f1_scores = []
    if 'expected_responses' in df_q.keys():
        for i in range(len(df_q)):
            if df_q['expected_responses'][i] is None or df_q[gpt_format][i] is None:
                accuracy_val,precision_val, recall_val, f1_val=  0,0,0,0
            else:
                gold = set(df_q['expected_responses'][i])
                prediction = set(df_q[gpt_format][i])
                accuracy_val = int(gold == prediction)
                precision_val, recall_val, f1_val = metric_(gold, prediction)
            accuracies.append(accuracy_val)
            precisions.append(precision_val)
            recalls.append(recall_val)
            f1_scores.append(f1_val)
    return [accuracies, precisions, recalls, f1_scores]

In [ ]:
accuracies_nocontext, precisions_nocontext, recalls_nocontext, f1_scores_nocontext = [], [], [], []
accuracies_nocontext, precisions_nocontext, recalls_nocontext, f1_scores_nocontext = calculate_metrics_for('responses_gpt_nocontent')
df_q['accuracies_nocontext'] = accuracies_nocontext
df_q['precisions_nocontext'] = precisions_nocontext
df_q['recalls_nocontext'] = recalls_nocontext
df_q['f1_scores_nocontext'] = f1_scores_nocontext

In [ ]:
arrray_of_metrics = ['accuracies', 'precisions', 'recalls', 'f1_scores']
for metric in arrray_of_metrics:
    print(metric + ' for nocontext: ' + str(sum(df_q[metric + '_nocontext'])/(len(df_q))))

In [ ]:
accuracies_global_schema, precisions_global_schema, recalls_global_schema, f1_scores_global_schema = calculate_metrics_for('responses_gpt_global_schema')
df_q['accuracies_global_schema'] = accuracies_global_schema
df_q['precisions_global_schema'] = precisions_global_schema
df_q['recalls_global_schema'] = recalls_global_schema
df_q['f1_scores_global_schema'] = f1_scores_global_schema

In [ ]:

for metric in arrray_of_metrics:
    print(metric + ' for global schema: ' + str(sum(df_q[metric + '_global_schema'])/(len(df_q))))

In [ ]:
accuracies_global_schema_log, precisions_global_schema_log, recalls_global_schema_log, f1_scores_global_schema_log = calculate_metrics_for('responses_gpt_sql_log')
df_q['accuracies_global_schema_logs'] = accuracies_global_schema_log
df_q['precisions_global_schema_logs'] = precisions_global_schema_log
df_q['recalls_global_schema_logs'] = recalls_global_schema_log
df_q['f1_scores_global_schema_logs'] = f1_scores_global_schema_log

In [ ]:

for metric in arrray_of_metrics:
    print(metric + ' for global schema & logs: ' + str(sum(df_q[metric + '_global_schema_logs'])/(len(df_q))))

## old accuracies

In [ ]:
arrray_of_metrics = ['accuracies', 'precisions', 'recalls', 'f1_scores']
for metric in arrray_of_metrics:
    print(metric + ' for nocontext: ' + str(sum([sum(a) for a in df_q[metric + '_nocontext']])/(len(df_q))))

In [ ]:
for metric in arrray_of_metrics:
    print(metric + ' for global schema: ' + str(sum([sum(a) for a in df_q[metric + '_global_schema']])/(len(df_q))))

In [ ]:
arrray_of_metrics = ['accuracies', 'precisions', 'recalls', 'f1_scores']
for metric in arrray_of_metrics:
    print(metric + ' for nocontext: ' + str(sum([sum(a) for a in df_q[metric + '_nocontext']])/(len(df_q))))

In [ ]:
for metric in arrray_of_metrics:
    print(metric + ' for global schema: ' + str(sum([sum(a) for a in df_q[metric + '_global_schema']])/(len(df_q))))

# Save Dataframe with generated answers

In [57]:
df_q.keys()

Index(['question', 'sql', 'tables', 'gpt_sql_q_a_log_20_1',
       'expected_responses', 'responses_gpt_sql_q_a_log_20_1',
       'gpt_sql_q_a_log_20_1.0', 'gpt_sql_q_a_log_20_1.1',
       'gpt_sql_q_a_log_20_1.2', 'responses_gpt_sql_q_a_log_20_1.0',
       'responses_gpt_sql_q_a_log_20_1.1', 'responses_gpt_sql_q_a_log_20_1.2',
       'gpt_sql_q_a_log_0_1.0', 'gpt_sql_q_a_log_0_1.1',
       'gpt_sql_q_a_log_0_1.2', 'gpt_sql_q_a_log_10_1.0',
       'gpt_sql_q_a_log_10_1.1', 'gpt_sql_q_a_log_10_1.2',
       'gpt_sql_q_a_log_30_1.0', 'gpt_sql_q_a_log_30_1.1',
       'gpt_sql_q_a_log_30_1.2', 'gpt_sql_q_a_log_40_1.0',
       'gpt_sql_q_a_log_40_1.1', 'gpt_sql_q_a_log_40_1.2',
       'gpt_sql_q_a_log_50_1.0', 'gpt_sql_q_a_log_50_1.1',
       'gpt_sql_q_a_log_50_1.2'],
      dtype='object')

In [58]:
df_q[['question', 'sql', 'tables', 'gpt_sql_q_a_log_20_1',
       'gpt_sql_q_a_log_20_1.0', 'gpt_sql_q_a_log_20_1.1',
       'gpt_sql_q_a_log_20_1.2', 'gpt_sql_q_a_log_0_1.0', 'gpt_sql_q_a_log_0_1.1',
       'gpt_sql_q_a_log_0_1.2', 'gpt_sql_q_a_log_10_1.0',
       'gpt_sql_q_a_log_10_1.1', 'gpt_sql_q_a_log_10_1.2',
       'gpt_sql_q_a_log_30_1.0', 'gpt_sql_q_a_log_30_1.1',
       'gpt_sql_q_a_log_30_1.2', 'gpt_sql_q_a_log_40_1.0',
       'gpt_sql_q_a_log_40_1.1', 'gpt_sql_q_a_log_40_1.2',
       'gpt_sql_q_a_log_50_1.0', 'gpt_sql_q_a_log_50_1.1',
       'gpt_sql_q_a_log_50_1.2']].to_csv(str(prefix) + '/data/gpt_eval_50querries_noAmb_v1.0.csv', index=False)

In [37]:
df_q.to_csv(str(prefix) + '/data/gpt_eval_50querries_noAmb_with_resp_v1.0.csv', index=False)

## Save information in file

In [ ]:
def save_accuracies(variant:str):
    current_datetime = datetime.datetime.now()
    file_content = '-->' + variant + '-' + str(current_datetime)+ ':\n'
    arrray_of_metrics = ['accuracies', 'precisions', 'recalls', 'f1_scores']
    for metric in arrray_of_metrics:
        file_content += metric + ' for nocontext: ' + str(sum(df_q[metric + '_nocontext'])/(len(df_q))) + '\n'
    for metric in arrray_of_metrics:
        file_content += metric + ' for global schema: ' + str(sum(df_q[metric + '_global_schema'])/(len(df_q)))+ '\n'
    for metric in arrray_of_metrics:
        file_content += metric + ' for global schema & logs: ' + str(sum(df_q[metric + '_global_schema_logs'])/(len(df_q)))+ '\n'
    with open(str(prefix) + '/data/evaluation.txt', "a") as file:
        file.write(file_content)

In [ ]:
save_accuracies('50_querries_no_ambiguity')